{
  "cycloneMessage": {
    "advisoryNumber": "5",
    "atcfID": "AL072017",
    "centerLocLatitude": "18.6",
    "centerLocLatitudeExpanded": "18.6N",
    "centerLocLongitude": "-85.9",
    "centerLocLongitudeExpanded": "85.9W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT2 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Franklin Advisory Number   5\nNWS National Hurricane Center Miami FL       AL072017\n400 PM CDT Mon Aug 07 2017\n\n...FRANKLIN EXPECTED TO STRENGTHEN SOME MORE BEFORE LANDFALL...\n\n\nSUMMARY OF 400 PM CDT...2100 UTC...INFORMATION\n----------------------------------------------\nLOCATION...18.6N 85.9W\nABOUT 170 MI...270 KM ENE OF BELIZE CITY\nABOUT 155 MI...255 KM E OF CHETUMAL MEXICO\nMAXIMUM SUSTAINED WINDS...60 MPH...95 KM/H\nPRESENT MOVEMENT...NW OR 310 DEGREES AT 13 MPH...20 KM/H\nMINIMUM CENTRAL PRESSURE...998 MB...29.47 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Watch is in effect for...\n* The coast of Mexico from Chetumal to Punta Allen\n\nA Tropical Storm Warning is in effect for...\n* Belize City northward to the border of Mexico\n* The coast of Mexico from Chetumal to Campeche\n\nA Tropical Storm Watch is in effect for...\n* The coast of Mexico from Campeche to Sabancuy\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area, in this case within the next 24 hours.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area, in this case within\n24 hours.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area.\n\nInterests elsewhere around the Bay of Campeche should monitor the\nprogress of this system.  A Hurricane Watch may be required for a\nportion of the southwestern Gulf coast of Mexico this evening.\n\nFor storm information specific to your area, please monitor\nproducts issued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 400 PM CDT (2100 UTC), the center of Tropical Storm Franklin was\nlocated near latitude 18.6 North, longitude 85.9 West. Franklin is\nmoving toward the northwest near 13 mph (20 km/h), and a\nwest-northwestward to westward motion is expected over the next 48\nhours.  On the forecast track, the center will be near the east\ncoast of the Yucatan Peninsula this evening or tonight.  Franklin\nis then expected to move across the Yucatan Peninsula on Tuesday,\nand into the Bay of Campeche Tuesday evening or Tuesday night.\n\nMaximum sustained winds are near 60 mph (95 km/h) with higher gusts.\nSome strengthening is expected before the center reaches the\nYucatan Peninsula, and Franklin could be near hurricane intensity at\nlandfall on the east coast of the Yucatan Peninsula.\n\nTropical-storm-force winds extend outward up to 140 miles (220 km)\nfrom the center.\n\nThe estimated minimum central pressure is 998 mb (29.47 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Rainfall amounts of 3 to 6 inches, with isolated amounts\nof around 12 inches, are possible across the Yucatan Peninsula of\nMexico and Belize through Wednesday, with the highest amounts over\nthe Mexican state of Quintana Roo.  These rains could produce\nlife-threatening flash floods.\n\nWIND:  Hurricane conditions are possible in the Hurricane Watch\narea by this evening.  Tropical storm conditions are expected to\nbegin in portions of the warning area this afternoon or evening.\nTropical storm conditions are possible in the watch area in Mexico\non Tuesday.\n\nSTORM SURGE:  A dangerous storm surge will raise water levels by\nas much as 2 to 4 feet above normal tide levels along the immediate\ncoast near and to the north of where the center makes landfall.\nNear the coast, the surge will be accompanied by large and\ndestructive waves.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 700 PM CDT.\nNext complete advisory at 1000 PM CDT.\n\n$$\nForecaster Pasch\n\nNNNN",
    "messageBinNumber": "2",
    "messageDateTimeLocal": "20170807 04:00:00 PM CDT",
    "messageDateTimeLocalStr": "0400 PM CDT Mon Aug 07",
    "messageDateTimeUTC": "20170807 09:00:00 PM UTC",
    "messageDateTimeUTC24": "201708072100",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "NW OR 310 DEGREES",
    "systemGeoRefPt1": "ABOUT 170 MI...270 KM ENE OF BELIZE CITY",
    "systemGeoRefPt2": "ABOUT 155 MI...255 KM E OF CHETUMAL MEXICO",
    "systemIntensityKph": "95",
    "systemIntensityKts": "50",
    "systemIntensityMph": "60",
    "systemMslpInHg": "29.47",
    "systemMslpMb": "998",
    "systemName": "FRANKLIN",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "20",
    "systemSpeedKts": "11",
    "systemSpeedMph": "13",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1502139600"
  }
}
