{
  "cycloneMessage": {
    "advisoryNumber": "8A",
    "atcfID": "AL072017",
    "centerLocLatitude": "20.0",
    "centerLocLatitudeExpanded": "20.0N",
    "centerLocLongitude": "-89.9",
    "centerLocLongitudeExpanded": "89.9W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT2 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Franklin Intermediate Advisory Number 8A\nNWS National Hurricane Center Miami FL       AL072017\n100 PM CDT Tue Aug 08 2017\n\n...FRANKLIN BRINGING HEAVY RAINS TO PORTIONS OF THE YUCATAN\nPENINSULA...\n\n\nSUMMARY OF 100 PM CDT...1800 UTC...INFORMATION\n----------------------------------------------\nLOCATION...20.0N 89.9W\nABOUT 40 MI...65 KM E OF CAMPECHE MEXICO\nMAXIMUM SUSTAINED WINDS...40 MPH...65 KM/H\nPRESENT MOVEMENT...WNW OR 290 DEGREES AT 12 MPH...19 KM/H\nMINIMUM CENTRAL PRESSURE...1002 MB...29.59 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Watch is in effect for...\n* The coast of Mexico from Puerto de Veracruz to Rio Panuco\n\nA Tropical Storm Warning is in effect for...\n* The coast of Mexico from Rio Lagartos to Sabancuy\n* The coast of Mexico from Puerto de Veracruz to Rio Panuco\n\nA Tropical Storm Watch is in effect for...\n* The coast of Mexico from Sabancuy to Puerto de Veracruz\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area within 36 hours.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area.\n\nFor storm information specific to your area, please monitor\nproducts issued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 100 PM CDT (1800 UTC), the center of Tropical Storm Franklin was\nlocated near latitude 20.0 North, longitude 89.9 West.  Franklin is\nmoving toward the west-northwest near 12 mph (19 km/h).  A\nwest-northwestward to westward motion is expected over the next\ncouple of days.  On the forecast track, the center of Franklin will\nmove into the Bay of Campeche later today, move westward across the\nBay of Campeche tonight and Wednesday, and be near the coast of\nmainland Mexico Wednesday night or early Thursday.\n\nMaximum sustained winds are near 40 mph (65 km/h) with higher\ngusts. Some additional weakening may occur until the center moves\nback over water, and strengthening is expected thereafter until\nlandfall occurs in mainland Mexico.\n\nTropical-storm-force winds extend outward up to 140 miles (220 km)\nfrom the center.\n\nThe estimated minimum central pressure is 1002 mb (29.59 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Franklin is expected to produce total rainfall\naccumulations of 4 to 8 inches and isolated maximum amounts of 12\ninches are possible across portions of the Yucatan Peninsula of\nMexico through Wednesday.  Rainfall totals of 2 to 4 inches with\nisolated maximum amounts of 8 inches are possible across northern\nportions of Belize and northern portions of Guatemala.  Rainfall\ntotals of 4 to 8 inches with isolated maximum amounts of 15 inches\nare possible across the Mexican states of Tabasco, northern\nVeracruz, northern Puebla, Tlaxacala, Hidalgo, Queretar and eastern\nSan Louis Potosi in eastern Mexico.  These rains may produce\nlife-threatening flash floods and mudslides.\n\nWIND:  Tropical storm conditions are likely still occurring over\nportions of the northern and western Yucatan peninsula.\nHurricane conditions are possible within the Hurricane Watch area\nby Wednesday evening.  Tropical storm conditions are expected\nwithin the Tropical Storm Warning area in mainland Mexico by\nWednesday evening.  Tropical storm conditions are possible\nwithin the tropical storm watch area today and tonight.\n\nSTORM SURGE:  A dangerous storm surge will raise water levels by\nas much as 2 to 4 feet above normal tide levels along the\nimmediate coast near and to the north of where the center\nmakes landfall in the Hurricane Watch area.  Near the coast, the\nsurge will be accompanied by large and destructive waves.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 400 PM CDT.\n\n$$\nForecaster Pasch\n\nNNNN",
    "messageBinNumber": "2",
    "messageDateTimeLocal": "20170808 01:00:00 PM CDT",
    "messageDateTimeLocalStr": "0100 PM CDT Tue Aug 08",
    "messageDateTimeUTC": "20170808 06:00:00 PM UTC",
    "messageDateTimeUTC24": "201708081800",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "WNW OR 290 DEGREES",
    "systemGeoRefPt1": "ABOUT 40 MI...65 KM E OF CAMPECHE MEXICO",
    "systemIntensityKph": "65",
    "systemIntensityKts": "35",
    "systemIntensityMph": "40",
    "systemMslpInHg": "29.59",
    "systemMslpMb": "1002",
    "systemName": "FRANKLIN",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "19",
    "systemSpeedKts": "10",
    "systemSpeedMph": "12",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1502215200"
  }
}
