{
  "cycloneMessage": {
    "advisoryNumber": "3",
    "atcfID": "AL072017",
    "centerLocLatitude": "17.1",
    "centerLocLatitudeExpanded": "17.1N",
    "centerLocLongitude": "-84.2",
    "centerLocLongitudeExpanded": "84.2W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT2 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Franklin Advisory Number   3\nNWS National Hurricane Center Miami FL       AL072017\n500 AM EDT Mon Aug 07 2017\n\n...FRANKLIN GRADUALLY GETTING BETTER ORGANIZED...\n...HURRICANE WATCH ISSUED FOR A PORTION OF THE YUCATAN COAST...\n\n\nSUMMARY OF 500 AM EDT...0900 UTC...INFORMATION\n----------------------------------------------\nLOCATION...17.1N 84.2W\nABOUT 285 MI...460 KM ESE OF CHETUMAL MEXICO\nABOUT 265 MI...425 KM E OF BELIZE CITY\nMAXIMUM SUSTAINED WINDS...45 MPH...75 KM/H\nPRESENT MOVEMENT...WNW OR 300 DEGREES AT 13 MPH...20 KM/H\nMINIMUM CENTRAL PRESSURE...1005 MB...29.68 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe government of Mexico has issued a Hurricane Watch for a portion\nof the eastern Yucatan peninsula from Chetumal to Punta Allen.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Watch is in effect for...\n* The coast of Mexico from Chetumal to Punta Allen\n\nA Tropical Storm Warning is in effect for...\n* The coast of Mexico from Chetumal to Campeche\n\nA Tropical Storm Watch is in effect for...\n* Belize City northward to the border of Mexico\n* The coast of Mexico from Campeche to Sabancuy\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area, in this case within the next 24 hours.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area, in this case within\n24 hours.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area.\n\nInterests elsewhere around the Bay of Campeche should monitor the\nprogress of this system.\n\nFor storm information specific to your area, please monitor\nproducts issued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 500 AM EDT (0900 UTC), the center of Tropical Storm Franklin was\nlocated near latitude 17.1 North, longitude 84.2 West. Franklin is\nmoving toward the west-northwest near 13 mph (20 km/h) and this\ngeneral motion is expected to continue over the next 48 hours.  On\nthe forecast track, the center of Franklin will pass well north of\nHonduras today, then approach the east coast of the Yucatan\npeninsula by late afternoon.  Franklin is then expected to move\nacross the Yucatan Peninsula tonight and on Tuesday.\n\nMaximum sustained winds are near 45 mph (75 km/h) with higher gusts.\nStrengthening is forecast until the center reaches the eastern coast\nof the Yucatan peninsula, and Franklin could be near hurricane\nstrength by the time landfall occurs this evening.\n\nTropical-storm-force winds extend outward up to 140 miles (220 km)\nfrom the center.\n\nThe estimated minimum central pressure is 1005 mb (29.68 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Rainfall amounts of 3 to 6 inches, with isolated amounts\nof around 12 inches, are possible across the Yucatan Peninsula of\nMexico and Belize through Wednesday.  These rains could produce\nlife-threatening flash floods.\n\nWIND:  Hurricane conditions are possible in the Hurricane Watch\narea by this evening.  Tropical Storm conditions are expected to\nbegin in portions of the warning area this afternoon.  Tropical\nStorm conditions are possible in portions of the watch area in\nBelize by late afternoon.  Tropical Storm conditions are possible in\nthe watch area in Mexico on Tuesday.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 800 AM EDT.\nNext complete advisory at 1100 AM EDT.\n\n$$\nForecaster Stewart\n\nNNNN",
    "messageBinNumber": "2",
    "messageDateTimeLocal": "20170807 05:00:00 AM EDT",
    "messageDateTimeLocalStr": "0500 AM EDT Mon Aug 07",
    "messageDateTimeUTC": "20170807 09:00:00 AM UTC",
    "messageDateTimeUTC24": "201708070900",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "WNW OR 300 DEGREES",
    "systemGeoRefPt1": "ABOUT 285 MI...460 KM ESE OF CHETUMAL MEXICO",
    "systemGeoRefPt2": "ABOUT 265 MI...425 KM E OF BELIZE CITY",
    "systemIntensityKph": "75",
    "systemIntensityKts": "40",
    "systemIntensityMph": "45",
    "systemMslpInHg": "29.68",
    "systemMslpMb": "1005",
    "systemName": "FRANKLIN",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "20",
    "systemSpeedKts": "11",
    "systemSpeedMph": "13",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1502096400"
  }
}
