{
  "cycloneMessage": {
    "advisoryNumber": "10",
    "atcfID": "AL072017",
    "centerLocLatitude": "20.3",
    "centerLocLatitudeExpanded": "20.3N",
    "centerLocLongitude": "-91.3",
    "centerLocLongitudeExpanded": "91.3W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT2 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Franklin Advisory Number  10\nNWS National Hurricane Center Miami FL       AL072017\n1000 PM CDT Tue Aug 08 2017\n\n...FRANKLIN STRENGTHENING OVER THE BAY OF CAMPECHE...\n...HURRICANE WARNING ISSUED FOR PORTIONS OF THE MEXICAN STATE OF\nVERACRUZ...\n\n\nSUMMARY OF 1000 PM CDT...0300 UTC...INFORMATION\n-----------------------------------------------\nLOCATION...20.3N 91.3W\nABOUT 250 MI...400 KM NE OF COATZACOALCOS MEXICO\nABOUT 325 MI...525 KM ENE OF VERACRUZ MEXICO\nMAXIMUM SUSTAINED WINDS...50 MPH...85 KM/H\nPRESENT MOVEMENT...WNW OR 285 DEGREES AT 10 MPH...17 KM/H\nMINIMUM CENTRAL PRESSURE...996 MB...29.42 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe government of Mexico has issued a Hurricane Warning from Puerto\nde Veracruz to Tuxpan.  A Tropical Storm Warning has been issued\nfrom Sabancuy to east of Puerto de Veracruz.  The Tropical Storm\nWarning east of Celestun has been discontinued.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Warning is in effect for...\n* The coast of Mexico from Puerto de Veracruz to Tuxpan\n\nA Hurricane Watch is in effect for...\n* The coast of Mexico north of Tuxpan to Rio Panuco\n\nA Tropical Storm Warning is in effect for...\n* The coast of Mexico east of Puerto de Veracruz to Celestun\n* The coast of Mexico north of Tuxpan to Rio Panuco\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area, in this case within 24 to 36\nhours.  Preparations to protect life and property should be rushed\nto completion.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area.\n\nFor storm information specific to your area, please monitor\nproducts issued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 1000 PM CDT (0300 UTC), the center of Tropical Storm Franklin was\nlocated near latitude 20.3 North, longitude 91.3 West.  Franklin is\nmoving toward the west-northwest near 10 mph (17 km/h).  A turn\ntoward the west is expected overnight, with Franklin maintaining\nthat motion up until landfall.  On the forecast track, the center\nof Franklin will move westward over the Bay of Campeche overnight\nand on Wednesday and is forecast to cross the coast of the Mexican\nstate of Veracruz Wednesday night or early Thursday.\n\nReports from Air Force Reserve and NOAA Hurricane Hunter aircraft\nindicate that maximum sustained winds have increased to near 50\nmph (85 km/h) with higher gusts.  Additional strengthening is\nexpected, and Franklin is forecast to become a hurricane late\nWednesday and reach the coast of Mexico as a hurricane Wednesday\nnight.\n\nTropical-storm-force winds extend outward up to 185 miles (295 km)\nfrom the center.\n\nThe latest minimum central pressure reported by an Air Force Reserve\nreconnaissance aircraft is 996 mb (29.42 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Franklin is expected to produce total rainfall\naccumulations of 4 to 8 inches, and isolated maximum amounts of 12\ninches are possible across portions of the Yucatan Peninsula of\nMexico through tonight.  Rainfall totals of 4 to 8 inches with\nisolated maximum amounts of 15 inches are possible across the\nMexican states of Tabasco, northern Veracruz, northern Puebla,\nTlaxcala, Hidalgo, Queretaro, and eastern San Louis Potosi in\neastern Mexico.  These rains may produce life-threatening flash\nfloods and mudslides.\n\nWIND:  Hurricane conditions are expected to reach the coast within\nthe Hurricane Warning area by Wednesday night.  Winds are expected\nto first reach tropical storm strength on Wednesday, making outside\npreparations difficult or dangerous.  Preparations to protect life\nand property should be rushed to completion.\n\nTropical storm conditions are expected across portions of the\nTropical Storm Warning area along the southern shore of the\nBay of Campeche through Wednesday night. Hurricane conditions are\npossible within the Hurricane Watch area Wednesday night.  Tropical\nstorm conditions are expected within the Tropical Storm Warning area\nin mainland Mexico by Wednesday evening.\n\nSTORM SURGE:  A dangerous storm surge will raise water levels by\nas much as 2 to 4 feet above normal tide levels along the\nimmediate coast near and to the north of where the center\nmakes landfall in the Hurricane Watch area.  Near the coast, the\nsurge will be accompanied by large and destructive waves.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 100 AM CDT.\nNext complete advisory at 400 AM CDT.\n\n$$\nForecaster Berg\n\nNNNN",
    "messageBinNumber": "2",
    "messageDateTimeLocal": "20170808 10:00:00 PM CDT",
    "messageDateTimeLocalStr": "1000 PM CDT Tue Aug 08",
    "messageDateTimeUTC": "20170809 03:00:00 AM UTC",
    "messageDateTimeUTC24": "201708090300",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "WNW OR 285 DEGREES",
    "systemGeoRefPt1": "ABOUT 250 MI...400 KM NE OF COATZACOALCOS MEXICO",
    "systemGeoRefPt2": "ABOUT 325 MI...525 KM ENE OF VERACRUZ MEXICO",
    "systemIntensityKph": "85",
    "systemIntensityKts": "45",
    "systemIntensityMph": "50",
    "systemMslpInHg": "29.42",
    "systemMslpMb": "996",
    "systemName": "FRANKLIN",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "17",
    "systemSpeedKts": "9",
    "systemSpeedMph": "10",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1502247600"
  }
}
