{
  "cycloneMessage": {
    "advisoryNumber": "7",
    "atcfID": "AL072017",
    "centerLocLatitude": "19.3",
    "centerLocLatitudeExpanded": "19.3N",
    "centerLocLongitude": "-88.5",
    "centerLocLongitudeExpanded": "88.5W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT2 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Franklin Advisory Number   7\nNWS National Hurricane Center Miami FL       AL072017\n400 AM CDT Tue Aug 08 2017\n\n...FRANKLIN WEAKENS OVER THE INTERIOR OF THE YUCATAN PENINSULA...\n...HEAVY RAINS AND FLASH FLOODING POSSIBLE ACROSS THE YUCATAN\nPENINSULA AND SOUTHEASTERN MEXICO...\n\n\nSUMMARY OF 400 AM CDT...0900 UTC...INFORMATION\n----------------------------------------------\nLOCATION...19.3N 88.5W\nABOUT 55 MI...90 KM NNW OF CHETUMAL MEXICO\nABOUT 135 MI...220 KM ESE OF CAMPECHE MEXICO\nMAXIMUM SUSTAINED WINDS...50 MPH...85 KM/H\nPRESENT MOVEMENT...WNW OR 290 DEGREES AT 14 MPH...22 KM/H\nMINIMUM CENTRAL PRESSURE...998 MB...29.47 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Watch is in effect for...\n* The coast of Mexico from Puerto de Veracruz to Rio Panuco\n\nA Tropical Storm Warning is in effect for...\n* Belize City northward to the Belize/Mexico border\n* The coast of Mexico from Chetumal to Sabancuy\n\nA Tropical Storm Watch is in effect for...\n* The coast of Mexico from Sabancuy to Puerto de Veracruz\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours\nbefore the anticipated first occurrence of tropical-storm-force\nwinds, conditions that make outside preparations difficult or\ndangerous.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, generally within 48 hours.\n\nFor storm information specific to your area, please monitor\nproducts issued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 400 AM CDT (0900 UTC), the center of Tropical Storm Franklin\nwas located by the Belize Weather Service Doppler radar to be near\nlatitude 19.3 North, longitude 88.5 West. Franklin is moving toward\nthe west-northwest near 14 mph (22 km/h).  A west-northwestward to\nwestward motion is expected during the next couple of days.  On the\nforecast track, the center of Franklin will continue to move across\nthe Yucatan peninsula through today, and emerge over the Bay of\nCampeche tonight. Franklin will then move westward across the Bay of\nCampeche on Wednesday.\n\nMaximum sustained winds have decreased to near 50 mph (85 km/h) with\nhigher gusts. Weakening is expected while Franklin moves across the\nYucatan peninsula today.  Restrengthening is forecast to begin\ntonight and Wednesday while Franklin moves over the Bay of Campeche.\n\nTropical-storm-force winds extend outward up to 140 miles (220 km)\nfrom the center. Wind gusts to 47 mph (76 km/h) in squalls have been\nmeasured during the past couple of hours by NOAA Buoy 42056,\nlocated more than 200 miles east-northeast of Franklin's center.\n\nThe estimated minimum central pressure is 998 mb (29.47 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Rainfall amounts of 3 to 6 inches, with isolated amounts\nof around 12 inches, are possible across the Yucatan Peninsula of\nMexico and Belize through Wednesday, with the highest amounts over\nthe Mexican state of Quintana Roo.  In addition, Franklin is\nexpected to bring 4 to 8 inches of rainfall with isolated amounts\nup to 15 inches through Thursday to northern Veracruz, Puebla,\nTlaxcala, Hidalgo, and eastern San Louis Potosi in eastern Mexico.\nThese rains will be capable of producing life-threatening flash\nfloods and mudslides.\n\nWIND:  Tropical storm conditions are likely still occurring over\nportions of the east coast of the Yucatan peninsula. These\nconditions should spread westward across the remainder of the\nwarning area today and diminish along the east coast of the Yucatan\npeninsula later this morning. Hurricane or tropical storm conditions\nare possible within the hurricane watch area by late Wednesday.\nTropical storm conditions are possible within the tropical storm\nwatch area tonight and Wednesday.\n\nSTORM SURGE:  A storm surge will raise water levels by as much\nas 1 foot above normal tide levels along the east coast of the\nYucatan peninsula early this morning.  The surge will be\naccompanied by large and destructive waves. Water levels are\nexpected to diminish after sunrise.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 700 AM CDT.\nNext complete advisory at 1000 AM CDT.\n\n$$\nForecaster Stewart\n\nNNNN",
    "messageBinNumber": "2",
    "messageDateTimeLocal": "20170808 04:00:00 AM CDT",
    "messageDateTimeLocalStr": "0400 AM CDT Tue Aug 08",
    "messageDateTimeUTC": "20170808 09:00:00 AM UTC",
    "messageDateTimeUTC24": "201708080900",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "WNW OR 290 DEGREES",
    "systemGeoRefPt1": "ABOUT 55 MI...90 KM NNW OF CHETUMAL MEXICO",
    "systemGeoRefPt2": "ABOUT 135 MI...220 KM ESE OF CAMPECHE MEXICO",
    "systemIntensityKph": "85",
    "systemIntensityKts": "45",
    "systemIntensityMph": "50",
    "systemMslpInHg": "29.47",
    "systemMslpMb": "998",
    "systemName": "FRANKLIN",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "22",
    "systemSpeedKts": "12",
    "systemSpeedMph": "14",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1502182800"
  }
}
