{
  "cycloneMessage": {
    "advisoryNumber": "6",
    "atcfID": "AL072017",
    "centerLocLatitude": "19.1",
    "centerLocLatitudeExpanded": "19.1N",
    "centerLocLongitude": "-87.3",
    "centerLocLongitudeExpanded": "87.3W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT2 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Franklin Advisory Number   6\nNWS National Hurricane Center Miami FL       AL072017\n1000 PM CDT Mon Aug 07 2017\n\n...FRANKLIN POISED TO MAKE LANDFALL ON THE EAST COAST OF THE\nYUCATAN PENINSULA VERY SOON...\n...HEAVY RAINS AND FLASH FLOODING POSSIBLE ACROSS THE YUCATAN\nPENINSULA AND BELIZE...\n\n\nSUMMARY OF 1000 PM CDT...0300 UTC...INFORMATION\n-----------------------------------------------\nLOCATION...19.1N 87.3W\nABOUT 75 MI...125 KM ENE OF CHETUMAL MEXICO\nABOUT 75 MI...125 KM S OF TULUM MEXICO\nMAXIMUM SUSTAINED WINDS...60 MPH...95 KM/H\nPRESENT MOVEMENT...WNW OR 300 DEGREES AT 14 MPH...22 KM/H\nMINIMUM CENTRAL PRESSURE...995 MB...29.39 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe government of Mexico has issued a Hurricane Watch for the coast\nof mainland Mexico from Puerto de Veracruz northward to Rio Panuco.\nThe Tropical Storm Warning has been extended southward from\nCampeche to Sabancuy, and a Tropical Storm Watch has been issued\nwest of Sabancuy to east of Puerto de Veracruz.  The Hurricane Watch\nfor the east coast of the Yucatan peninsula has been discontinued.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Watch is in effect for...\n* The coast of Mexico from Puerto de Veracruz to Rio Panuco\n\nA Tropical Storm Warning is in effect for...\n* Belize City northward to the Belize/Mexico border\n* The coast of Mexico from Chetumal to Sabancuy\n\nA Tropical Storm Watch is in effect for...\n* The coast of Mexico from Sabancuy to Puerto de Veracruz\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours\nbefore the anticipated first occurrence of tropical-storm-force\nwinds, conditions that make outside preparations difficult or\ndangerous.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, generally within 48 hours.\n\nFor storm information specific to your area, please monitor\nproducts issued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 1000 PM CDT (0300 UTC), the center of Tropical Storm Franklin was\nlocated near latitude 19.1 North, longitude 87.3 West.  Franklin is\nmoving toward the west-northwest near 14 mph (22 km/h).  A west-\nnorthwestward to westward motion is expected during the next couple\nof days.  On the forecast track, the center of Franklin will cross\nthe east coast of the Yucatan peninsula in the next hour or two,\ntraverse the Yucatan peninsula overnight and on Tuesday, and emerge\nover the Bay of Campeche late Tuesday.  Franklin will then continue\nwestward across the Bay of Campeche on Wednesday.\n\nMaximum sustained winds are near 60 mph (95 km/h) with higher gusts.\nWeakening is expected while Franklin moves across the Yucatan\npeninsula overnight and on Tuesday.  Restrengthening is forecast\nTuesday night and Wednesday while Franklin moves over the Bay of\nCampeche.\n\nTropical-storm-force winds extend outward up to 140 miles (220 km)\nfrom the center.\n\nThe estimated minimum central pressure is 995 mb (29.39 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Rainfall amounts of 3 to 6 inches, with isolated amounts\nof around 12 inches, are possible across the Yucatan peninsula of\nMexico and Belize through Wednesday, with the highest amounts over\nthe Mexican state of Quintana Roo.  These rains could produce\nlife-threatening flash floods.\n\nWIND:  Tropical storm conditions are likely occurring over portions\nof the east coast of the Yucatan peninsula and should spread\nwestward across the remainder of the warning area overnight and on\nTuesday.  Hurricane or tropical storm conditions are possible within\nthe hurricane watch area by late Wednesday.  Tropical storm\nconditions are possible within the tropical storm watch area\nTuesday night and Wednesday.\n\nSTORM SURGE:  A dangerous storm surge will raise water levels by\nas much as 2 to 4 feet above normal tide levels along the immediate\ncoast near and to the north of where the center makes landfall.\nNear the coast, the surge will be accompanied by large and\ndestructive waves.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 100 AM CDT.\nNext complete advisory at 400 AM CDT.\n\n$$\nForecaster Berg\n\nNNNN",
    "messageBinNumber": "2",
    "messageDateTimeLocal": "20170807 10:00:00 PM CDT",
    "messageDateTimeLocalStr": "1000 PM CDT Mon Aug 07",
    "messageDateTimeUTC": "20170808 03:00:00 AM UTC",
    "messageDateTimeUTC24": "201708080300",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "WNW OR 300 DEGREES",
    "systemGeoRefPt1": "ABOUT 75 MI...125 KM ENE OF CHETUMAL MEXICO",
    "systemGeoRefPt2": "ABOUT 75 MI...125 KM S OF TULUM MEXICO",
    "systemIntensityKph": "95",
    "systemIntensityKts": "50",
    "systemIntensityMph": "60",
    "systemMslpInHg": "29.39",
    "systemMslpMb": "995",
    "systemName": "FRANKLIN",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "22",
    "systemSpeedKts": "12",
    "systemSpeedMph": "14",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1502161200"
  }
}
