{
  "cycloneMessage": {
    "advisoryNumber": "24",
    "atcfID": "AL092017",
    "centerLocLatitude": "28.5",
    "centerLocLatitudeExpanded": "28.5N",
    "centerLocLongitude": "-97.2",
    "centerLocLongitudeExpanded": "97.2W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT4 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Harvey Advisory Number  24\nNWS National Hurricane Center Miami FL       AL092017\n400 AM CDT Sat Aug 26 2017\n\n...HARVEY MOVING SLOWLY INLAND OVER SOUTH TEXAS...\n...CATASTROPHIC FLOODING EXPECTED OVER THE NEXT FEW DAYS DUE TO\nHEAVY RAINFALL...\n\n\nSUMMARY OF 400 AM CDT...0900 UTC...INFORMATION\n----------------------------------------------\nLOCATION...28.5N 97.2W\nABOUT 30 MI...50 KM SW OF VICTORIA TEXAS\nABOUT 105 MI...170 KM SE OF SAN ANTONIO TEXAS\nMAXIMUM SUSTAINED WINDS...100 MPH...155 KM/H\nPRESENT MOVEMENT...NW OR 325 DEGREES AT 6 MPH...9 KM/H\nMINIMUM CENTRAL PRESSURE...963 MB...28.44 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe Hurricane Warning and Storm Surge Warning have been\ndiscontinued south of Baffin Bay.  The Hurricane Warning north of\nPort O'Connor to Sargent has been changed to a Tropical Storm\nWarning.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Warning is in effect for...\n* Baffin Bay to High Island Texas\n\nA Hurricane Warning is in effect for...\n* Baffin Bay to Port O'Connor Texas\n\nA Tropical Storm Warning is in effect for...\n* North of Port O'Connor to High Island Texas\n\nA Storm Surge Warning means there is a danger of life-threatening\ninundation from rising water moving inland from the coastline in the\nindicated locations. For a depiction of areas at risk, please see\nthe National Weather Service Storm Surge Watch/Warning Graphic,\navailable at hurricanes.gov.  This is a life-threatening situation.\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area. Preparations to protect life and\nproperty should already be complete.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning.\n\nInterests in southwestern Louisiana should continue to monitor the\nprogress of this system.\n\nFor storm information specific to your area, including possible\ninland watches and warnings, please monitor products issued by your\nlocal National Weather Service forecast office.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 400 AM CDT (0900 UTC), the eye of Hurricane Harvey was located\nby NOAA Doppler radar near latitude 28.5 North, longitude 97.2 West.\nHarvey is moving toward the northwest near 6 mph (9 km/h).  Harvey\nis expected to slow down through the day and meander over\nsoutheastern Texas through the middle of next week.\n\nDoppler radar data indicate that maximum sustained winds have\ndecreased to near 100 mph (155 km/h) with higher gusts.  Additional\nweakening is forecast, and Harvey is likely to become a tropical\nstorm later today.\n\nHurricane-force winds extend outward up to 35 miles (55 km) from the\ncenter, and tropical-storm-force winds extend outward up to 140\nmiles (220 km).\n\nThe estimated minimum central pressure is 963 mb (28.44 inches).\n\nAlmost 10 inches of rain have already been reported at a few\nlocations in southeastern Texas.\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Harvey is expected to produce total rain accumulations of\n15 to 30 inches and isolated maximum amounts of 40 inches over the\nmiddle and upper Texas coast through next Wednesday. During the same\ntime period Harvey is expected to produce total rain accumulations\nof 5 to 15 inches in far south Texas and the Texas Hill Country over\nthrough southwest and central Louisiana. Rainfall of this magnitude\nwill cause catastrophic and life-threatening flooding.\n\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following heights above ground if the peak\nsurge occurs at the time of high tide...\n\nPort Aransas to Port O'Connor...6 to 12 ft\nPort O'Connor to Sargent...6 to 9 ft\nSargent to Jamaica Beach...4 to 6 ft\nBaffin Bay to Port Aransas...3 to 6 ft\nJamaica Beach to High Island...2 to 4 ft\nMouth of the Rio Grande to Port Mansfield...1 to 3 ft\nHigh Island to Morgan City...1 to 3 ft\n\nThe deepest water will occur along the immediate coast near and to\nthe northeast of the landfall location, where the surge will be\naccompanied by large and destructive waves.  Surge-related flooding\ndepends on the relative timing of the surge and the tidal cycle, and\ncan vary greatly over short distances.  For information specific to\nyour area, please see products issued by your local National Weather\nService forecast office.\n\nWIND:  Hurricane conditions are occuring inland from the coast\nwithin Harvey's eyewall, and hurricane-force winds, especially in\ngusts, are still possible near the middle Texas coast for the next\nseveral hours.  Tropical storm conditions are occurring in other\nportions of the hurricane and tropical storm warning areas.\nTropical storm conditions are likely to persist along portions of\nthe coast through at least Sunday.\n\nSURF:  Swells generated by Harvey are affecting the Texas,\nLouisiana, and northeast Mexico coasts.  These swells are likely to\ncause life-threatening surf and rip current conditions. Please\nconsult products from your local weather office.\n\nTORNADOES:  Tornadoes are possible today and tonight near the middle\nand upper Texas coast into far southwest Louisiana.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 700 AM CDT.\nNext complete advisory at 1000 AM CDT.\n\n$$\nForecaster Berg\n\nNNNN",
    "messageBinNumber": "4",
    "messageDateTimeLocal": "20170826 04:00:00 AM CDT",
    "messageDateTimeLocalStr": "0400 AM CDT Sat Aug 26",
    "messageDateTimeUTC": "20170826 09:00:00 AM UTC",
    "messageDateTimeUTC24": "201708260900",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "NW OR 325 DEGREES",
    "systemGeoRefPt1": "ABOUT 30 MI...50 KM SW OF VICTORIA TEXAS",
    "systemGeoRefPt2": "ABOUT 105 MI...170 KM SE OF SAN ANTONIO TEXAS",
    "systemIntensityKph": "155",
    "systemIntensityKts": "85",
    "systemIntensityMph": "100",
    "systemMslpInHg": "28.44",
    "systemMslpMb": "963",
    "systemName": "HARVEY",
    "systemSaffirSimpsonCategory": "CATEGORY 2",
    "systemSpeedKph": "9",
    "systemSpeedKts": "5",
    "systemSpeedMph": "6",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1503738000"
  }
}
