{
  "cycloneMessage": {
    "advisoryNumber": "20A",
    "atcfID": "AL092017",
    "centerLocLatitude": "26.3",
    "centerLocLatitudeExpanded": "26.3N",
    "centerLocLongitude": "-95.8",
    "centerLocLongitudeExpanded": "95.8W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT4 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Harvey Intermediate Advisory Number 20A\nNWS National Hurricane Center Miami FL       AL092017\n700 AM CDT Fri Aug 25 2017\n\n...PREPARATIONS ALONG THE MIDDLE TEXAS COAST SHOULD BE RUSHED TO\nCOMPLETION THIS MORNING...\n...CONDITIONS EXPECTED TO DETERIORATE THROUGH THE DAY...\n\n\nSUMMARY OF 700 AM CDT...1200 UTC...INFORMATION\n----------------------------------------------\nLOCATION...26.3N 95.8W\nABOUT 140 MI...225 KM SE OF CORPUS CHRISTI TEXAS\nABOUT 145 MI...235 KM SSE OF PORT OCONNOR TEXAS\nMAXIMUM SUSTAINED WINDS...110 MPH...175 KM/H\nPRESENT MOVEMENT...NW OR 315 DEGREES AT 10 MPH...17 KM/H\nMINIMUM CENTRAL PRESSURE...950 MB...28.05 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Warning is in effect for...\n* Port Mansfield to High Island Texas\n\nA Storm Surge Watch is in effect for...\n* South of Port Mansfield Texas to the Mouth of the Rio Grande\n\nA Hurricane Warning is in effect for...\n* Port Mansfield to Sargent Texas\n\nA Tropical Storm Warning is in effect for...\n* North of Sargent to High Island Texas\n* South of Port Mansfield Texas to the Mouth of the Rio Grande\n\nA Hurricane Watch is in effect for...\n* South of Port Mansfield Texas to the Mouth of the Rio Grande\n\nA Tropical Storm Watch is in effect for...\n* South of the Mouth of the Rio Grande to Boca de Catan Mexico\n\nA Storm Surge Warning means there is a danger of life-threatening\ninundation from rising water moving inland from the coastline in the\nindicated locations. For a depiction of areas at risk, please see\nthe National Weather Service Storm Surge Watch/Warning Graphic,\navailable at hurricanes.gov.  This is a life-threatening situation.\nPersons located within these areas should take all necessary actions\nto protect life and property from rising water and the potential for\nother dangerous conditions.  Promptly follow evacuation and other\ninstructions from local officials.\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area, in this case within the next 12\nto 24 hours. Preparations to protect life and property should be\nrushed to completion.\n\nA Storm Surge Watch means there is a possibility of life-\nthreatening inundation, from rising water moving inland from the\ncoastline, in the indicated locations during the next 48 hours.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.\n\nIn addition, interests in southwestern Louisiana should continue to\nmonitor the progress of this system.\n\nFor storm information specific to your area in the United States,\nincluding possible inland watches and warnings, please monitor\nproducts issued by your local National Weather Service forecast\noffice. For storm information specific to your area outside the\nUnited States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 700 AM CDT (1200 UTC), the eye of Hurricane Harvey was located\nby Air Force Reserve reconnaissance aircraft and NOAA Doppler radar\nnear latitude 26.3 North, longitude 95.8 West. Harvey is moving\ntoward the northwest near 10 mph (17 km/h), but its forward speed\nis expected to decrease significantly during the next couple of\ndays.  On the forecast track, Harvey will make landfall on the\nmiddle Texas coast tonight or early Saturday.  Harvey is then likely\nto meander near or just inland of the middle Texas coast through the\nweekend.\n\nMaximum sustained winds are near 110 mph (175 km/h) with higher\ngusts.  Some strengthening is possible, and Harvey is expected to\nbecome a major hurricane before it reaches the middle Texas coast.\n\nHurricane-force winds extend outward up to 35 miles (55 km) from\nthe center, and tropical-storm-force winds extend outward up to 140\nmiles (220 km).\n\nThe minimum central pressure reported by the Air Force plane was 950\nmb (28.05 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Harvey is expected to produce total rain accumulations\nof 15 to 25 inches and isolated maximum amounts of 35 inches over\nthe middle and upper Texas coast through next Wednesday.  During\nthe same time period Harvey is expected to produce total rain\naccumulations of 7 to 15 inches in far south Texas and the Texas\nHill Country eastward through central and southwest Louisiana, with\naccumulations of up to 7 inches extending into other parts of Texas\nand the lower Mississippi Valley. Rainfall from Harvey will cause\ndevastating and life-threatening flooding.\n\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following heights above ground if the peak\nsurge occurs at the time of high tide...\n\nN Entrance Padre Island Natl Seashore to Sargent...6 to 12 ft\nSargent to Jamaica Beach...5 to 8 ft\nPort Mansfield to N Entrance Padre Island Natl Seashore...5 to 7 ft\nJamaica Beach to High Island...2 to 4 ft\nMouth of the Rio Grande to Port Mansfield...2 to 4 ft\nHigh Island to Morgan City...1 to 3 ft\n\nThe deepest water will occur along the immediate coast near and to\nthe northeast of the landfall location, where the surge will be\naccompanied by large and destructive waves.  Surge-related flooding\ndepends on the relative timing of the surge and the tidal cycle, and\ncan vary greatly over short distances.  For information specific to\nyour area, please see products issued by your local National Weather\nService forecast office.\n\nWIND:  Hurricane conditions are likely within the hurricane warning\narea later today and tonight, with tropical storm conditions\nexpected to first reach the coast in the hurricane warning area\nlater this morning.  These conditions are likely to persist\ninto Saturday in portions of the hurricane and tropical storm\nwarning area.\n\nSURF:  Swells generated by Harvey will begin to affect the Texas,\nLouisiana, and northeast Mexico coasts later this morning. These\nswells are likely to cause life-threatening surf and rip current\nconditions. Please consult products from your local weather\noffice.\n\nTORNADOES: Isolated tornadoes are possible across portions of the\nmiddle and upper Texas coast today.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 1000 AM CDT.\n\n$$\nForecaster Berg\n\nNNNN",
    "messageBinNumber": "4",
    "messageDateTimeLocal": "20170825 07:00:00 AM CDT",
    "messageDateTimeLocalStr": "0700 AM CDT Fri Aug 25",
    "messageDateTimeUTC": "20170825 12:00:00 PM UTC",
    "messageDateTimeUTC24": "201708251200",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "NW OR 315 DEGREES",
    "systemGeoRefPt1": "ABOUT 140 MI...225 KM SE OF CORPUS CHRISTI TEXAS",
    "systemGeoRefPt2": "ABOUT 145 MI...235 KM SSE OF PORT OCONNOR TEXAS",
    "systemIntensityKph": "175",
    "systemIntensityKts": "95",
    "systemIntensityMph": "110",
    "systemMslpInHg": "28.05",
    "systemMslpMb": "950",
    "systemName": "HARVEY",
    "systemSaffirSimpsonCategory": "CATEGORY 2",
    "systemSpeedKph": "17",
    "systemSpeedKts": "9",
    "systemSpeedMph": "10",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1503662400"
  }
}
