{
  "cycloneMessage": {
    "advisoryNumber": "25A",
    "atcfID": "AL092017",
    "centerLocLatitude": "29.1",
    "centerLocLatitudeExpanded": "29.1N",
    "centerLocLongitude": "-97.6",
    "centerLocLongitudeExpanded": "97.6W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT4 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Harvey Intermediate Advisory Number 25A\nNWS National Hurricane Center Miami FL       AL092017\n100 PM CDT Sat Aug 26 2017\n\n...HARVEY BECOMES A TROPICAL STORM INLAND OVER TEXAS...\n...EXTREMELY SERIOUS FLOODING EVENT UNFOLDING...\n\n\nSUMMARY OF 100 PM CDT...1800 UTC...INFORMATION\n----------------------------------------------\nLOCATION...29.1N 97.6W\nABOUT 45 MI...70 KM WNW OF VICTORIA TEXAS\nABOUT 60 MI...95 KM ESE OF SAN ANTONIO TEXAS\nMAXIMUM SUSTAINED WINDS...70 MPH...110 KM/H\nPRESENT MOVEMENT...NNW OR 340 DEGREES AT 2 MPH...4 KM/H\nMINIMUM CENTRAL PRESSURE...987 MB...29.15 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Warning is in effect for...\n* Port Aransas to High Island Texas\n\nA Tropical Storm Warning is in effect for...\n* Baffin Bay to High Island Texas\n\nA Storm Surge Warning means there is a danger of life-threatening\ninundation from rising water moving inland from the coastline in the\nindicated locations. For a depiction of areas at risk, please see\nthe National Weather Service Storm Surge Watch/Warning Graphic,\navailable at hurricanes.gov. This is a life-threatening situation.\n\nFor storm information specific to your area, including possible\ninland watches and warnings, please monitor products issued by your\nlocal National Weather Service forecast office.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 100 PM CDT (1800 UTC), the center of Tropical Storm Harvey was\nlocated by National Weather Service Doppler radar near latitude 29.1\nNorth, longitude 97.6 West. Harvey is moving slowly toward the\nnorth-northwest near 2 mph (4 km/h), and little motion is\nanticipated during the next several days.\n\nMaximum sustained winds have decreased to near 70 mph (110 km/h)\nwith higher gusts. Additional weakening is forecast during the next\n48 hours.\n\nTropical-storm-force winds extend outward up to 140 miles (220 km).\n\nThe estimated minimum central pressure is 987 mb (29.15 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Harvey is expected to produce total rain accumulations of\n15 to 30 inches and isolated maximum amounts of 40 inches over the\nmiddle and upper Texas coast through Thursday. During the same\ntime period Harvey is expected to produce total rain accumulations\nof 5 to 15 inches in far south Texas, the Texas Hill Country\nand southwest and central Louisiana. Rainfall of this magnitude\nwill cause catastrophic and life-threatening flooding.  A list of\nrainfall observations compiled by the NOAA Weather Prediction Center\ncan be found at: www.wpc.ncep.noaa.gov/discussions/nfdscc1.html\n\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following heights above ground if the peak\nsurge occurs at the time of high tide...\n\nPort Aransas to Sargent...4 to 7 ft\nSargent to High Island including Galveston Bay...2 to 4 ft\nHigh Island to Morgan City...1 to 3 ft\n\nThe deepest water will occur along the immediate coast near the\narea of onshore winds, where the surge will be accompanied by large\nand destructive waves.  Surge-related flooding depends on the\nrelative timing of the surge and the tidal cycle, and can vary\ngreatly over short distances.  For information specific to your\narea, please see products issued by your local National Weather\nService forecast office.\n\nWIND:   Tropical storm conditions are occurring in portions of\nthe tropical storm warning area, and are likely to persist along\nportions of the coast through at least Sunday.\n\nSURF:  Swells generated by Harvey are affecting the Texas,\nLouisiana, and northeast Mexico coasts.  These swells are likely to\ncause life-threatening surf and rip current conditions. Please\nconsult products from your local weather office.\n\nTORNADOES:  Tornadoes are possible today and tonight near the middle\nand upper Texas coast into far southwest Louisiana.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 400 PM CDT.\n\n$$\nForecaster Avila\n\nNNNN",
    "messageBinNumber": "4",
    "messageDateTimeLocal": "20170826 01:00:00 PM CDT",
    "messageDateTimeLocalStr": "0100 PM CDT Sat Aug 26",
    "messageDateTimeUTC": "20170826 06:00:00 PM UTC",
    "messageDateTimeUTC24": "201708261800",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "NNW OR 340 DEGREES",
    "systemGeoRefPt1": "ABOUT 45 MI...70 KM WNW OF VICTORIA TEXAS",
    "systemGeoRefPt2": "ABOUT 60 MI...95 KM ESE OF SAN ANTONIO TEXAS",
    "systemIntensityKph": "110",
    "systemIntensityKts": "60",
    "systemIntensityMph": "70",
    "systemMslpInHg": "29.15",
    "systemMslpMb": "987",
    "systemName": "HARVEY",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "4",
    "systemSpeedKts": "2",
    "systemSpeedMph": "2",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1503770400"
  }
}
