{
  "cycloneMessage": {
    "advisoryNumber": "37A",
    "atcfID": "AL092017",
    "centerLocLatitude": "28.8",
    "centerLocLatitudeExpanded": "28.8N",
    "centerLocLongitude": "-94.3",
    "centerLocLongitudeExpanded": "94.3W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT4 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Harvey Intermediate Advisory Number 37A\nNWS National Hurricane Center Miami FL       AL092017\n100 PM CDT Tue Aug 29 2017\n\n...HARVEY CONTINUES TO DUMP CATASTROPHIC RAINS OVER\nSOUTHEASTERN TEXAS AND SOUTHWESTERN LOUISIANA...\n\n\nSUMMARY OF 100 PM CDT...1800 UTC...INFORMATION\n----------------------------------------------\nLOCATION...28.8N 94.3W\nABOUT  80 MI...130 KM SSW OF PORT ARTHUR TEXAS\nABOUT  95 MI...155 KM  SW OF CAMERON LOUISIANA\nMAXIMUM SUSTAINED WINDS...45 MPH...75 KM/H\nPRESENT MOVEMENT...NNE OR 20 DEGREES AT 8 MPH...13 KM/H\nMINIMUM CENTRAL PRESSURE...997 MB...29.44 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Tropical Storm Warning is in effect for...\n* North of Port O'Connor to Morgan City Louisiana\n\nA Tropical Storm Watch is in effect for...\n* East of Morgan City to Grand Isle\n\nA Storm Surge Watch is in effect for...\n* Port Bolivar to Morgan City\n\nCatastrophic and life-threatening flooding continues in southeastern\nTexas and portions of southwestern Louisiana.  Please see warnings\nand other products issued by your local National Weather Service\noffice for additional information on this life-threatening\nsituation.\n\nA Storm Surge Watch means there is a possibility of life-\nthreatening inundation, from rising water moving inland from the\ncoastline, in the indicated locations during the next 48 hours.\nFor a depiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.\n\nFor storm information specific to your area, including possible\ninland watches and warnings, please monitor products issued by your\nlocal National Weather Service forecast office.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 100 PM CDT (1800 UTC), the center of Tropical Storm Harvey was\nlocated near latitude 28.8 North, longitude 94.3 West. Harvey is\nmoving a little faster toward the north-northeast near 8 mph (13\nkm/h), and this general motion is expected to continue today and\ntomorrow. On the forecast track, the center of Harvey is expected to\nmove inland over the northwestern Gulf within the tropical storm\nwarning area later tonight or early Wednesday.\n\nMaximum sustained winds remain near 45 mph (75 km/h) with higher\ngusts. An Air Force plane is currently approaching the center of\nHarvey.\n\nNo significant change in strength is expected before the center\nmoves inland. A gradual weakening should begin thereafter.\n\nTropical-storm-force winds extend outward up to 160 miles (260 km)\nmainly to the east of the center.\n\nThe estimated minimum central pressure is 997 mb (29.44 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Harvey is expected to produce additional rainfall\naccumulations of 6 to 12 inches through Friday over parts of the\nupper Texas coast into southwestern Louisiana.  Isolated storm\ntotals may reach 50 inches over the upper Texas coast, including the\nHouston/Galveston metropolitan area.  These rains are currently\nproducing catastrophic and life-threatening flooding over large\nportions of southeastern Texas and southwestern Louisiana.  DO NOT\nATTEMPT TO TRAVEL IN THE AFFECTED AREA IF YOU ARE IN A SAFE PLACE.\nDO NOT DRIVE INTO FLOODED ROADWAYS.  Please see warnings and\nproducts issued by your local National Weather Service office for\nadditional information on this life-threatening situation.\n\nElsewhere, Harvey is expected to produce additional rainfall amounts\nof 5 to 10 inches across portions of southern Louisiana into coastal\nMississippi and Alabama. Rainfall associated with Harvey will spread\nnorth by mid to late week, with rainfall amounts of 4 to 8 inches\nspreading into portions of Arkansas and the Tennessee Valley.\n\nA preliminary report from one Texas rain gauge has broken the Texas\ntropical cyclone rainfall record. Southeast of Houston, Mary's Creek\nat Winding Road reported 49.32 inches as of 9 am CDT. This total is\nhigher than the previous record of 48 inches set during tropical\ncyclone Amelia of 1978 at Medina, Texas.\n\nA list of rainfall observations compiled by the NOAA Weather\nPrediction Center can be found at:\nwww.wpc.ncep.noaa.gov/discussions/nfdscc1.html\n\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following heights above ground if the peak\nsurge occurs at the time of high tide...\n\nSan Luis Pass to Morgan City including Galveston Bay...1 to 3 ft\n\nThe deepest water will occur along the immediate coast near the\narea of onshore winds.  Surge-related flooding depends on the\nrelative timing of the surge and the tidal cycle, and can vary\ngreatly over short distances.  For information specific to your\narea, please see products issued by your local National Weather\nService forecast office.\n\nWIND:  Tropical storm conditions are occurring over portions of\nthe warning area along the coast and are likely to persist\nduring the next day or so. Tropical storms conditions are\npossible within the watch area within the next 24 hours.\n\nSURF:  Swells generated by Harvey are still affecting the coasts of\nTexas and Louisiana.  These swells are likely to cause\nlife-threatening surf and rip current conditions. Please consult\nproducts from your local weather office.\n\nTORNADOES:  A few tornadoes are possible today from extreme\nsoutheast Texas across parts of southern Louisiana, coastal\nMississippi and coastal Alabama.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 400 PM CDT.\n\n$$\nForecaster Avila\n\nNNNN",
    "messageBinNumber": "4",
    "messageDateTimeLocal": "20170829 01:00:00 PM CDT",
    "messageDateTimeLocalStr": "0100 PM CDT Tue Aug 29",
    "messageDateTimeUTC": "20170829 06:00:00 PM UTC",
    "messageDateTimeUTC24": "201708291800",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "NNE OR 20 DEGREES",
    "systemGeoRefPt1": "ABOUT  80 MI...130 KM SSW OF PORT ARTHUR TEXAS",
    "systemGeoRefPt2": "ABOUT  95 MI...155 KM  SW OF CAMERON LOUISIANA",
    "systemIntensityKph": "75",
    "systemIntensityKts": "40",
    "systemIntensityMph": "45",
    "systemMslpInHg": "29.44",
    "systemMslpMb": "997",
    "systemName": "HARVEY",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "13",
    "systemSpeedKts": "7",
    "systemSpeedMph": "8",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1504029600"
  }
}
