{
  "cycloneMessage": {
    "advisoryNumber": "27A",
    "atcfID": "AL092017",
    "centerLocLatitude": "29.3",
    "centerLocLatitudeExpanded": "29.3N",
    "centerLocLongitude": "-97.4",
    "centerLocLongitudeExpanded": "97.4W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT4 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Harvey Intermediate Advisory Number 27A\nNWS National Hurricane Center Miami FL       AL092017\n100 AM CDT Sun Aug 27 2017\n\n...HARVEY SLOWLY WEAKENING AS IT MOVES LITTLE...\n...CONTINUES TO PRODUCE EXTREMELY HEAVY RAINS...\n\n\nSUMMARY OF 100 AM CDT...0600 UTC...INFORMATION\n----------------------------------------------\nLOCATION...29.3N 97.4W\nABOUT 45 MI...75 KM NW OF VICTORIA TEXAS\nABOUT 70 MI...110 KM ESE OF SAN ANTONIO TEXAS\nMAXIMUM SUSTAINED WINDS...45 MPH...75 KM/H\nPRESENT MOVEMENT...STATIONARY\nMINIMUM CENTRAL PRESSURE...998 MB...29.47 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Warning is in effect for...\n* Port Aransas to Sargent Texas\n\nA Tropical Storm Warning is in effect for...\n* Baffin Bay to Sargent Texas\n\nA Storm Surge Warning means there is a danger of life-threatening\ninundation from rising water moving inland from the coastline in the\nindicated locations. For a depiction of areas at risk, please see\nthe National Weather Service Storm Surge Watch/Warning Graphic,\navailable at hurricanes.gov. This is a life-threatening situation.\n\nFor storm information specific to your area, including possible\ninland watches and warnings, please monitor products issued by your\nlocal National Weather Service forecast office.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 100 AM CDT (0600 UTC), the center of Tropical Storm Harvey was\nlocated near latitude 29.3 North, longitude 97.4 West.  Harvey is\nnearly stationary.  A drift toward the south or southeast is\nexpected during the next couple of days.  On the forecast track,\nthe center of Harvey is expected to remain inland over southeastern\nTexas through Monday.\n\nMaximum sustained winds have decreased to near 45 mph (75 km/h)\nwith higher gusts.  Additional weakening is forecast during the next\n48 hours, and Harvey is likely to weaken to a tropical depression\nlater today.\n\nTropical-storm-force winds extend outward up to 115 miles (185 km)\nfrom the center.  During the past couple of hours, the airport at\nAustin, Texas has reported sustained winds of 38 mph (61 km/h)\nand a gust of 49 mph (80 km/h).\n\nThe estimated minimum central pressure is 998 mb (29.47 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Harvey is expected to produce additional rain\naccumulations of 15 to 25 inches over the middle and upper Texas\ncoast through Thursday. Isolated storm totals may reach around\n40 inches in this area. Rainfall of this magnitude will cause\ncatastrophic and life-threatening flooding.  Elsewhere during the\nsame time period, Harvey is expected to produce total rain\naccumulations of 5 to 15 inches farther south toward the lower Texas\ncoast, farther west toward the the Texas Hill Country, and farther\neast through southwest and central Louisiana. A list of rainfall\nobservations compiled by the NOAA Weather Prediction Center can be\nfound at: www.wpc.ncep.noaa.gov/discussions/nfdscc1.html\n\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following heights above ground if the peak\nsurge occurs at the time of high tide...\n\nPort Aransas to Sargent...3 to 6 ft\nSargent to High Island including Galveston Bay...1 to 3 ft\nHigh Island to Morgan City...1 to 2 ft\n\nThe deepest water will occur along the immediate coast near the\narea of onshore winds, where the surge will be accompanied by large\nand destructive waves.  Surge-related flooding depends on the\nrelative timing of the surge and the tidal cycle, and can vary\ngreatly over short distances.  For information specific to your\narea, please see products issued by your local National Weather\nService forecast office.\n\nWIND:   Tropical storm conditions are occurring in an area near the\ncenter and over portions of the tropical storm warning area along\nthe coast.  These conditions are likely to persist through this\nmorning.\n\nSURF:  Swells generated by Harvey affecting the coasts of Texas\nand Louisiana should subside through this morning.  These swells\nare likely to cause life-threatening surf and rip current\nconditions. Please consult products from your local weather office.\n\nTORNADOES:  A few tornadoes are possible through Monday near the\nmiddle and upper Texas coast into far southwest Louisiana.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 400 AM CDT.\n\n$$\nForecaster Pasch\n\nNNNN",
    "messageBinNumber": "4",
    "messageDateTimeLocal": "20170827 01:00:00 AM CDT",
    "messageDateTimeLocalStr": "0100 AM CDT Sun Aug 27",
    "messageDateTimeUTC": "20170827 06:00:00 AM UTC",
    "messageDateTimeUTC24": "201708270600",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "STATIONARY",
    "systemGeoRefPt1": "ABOUT 45 MI...75 KM NW OF VICTORIA TEXAS",
    "systemGeoRefPt2": "ABOUT 70 MI...110 KM ESE OF SAN ANTONIO TEXAS",
    "systemIntensityKph": "75",
    "systemIntensityKts": "40",
    "systemIntensityMph": "45",
    "systemMslpInHg": "29.47",
    "systemMslpMb": "998",
    "systemName": "HARVEY",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "0",
    "systemSpeedKts": "0",
    "systemSpeedMph": "0",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1503813600"
  }
}
