{
  "cycloneMessage": {
    "advisoryNumber": "34",
    "atcfID": "AL092017",
    "centerLocLatitude": "28.5",
    "centerLocLatitudeExpanded": "28.5N",
    "centerLocLongitude": "-95.7",
    "centerLocLongitudeExpanded": "95.7W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT4 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Harvey Advisory Number  34\nNWS National Hurricane Center Miami FL       AL092017\n400 PM CDT Mon Aug 28 2017\n\n...SURFACE OBSERVATIONS SHOW THAT HARVEY HAS 45 MPH WINDS...\n...LIFE-THREATENING FLOODING CONTINUES OVER SOUTHEASTERN TEXAS...\n...DO NOT ATTEMPT TO TRAVEL IN THE AFFECTED AREAS IF YOU ARE IN\nA SAFE PLACE AND DO NOT DRIVE INTO FLOODED ROADWAYS...\n\n\nSUMMARY OF 400 PM CDT...2100 UTC...INFORMATION\n----------------------------------------------\nLOCATION...28.5N 95.7W\nABOUT 45 MI...70 KM E OF PORT OCONNOR TEXAS\nABOUT 145 MI...235 KM SW OF PORT ARTHUR TEXAS\nMAXIMUM SUSTAINED WINDS...45 MPH...75 KM/H\nPRESENT MOVEMENT...ESE OR 110 DEGREES AT 3 MPH...6 KM/H\nMINIMUM CENTRAL PRESSURE...997 MB...29.44 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe Tropical Storm Warning has been extended east of Cameron,\nLouisiana, to Intracoastal City, Louisiana.\n\nA Storm Surge Watch has been issued from Port Bolivar, Texas, to\nMorgan City, Louisiana.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Tropical Storm Warning is in effect for...\n* Mesquite Bay to Intracoastal City\n\nA Storm Surge Watch is in effect for...\n* Port Bolivar to Morgan City\n\nCatastrophic and life-threatening flooding continues in southeastern\nTexas.  Please see warnings and other products issued by your\nlocal National Weather Service office for additional information on\nthis life-threatening situation.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area within 36 hours.\n\nA Storm Surge Watch means there is a possibility of life-\nthreatening inundation, from rising water moving inland from the\ncoastline, in the indicated locations during the next 48 hours.\nFor a depiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.\n\nInterests elsewhere along the middle and upper Texas coast and in\nsouthern Louisiana should continue to monitor the progress of\nHarvey.\n\nFor storm information specific to your area, including possible\ninland watches and warnings, please monitor products issued by your\nlocal National Weather Service forecast office.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 400 PM CDT (2100 UTC), the center of Tropical Storm Harvey was\nlocated near latitude 28.5 North, longitude 95.7 West. Harvey is\nmoving toward the east-southeast near 3 mph (6 km/h), and a slow\nmotion toward the southeast is expected through tonight.  A gradual\nturn toward the northeast and a continued slow forward speed are\nexpected Tuesday and Tuesday night.  On the forecast track, the\ncenter of Harvey is expected to be just offshore of the middle and\nupper coasts of Texas through Tuesday night, then move inland over\nthe northwestern Gulf coast on Wednesday.\n\nMaximum sustained winds are near 45 mph (75 km/h) with higher gusts.\nLittle change in strength is forecast during the next 48 hours.\n\nTropical-storm-force winds extend outward up to 175 miles (280 km)\nfrom the center.  The National Ocean Service automated station at\nthe Matagorda Bay entrance recently reported sustained winds of\n46 mph (74 km/h) and a wind gust of 57 mph (92 km/h).\n\nThe minimum central pressure estimated from surface observations\nalong the Texas coast is 997 mb (29.44 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Harvey is expected to produce additional rainfall\naccumulations of 10 to 20 inches through Thursday over parts of the\nupper Texas coast into southwestern Louisiana.  Isolated storm\ntotals may reach 50 inches over the upper Texas coast, including the\nHouston/Galveston metropolitan area.  These rains are currently\nproducing catastrophic and life-threatening flooding over large\nportions of southeastern Texas.  DO NOT ATTEMPT TO TRAVEL IN THE\nAFFECTED AREA IF YOU ARE IN A SAFE PLACE.  DO NOT DRIVE INTO FLOODED\nROADWAYS.  Please see warnings and products issued by your local\nNational Weather Service office for additional information on this\nlife-threatening situation.\n\nElsewhere, Harvey is expected to produce total rain accumulations of\n5 to 15 inches farther south into the middle Texas coast and farther\neast across south-central Louisiana.  Rainfall amounts of 5 to 10\ninches are expected in southeast Louisiana.\n\nA list of rainfall observations compiled by the NOAA Weather\nPrediction Center can be found at:\nwww.wpc.ncep.noaa.gov/discussions/nfdscc1.html\n\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following heights above ground if the peak\nsurge occurs at the time of high tide...\n\nPort Aransas to Morgan City including Galveston Bay...1 to 3 ft\n\nThe deepest water will occur along the immediate coast near the\narea of onshore winds.  Surge-related flooding depends on the\nrelative timing of the surge and the tidal cycle, and can vary\ngreatly over short distances.  For information specific to your\narea, please see products issued by your local National Weather\nService forecast office.\n\nWIND:  Tropical storm conditions are occurring in rain bands well to\nthe east of the center of Harvey, and along the coast to the\nsouthwest of the center.  Tropical storm conditions are likely to\npersist within the warning area during the next couple of days.\n\nSURF:  Swells generated by Harvey are affecting the coasts of Texas\nand Louisiana.  These swells are likely to cause life-threatening\nsurf and rip current conditions. Please consult products from your\nlocal weather office.\n\nTORNADOES:  A few tornadoes are possible through Tuesday across\nsouthern Louisiana and extreme southeast Texas.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 700 PM CDT.\nNext complete advisory at 1000 PM CDT.\n\n$$\nForecaster Beven\n\nNNNN",
    "messageBinNumber": "4",
    "messageDateTimeLocal": "20170828 04:00:00 PM CDT",
    "messageDateTimeLocalStr": "0400 PM CDT Mon Aug 28",
    "messageDateTimeUTC": "20170828 09:00:00 PM UTC",
    "messageDateTimeUTC24": "201708282100",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "ESE OR 110 DEGREES",
    "systemGeoRefPt1": "ABOUT 45 MI...70 KM E OF PORT OCONNOR TEXAS",
    "systemGeoRefPt2": "ABOUT 145 MI...235 KM SW OF PORT ARTHUR TEXAS",
    "systemIntensityKph": "75",
    "systemIntensityKts": "40",
    "systemIntensityMph": "45",
    "systemMslpInHg": "29.44",
    "systemMslpMb": "997",
    "systemName": "HARVEY",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "6",
    "systemSpeedKts": "3",
    "systemSpeedMph": "3",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1503954000"
  }
}
