{
  "cycloneMessage": {
    "advisoryNumber": "38",
    "atcfID": "AL092017",
    "centerLocLatitude": "29.2",
    "centerLocLatitudeExpanded": "29.2N",
    "centerLocLongitude": "-94.3",
    "centerLocLongitudeExpanded": "94.3W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT4 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Harvey Advisory Number  38\nNWS National Hurricane Center Miami FL       AL092017\n400 PM CDT Tue Aug 29 2017\n\n...HARVEY CRAWLING TOWARD THE COAST DUMPING CATASTROPHIC RAINS OVER\nSOUTHEASTERN TEXAS AND SOUTHWESTERN LOUISIANA...\n\n\nSUMMARY OF 400 PM CDT...2100 UTC...INFORMATION\n----------------------------------------------\nLOCATION...29.2N 94.3W\nABOUT 55 MI...85 KM SSW OF PORT ARTHUR TEXAS\nABOUT 75 MI...115 KM SW OF CAMERON LOUISIANA\nMAXIMUM SUSTAINED WINDS...50 MPH...85 KM/H\nPRESENT MOVEMENT...NNE OR 30 DEGREES AT 6 MPH...9 KM/H\nMINIMUM CENTRAL PRESSURE...994 MB...29.36 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nA Storm Surge Warning has been issued from Holly Beach to Morgan\nCity Louisiana.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Warning is in effect for...\n* Holly Beach to Morgan City\n\nA Storm Surge Watch is in effect for...\n* Port Bolivar to west of Holly Beach\n\nA Tropical Storm Warning is in effect for...\n* North of Port O'Connor to Morgan City Louisiana\n\nA Tropical Storm Watch is in effect for...\n* East of Morgan City to Grand Isle\n\nCatastrophic and life-threatening flooding continues in southeastern\nTexas and portions of southwestern Louisiana.  Please see warnings\nand other products issued by your local National Weather Service\noffice for additional information on this life-threatening\nsituation.\n\nA Storm Surge Warning means there is a danger of life-threatening\ninundation, from rising water moving inland from the coastline,\nduring the next 12 to 24 hours in the indicated locations.  For a\ndepiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.  This is a life-threatening situation.  Persons\nlocated within these areas should take all necessary actions to\nprotect life and property from rising water and the potential for\nother dangerous conditions.  Promptly follow evacuation and other\ninstructions from local officials.\n\nFor storm information specific to your area, including possible\ninland watches and warnings, please monitor products issued by your\nlocal National Weather Service forecast office.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 400 PM CDT (2100 UTC), the center of Tropical Storm Harvey was\nestimated from data from an Air Force reconnaissance plane near\nlatitude 29.2 North, longitude 94.3 West.  Harvey is moving toward\nthe north-northeast near 6 mph (9 km/h), and this general motion is\nexpected to continue tonight and tomorrow. On the forecast track,\nthe broad circulation center of Harvey is expected to move inland\nover the northwestern Gulf Coast within the tropical storm warning\narea by early Wednesday.\n\nMaximum sustained winds are near 50 mph (85 km/h) with higher gusts.\nNo significant change in strength is anticipated before the center\ncrosses the coast, but gradual weakening should begin thereafter.\n\nTropical-storm-force winds extend outward up to 160 miles (260 km)\nfrom the center.  Galveston recently reported a sustained wind of\n39 mph and a gust to 54 mph.\n\nThe minimum central pressure reported by an Air Force reconnaissance\nplane was 994 mb (29.36 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Harvey is expected to produce additional rainfall\naccumulations of 6 to 12 inches to the north and east of Houston\nfrom far east Texas into southwestern Louisiana.  Isolated storm\ntotals will reach 50 inches over the upper Texas coast, including\nthe Houston/Galveston metropolitan area.  These rains are currently\nproducing catastrophic and life-threatening flooding over large\nportions of southeastern Texas and southwestern Louisiana.  DO NOT\nATTEMPT TO TRAVEL IN THE AFFECTED AREA IF YOU ARE IN A SAFE PLACE.\nDO NOT DRIVE INTO FLOODED ROADWAYS.  Please see warnings and\nproducts issued by your local National Weather Service office for\nadditional information on this life-threatening situation.\n\nElsewhere, Harvey is expected to produce total rainfall amounts of 5\nto 10 inches across portions of southern Louisiana into coastal\nMississippi and Alabama. Rainfall associated with Harvey will spread\nnorth by mid to late week, with rainfall amounts of 4 to 8 inches\nspreading into portions of Arkansas and the Tennessee Valley.\n\nA preliminary report from a rain gauge has broken the Texas tropical\ncyclone rainfall record.  The Cedar Bayou gauge, east of Highlands,\nTexas, has reported 51.88 inches of rain as of 3 PM CDT.  This total\nis higher than the previous record of 48 inches set during tropical\ncyclone Amelia of 1978 at Medina, Texas.\n\nA list of rainfall observations compiled by the NOAA Weather\nPrediction Center can be found at:\nwww.wpc.ncep.noaa.gov/discussions/nfdscc1.html\n\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following heights above ground if the peak\nsurge occurs at the time of high tide...\n\nHolly Beach to Morgan City...2 to 4 ft\nSan Luis Pass to west of Holly Beach including Galveston Bay...1 to\n3 ft\n\nThe deepest water will occur along the immediate coast near the\narea of onshore winds. Surge-related flooding depends on the\nrelative timing of the surge and the tidal cycle, and can vary\ngreatly over short distances. For information specific to your\narea, please see products issued by your local National Weather\nService forecast office.\n\nWIND:  Tropical storm conditions are occurring over portions of\nthe warning area along the coast and are likely to persist\nduring the next day or so. Tropical storms conditions are\npossible within the watch area within the next 24 hours.\n\nSURF:  Swells generated by Harvey are still affecting the coasts of\nTexas and Louisiana.  These swells are likely to cause\nlife-threatening surf and rip current conditions. Please consult\nproducts from your local weather office.\n\nTORNADOES:  A few tornadoes are possible today from extreme\nsoutheast Texas across parts of southern Louisiana, coastal\nMississippi and coastal Alabama.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 700 PM CDT.\nNext complete advisory at 1000 PM CDT.\n\n$$\nForecaster Avila\n\nNNNN",
    "messageBinNumber": "4",
    "messageDateTimeLocal": "20170829 04:00:00 PM CDT",
    "messageDateTimeLocalStr": "0400 PM CDT Tue Aug 29",
    "messageDateTimeUTC": "20170829 09:00:00 PM UTC",
    "messageDateTimeUTC24": "201708292100",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "NNE OR 30 DEGREES",
    "systemGeoRefPt1": "ABOUT 55 MI...85 KM SSW OF PORT ARTHUR TEXAS",
    "systemGeoRefPt2": "ABOUT 75 MI...115 KM SW OF CAMERON LOUISIANA",
    "systemIntensityKph": "85",
    "systemIntensityKts": "45",
    "systemIntensityMph": "50",
    "systemMslpInHg": "29.36",
    "systemMslpMb": "994",
    "systemName": "HARVEY",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "9",
    "systemSpeedKts": "5",
    "systemSpeedMph": "6",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1504040400"
  }
}
