{
  "cycloneMessage": {
    "advisoryNumber": "21A",
    "atcfID": "AL092017",
    "centerLocLatitude": "27.1",
    "centerLocLatitudeExpanded": "27.1N",
    "centerLocLongitude": "-96.3",
    "centerLocLongitudeExpanded": "96.3W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT4 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Harvey Intermediate Advisory Number 21A\nNWS National Hurricane Center Miami FL       AL092017\n100 PM CDT Fri Aug 25 2017\n\n...WEATHER CONDITIONS DETERIORATING AND WATER LEVELS RISING ALONG\nTHE TEXAS COAST...\n\n\nSUMMARY OF 100 PM CDT...1800 UTC...INFORMATION\n----------------------------------------------\nLOCATION...27.1N 96.3W\nABOUT 85 MI...140 KM ESE OF CORPUS CHRISTI TEXAS\nABOUT 90 MI...145 KM S OF PORT OCONNOR TEXAS\nMAXIMUM SUSTAINED WINDS...110 MPH...175 KM/H\nPRESENT MOVEMENT...NW OR 325 DEGREES AT 10 MPH...17 KM/H\nMINIMUM CENTRAL PRESSURE...945 MB...27.91 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Warning is in effect for...\n* Port Mansfield to High Island Texas\n\nA Storm Surge Watch is in effect for...\n* South of Port Mansfield Texas to the Mouth of the Rio Grande\n\nA Hurricane Warning is in effect for...\n* Port Mansfield to Sargent Texas\n\nA Tropical Storm Warning is in effect for...\n* North of Sargent to High Island Texas\n* South of Port Mansfield Texas to the Mouth of the Rio Grande\n\nA Tropical Storm Watch is in effect for...\n* South of the Mouth of the Rio Grande to Boca de Catan Mexico\n\nA Storm Surge Warning means there is a danger of life-threatening\ninundation from rising water moving inland from the coastline in the\nindicated locations. For a depiction of areas at risk, please see\nthe National Weather Service Storm Surge Watch/Warning Graphic,\navailable at hurricanes.gov.  This is a life-threatening situation.\nPersons located within these areas should take all necessary actions\nto protect life and property from rising water and the potential for\nother dangerous conditions.  Promptly follow evacuation and other\ninstructions from local officials.\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area, in this case within the next 12\nto 24 hours. Preparations to protect life and property should be\nrushed to completion.\n\nA Storm Surge Watch means there is a possibility of life-\nthreatening inundation from rising water moving inland from the\ncoastline in the indicated locations.\n\nInterests in southwestern Louisiana should continue to monitor the\nprogress of this system.\n\nFor storm information specific to your area in the United States,\nincluding possible inland watches and warnings, please monitor\nproducts issued by your local National Weather Service forecast\noffice. For storm information specific to your area outside the\nUnited States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 100 PM CDT (1800 UTC), the eye of Hurricane Harvey was located by\na NOAA Hurricane Hunter aircraft and NOAA Doppler radar near\nlatitude 27.1 North, longitude 96.3 West. Harvey is moving toward\nthe northwest near 10 mph (17 km/h), but its forward speed is\nexpected to decrease significantly during the next couple of days.\nOn the forecast track, Harvey will make landfall on the middle Texas\ncoast tonight or early Saturday. Harvey is then likely to meander\nnear or just inland of the middle Texas coast through the weekend.\n\nMaximum sustained winds are near 110 mph (175 km/h) with higher\ngusts. Some strengthening is possible, and Harvey is forecast to\nbecome a major hurricane before it reaches the middle Texas coast.\n\nHurricane-force winds extend outward up to 35 miles (55 km) from\nthe center, and tropical-storm-force winds extend outward up to 140\nmiles (220 km).  A wind gust of 56 mph was recently reported at the\nCorpus Christi Naval Air Station.  In addition, a wind gust of 53\nmph was reported at Port Aransas, and a gust to 51 mph was measured\nat the Bob Hall Pier near Corpus Christi.  A sustained wind of 56\nmph and a gust to 69 mph were measured by NOAA buoy 42020.\n\nThe minimum central pressure based on data from the NOAA plane\nis 945 mb (27.91 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Harvey is expected to produce total rain accumulations\nof 15 to 25 inches and isolated maximum amounts of 35 inches over\nthe middle and upper Texas coast through next Wednesday.  During\nthe same time period Harvey is expected to produce total rain\naccumulations of 5 to 15 inches in far south Texas and the Texas\nHill Country over through southwest and central Louisiana.  Rainfall\nof this magnitude will cause catastrophic and life-threatening\nflooding.\n\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following heights above ground if the peak\nsurge occurs at the time of high tide...\n\nN Entrance Padre Island Natl Seashore to Sargent...6 to 12 ft\nSargent to Jamaica Beach...5 to 8 ft\nPort Mansfield to N Entrance Padre Island Natl Seashore...5 to 7 ft\nJamaica Beach to High Island...2 to 4 ft\nMouth of the Rio Grande to Port Mansfield...2 to 4 ft\nHigh Island to Morgan City...1 to 3 ft\n\nThe deepest water will occur along the immediate coast near and to\nthe northeast of the landfall location, where the surge will be\naccompanied by large and destructive waves.  Surge-related flooding\ndepends on the relative timing of the surge and the tidal cycle, and\ncan vary greatly over short distances.  For information specific to\nyour area, please see products issued by your local National Weather\nService forecast office.\n\nWIND:  All last-minute preparations should be rushed to completion\nsince tropical storm conditions are now occurring in portions of the\nhurricane and tropical storm warning areas.  Hurricane conditions\nare likely to begin within the hurricane warning area later today or\ntonight.  Tropical storm conditions are likely to persist along\nportions of the coast through at least Sunday.\n\nSURF:  Swells generated by Harvey are affecting the Texas,\nLouisiana, and northeast Mexico coasts.  These swells are likely to\ncause life-threatening surf and rip current conditions. Please\nconsult products from your local weather office.\n\nTORNADOES:  A few tornadoes are possible later today through\nSaturday near the middle and upper Texas coast.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 400 PM CDT.\n\n$$\nForecaster Berg\n\nNNNN",
    "messageBinNumber": "4",
    "messageDateTimeLocal": "20170825 01:00:00 PM CDT",
    "messageDateTimeLocalStr": "0100 PM CDT Fri Aug 25",
    "messageDateTimeUTC": "20170825 06:00:00 PM UTC",
    "messageDateTimeUTC24": "201708251800",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "NW OR 325 DEGREES",
    "systemGeoRefPt1": "ABOUT 85 MI...140 KM ESE OF CORPUS CHRISTI TEXAS",
    "systemGeoRefPt2": "ABOUT 90 MI...145 KM S OF PORT OCONNOR TEXAS",
    "systemIntensityKph": "175",
    "systemIntensityKts": "95",
    "systemIntensityMph": "110",
    "systemMslpInHg": "27.91",
    "systemMslpMb": "945",
    "systemName": "HARVEY",
    "systemSaffirSimpsonCategory": "CATEGORY 2",
    "systemSpeedKph": "17",
    "systemSpeedKts": "9",
    "systemSpeedMph": "10",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1503684000"
  }
}
