{
  "cycloneMessage": {
    "advisoryNumber": "25",
    "atcfID": "AL092017",
    "centerLocLatitude": "28.9",
    "centerLocLatitudeExpanded": "28.9N",
    "centerLocLongitude": "-97.3",
    "centerLocLongitudeExpanded": "97.3W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT4 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Harvey Advisory Number  25\nNWS National Hurricane Center Miami FL       AL092017\n1000 AM CDT Sat Aug 26 2017\n\n...HARVEY DRENCHING TEXAS...\n...TORRENTIAL RAINS WILL CONTINUE FOR A FEW MORE DAYS...\n\n\nSUMMARY OF 1000 AM CDT...1500 UTC...INFORMATION\n-----------------------------------------------\nLOCATION...28.9N 97.3W\nABOUT 25 MI...35 KM W OF VICTORIA TEXAS\nABOUT 80 MI...130 KM ESE OF SAN ANTONIO TEXAS\nMAXIMUM SUSTAINED WINDS...75 MPH...120 KM/H\nPRESENT MOVEMENT...N OR 350 DEGREES AT 2 MPH...4 KM/H\nMINIMUM CENTRAL PRESSURE...984 MB...29.06 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe Storm Surge Warning for the Texas coast south of Port Aransas\nhas been discontinued.\n\nThe Hurricane Warning for the Texas coast has been replaced with a\nTropical Storm Warning.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Warning is in effect for...\n* Port Aransas to High Island Texas\n\nA Tropical Storm Warning is in effect for...\n* Baffin Bay to High Island Texas\n\nHurricane warnings continue for inland areas near the center of\nHarvey. Please see products from your local National Weather\nService office.\n\nA Storm Surge Warning means there is a danger of life-threatening\ninundation from rising water moving inland from the coastline in the\nindicated locations. For a depiction of areas at risk, please see\nthe National Weather Service Storm Surge Watch/Warning Graphic,\navailable at hurricanes.gov. This is a life-threatening situation.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning.\n\nFor storm information specific to your area, including possible\ninland watches and warnings, please monitor products issued by your\nlocal National Weather Service forecast office.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 1000 AM CDT (1500 UTC), the center of Hurricane Harvey was\nlocated near latitude 28.9 North, longitude 97.3 West. Harvey is\nmoving slowly toward the north near 2 mph (4 km/h), and little\nmotion is anticipated during the next several days.\n\nMaximum sustained winds have decreased to near 75 mph (120 km/h)\nwith higher gusts. These winds are confined to a small area near the\ncenter. Weakening is forecast during the next 48 hours, and Harvey\nis expected to become a tropical storm this afternoon.\n\nHurricane-force winds extend outward up to 25 miles (35 km) from the\ncenter and tropical-storm-force winds extend outward up to 140 miles\n(220 km).\n\nThe estimated minimum central pressure is 984 mb (29.06 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Harvey is expected to produce total rain accumulations of\n15 to 30 inches and isolated maximum amounts of 40 inches over the\nmiddle and upper Texas coast through Thursday. During the same\ntime period Harvey is expected to produce total rain accumulations\nof 5 to 15 inches in far south Texas, the Texas Hill Country\nand southwest and central Louisiana. Rainfall of this magnitude\nwill cause catastrophic and life-threatening flooding.  A list of\nrainfall observations compiled by the NOAA Weather Prediction Center\ncan be found at: www.wpc.ncep.noaa.gov/discussions/nfdscc1.html\n\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following heights above ground if the peak\nsurge occurs at the time of high tide...\n\nPort Aransas to Sargent...4 to 7 ft\nSargent to High Island including Galveston Bay...2 to 4 ft\nHigh Island to Morgan City...1 to 3 ft\n\nThe deepest water will occur along the immediate coast near the\narea of onshore winds, where the surge will be accompanied by large\nand destructive waves.  Surge-related flooding depends on the\nrelative timing of the surge and the tidal cycle, and can vary\ngreatly over short distances.  For information specific to your\narea, please see products issued by your local National Weather\nService forecast office.\n\nWIND:  Hurricane conditions are occuring inland near the core\nof Harvey.  Tropical storm conditions are occurring in portions of\nthe tropical storm warning area, and are likely to persist along\nportions of the coast through at least Sunday.\n\nSURF:  Swells generated by Harvey are affecting the Texas,\nLouisiana, and northeast Mexico coasts.  These swells are likely to\ncause life-threatening surf and rip current conditions. Please\nconsult products from your local weather office.\n\nTORNADOES:  Tornadoes are possible today and tonight near the middle\nand upper Texas coast into far southwest Louisiana.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 100 PM CDT.\nNext complete advisory at 400 PM CDT.\n\n$$\nForecaster Avila/Lapenta\n\nNNNN",
    "messageBinNumber": "4",
    "messageDateTimeLocal": "20170826 10:00:00 AM CDT",
    "messageDateTimeLocalStr": "1000 AM CDT Sat Aug 26",
    "messageDateTimeUTC": "20170826 03:00:00 PM UTC",
    "messageDateTimeUTC24": "201708261500",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "N OR 350 DEGREES",
    "systemGeoRefPt1": "ABOUT 25 MI...35 KM W OF VICTORIA TEXAS",
    "systemGeoRefPt2": "ABOUT 80 MI...130 KM ESE OF SAN ANTONIO TEXAS",
    "systemIntensityKph": "120",
    "systemIntensityKts": "65",
    "systemIntensityMph": "75",
    "systemMslpInHg": "29.06",
    "systemMslpMb": "984",
    "systemName": "HARVEY",
    "systemSaffirSimpsonCategory": "CATEGORY 1",
    "systemSpeedKph": "4",
    "systemSpeedKts": "2",
    "systemSpeedMph": "2",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1503759600"
  }
}
