{
  "cycloneMessage": {
    "advisoryNumber": "42",
    "atcfID": "AL092017",
    "centerLocLatitude": "30.8",
    "centerLocLatitudeExpanded": "30.8N",
    "centerLocLongitude": "-93.1",
    "centerLocLongitudeExpanded": "93.1W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT4 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Harvey Advisory Number  42\nNWS National Hurricane Center Miami FL       AL092017\n400 PM CDT Wed Aug 30 2017\n\n...HARVEY STILL PRODUCING TROPICAL-STORM-FORCE WINDS NEAR THE\nLOUISIANA COAST...\n...FLOODING RAINS CONTINUING OVER EXTREME EASTERN TEXAS AND\nWESTERN LOUISIANA...\n\n\nSUMMARY OF 400 PM CDT...2100 UTC...INFORMATION\n----------------------------------------------\nLOCATION...30.8N 93.1W\nABOUT 50 MI...80 KM N OF LAKE CHARLES LOUISIANA\nABOUT 50 MI...80 KM SW OF ALEXANDRIA LOUISIANA\nMAXIMUM SUSTAINED WINDS...40 MPH...65 KM/H\nPRESENT MOVEMENT...NNE OR 20 DEGREES AT 8 MPH...13 KM/H\nMINIMUM CENTRAL PRESSURE...998 MB...29.47 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe Storm Surge Watch and Warning are discontinued for the coasts\nof Texas and Louisiana.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Tropical Storm Warning is in effect for...\n* Sabine Pass Texas to Grand Isle Louisiana\n\nCatastrophic and life-threatening flooding continues in southeastern\nTexas and portions of southwestern Louisiana.  Please see warnings\nand other products issued by your local National Weather Service\noffice for additional information on this life-threatening\nsituation.\n\nFor storm information specific to your area, including possible\ninland watches and warnings, please monitor products issued by your\nlocal National Weather Service forecast office.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 400 PM CDT (2100 UTC), the center of Tropical Storm Harvey was\nlocated near latitude 30.8 North, longitude 93.1 West. Harvey is\nmoving erratically toward the north-northeast near 8 mph (13 km/h)\nand this motion is expected to continue tonight.  A turn toward the\nnortheast is expected Thursday or Thursday night.  On the forecast\ntrack, the center of Harvey should move through southwestern and\ncentral Louisiana tonight, then move through northeastern Louisiana\nand northwestern Mississippi Thursday and Thursday night.\n\nMaximum sustained winds are near 40 mph (65 km/h) with higher gusts.\nWeakening is forecast during the next 48 hours as Harvey moves\nfarther inland, and the cyclone is expected to weaken to a tropical\ndepression tonight.\n\nTropical-storm-force winds extend outward up to 140 miles (220 km)\nmainly over water to the southeast of the center.  An automated\nstation near Lacassine, Louisiana recently reported a wind gust of\n44 mph (71 km/h).\n\nThe estimated minimum central pressure based on surface observations\nis 998 mb (29.47 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Harvey is expected to produce additional rainfall\naccumulations of 4 to 8 inches from southwestern Louisiana and the\nadjacent border of eastern Texas northeastward into western\nTennessee and Kentucky through Friday with isolated amounts up to 12\ninches.  The threat of heavy rains has ended in the Houston/\nGalveston area. However catastrophic and life threatening flooding\nwill continue in and around Houston, Beaumont/Port Arthur, eastward\ninto southwest Louisiana for the rest of the week.  The expected\nheavy rains spreading northeastward from Louisiana into western\nKentucky may also lead to flash flooding and increased river and\nsmall stream flooding.  DO NOT ATTEMPT TO TRAVEL IN THE AFFECTED\nAREA IF YOU ARE IN A SAFE PLACE. DO NOT DRIVE INTO FLOODED\nROADWAYS.  Please see warnings and products issued by your local\nNational Weather Service office for additional information on this\nlife-threatening situation.\n\nElsewhere, the outer bands of Harvey are expected to produce\nadditional rainfall amounts of 3 to 6 inches over portions of the\ncentral and eastern Gulf States and 2 to 4 inches farther north into\nparts of the Tennessee Valley, Ohio Valley and southern Mid Atlantic\nthrough Saturday.  These rains may lead to flooding concerns across\nthese areas.\n\nA list of preliminary rainfall observations compiled by the NOAA\nWeather Prediction Center can be found at:\nwww.wpc.ncep.noaa.gov/discussions/nfdscc1.html\n\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following heights above ground if the peak\nsurge occurs at the time of high tide...\n\nSan Luis Pass to Grand Isle...1 to 2 ft\n\nThe deepest water will occur along the immediate coast near the\narea of onshore winds. Surge-related flooding depends on the\nrelative timing of the surge and the tidal cycle, and can vary\ngreatly over short distances. For information specific to your\narea, please see products issued by your local National Weather\nService forecast office.\n\nWIND:  Tropical storm conditions are occurring over portions of\nthe warning area along the coast and are likely to persist through\nthis evening.  Gusts to tropical-storm-force are possible over\nother portions of southern Louisiana through this evening.\n\nSURF:  Swells generated by Harvey are still affecting the coast of\nLouisiana, but are expected to subside late tonight and Thursday.\nThese swells are likely to cause life-threatening surf and rip\ncurrent conditions. Please consult products from your local weather\noffice.\n\nTORNADOES:  A few tornadoes are possible through this evening across\nparts of Louisiana, Mississippi, western Alabama, and southeast\nArkansas. Additional tornadoes are possible on Thursday afternoon\nand evening across northern portions of Mississippi, Alabama, and\nGeorgia into parts of Tennessee.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 700 PM CDT.\nNext complete advisory at 1000 PM CDT.\n\n$$\nForecaster Beven\n\nNNNN",
    "messageBinNumber": "4",
    "messageDateTimeLocal": "20170830 04:00:00 PM CDT",
    "messageDateTimeLocalStr": "0400 PM CDT Wed Aug 30",
    "messageDateTimeUTC": "20170830 09:00:00 PM UTC",
    "messageDateTimeUTC24": "201708302100",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "NNE OR 20 DEGREES",
    "systemGeoRefPt1": "ABOUT 50 MI...80 KM N OF LAKE CHARLES LOUISIANA",
    "systemGeoRefPt2": "ABOUT 50 MI...80 KM SW OF ALEXANDRIA LOUISIANA",
    "systemIntensityKph": "65",
    "systemIntensityKts": "35",
    "systemIntensityMph": "40",
    "systemMslpInHg": "29.47",
    "systemMslpMb": "998",
    "systemName": "HARVEY",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "13",
    "systemSpeedKts": "7",
    "systemSpeedMph": "8",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1504126800"
  }
}
