{
  "cycloneMessage": {
    "advisoryNumber": "23",
    "atcfID": "AL092017",
    "centerLocLatitude": "28.0",
    "centerLocLatitudeExpanded": "28.0N",
    "centerLocLongitude": "-97",
    "centerLocLongitudeExpanded": "97.0W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT4 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Harvey Advisory Number  23\nNWS National Hurricane Center Miami FL       AL092017\n1000 PM CDT Fri Aug 25 2017\n\n...EYE OF CATEGORY 4 HARVEY MAKES LANDFALL BETWEEN PORT ARANSAS AND\nPORT O'CONNOR TEXAS...\n...CATASTROPHIC FLOODING EXPECTED DUE TO HEAVY RAINFALL AND STORM\nSURGE...\n\n\nSUMMARY OF 1000 PM CDT...0300 UTC...INFORMATION\n-----------------------------------------------\nLOCATION...28.0N 97.0W\nABOUT 30 MI...45 KM ENE OF CORPUS CHRISTI TEXAS\nABOUT 45 MI...75 KM SW OF PORT OCONNOR TEXAS\nMAXIMUM SUSTAINED WINDS...130 MPH...215 KM/H\nPRESENT MOVEMENT...NW OR 325 DEGREES AT 7 MPH...11 KM/H\nMINIMUM CENTRAL PRESSURE...938 MB...27.70 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Warning is in effect for...\n* Port Mansfield to High Island Texas\n\nA Hurricane Warning is in effect for...\n* Port Mansfield to Sargent Texas\n\nA Tropical Storm Warning is in effect for...\n* North of Sargent to High Island Texas\n\nA Storm Surge Warning means there is a danger of life-threatening\ninundation from rising water moving inland from the coastline in the\nindicated locations. For a depiction of areas at risk, please see\nthe National Weather Service Storm Surge Watch/Warning Graphic,\navailable at hurricanes.gov.  This is a life-threatening situation.\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area, in this case within the next few\nhours. Preparations to protect life and property should already be\ncomplete.\n\nInterests in southwestern Louisiana should continue to monitor the\nprogress of this system.\n\nFor storm information specific to your area, including possible\ninland watches and warnings, please monitor products issued by your\nlocal National Weather Service forecast office.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 1000 PM CDT (0300 UTC), the center of Hurricane Harvey was\nlocated near latitude 28.0 North, longitude 97.0 West.  Harvey has\njust made landfall on the Texas coast over the northern end of San\nJose Island about 4 miles (6 km) east of Rockport.  Harvey is\nmoving toward the northwest near 7 mph (11 km/h).  The hurricane is\nexpected to slow its forward motion and move slowly over\nsoutheastern Texas during the next couple of days.\n\nMaximum sustained winds are near 130 mph (215 km/h) with higher\ngusts.  Harvey is a category 4 hurricane on the Saffir-Simpson\nHurricane Wind Scale.  Weakening is forecast during the next 48\nhours while the center of Harvey is over southeastern Texas.\n\nHurricane-force winds extend outward up to 40 miles (65 km) from the\ncenter and tropical-storm-force winds extend outward up to 140 miles\n(220 km).  A Texas Coastal Ocean Observing Network station at\nAransas Pass recently reported sustained winds of 111 mph (178 km/h)\nand a wind gust of 131 mph (211 km/h).\n\nThe minimum central pressure just reported by an Air Force Reserve\nHurricane Hunter aircraft is 938 mb (27.70 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Harvey is expected to produce total rain accumulations of\n15 to 30 inches and isolated maximum amounts of 40 inches over the\nmiddle and upper Texas coast through next Wednesday. During the same\ntime period Harvey is expected to produce total rain accumulations\nof 5 to 15 inches in far south Texas and the Texas Hill Country over\nthrough southwest and central Louisiana. Rainfall of this magnitude\nwill cause catastrophic and life-threatening flooding.\n\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following heights above ground if the peak\nsurge occurs at the time of high tide...\n\nPort Aransas to Port O'Connor...9 to 13 ft\nPort O'Connor to Sargent...6 to 9 ft\nN Entrance Padre Island Natl Seashore to Port Aransas...5 to 8 ft\nSargent to Jamaica Beach...4 to 6 ft\nPort Mansfield to N Entrance Padre Island Natl Seashore...3 to 5 ft\nJamaica Beach to High Island...2 to 4 ft\nMouth of the Rio Grande to Port Mansfield...1 to 3 ft\nHigh Island to Morgan City...1 to 3 ft\n\nThe deepest water will occur along the immediate coast near and to\nthe northeast of the landfall location, where the surge will be\naccompanied by large and destructive waves.  Surge-related flooding\ndepends on the relative timing of the surge and the tidal cycle, and\ncan vary greatly over short distances.  For information specific to\nyour area, please see products issued by your local National Weather\nService forecast office.\n\nWIND:  Hurricane conditions are occuring along the coast in the Port\nAransas to Port O'Connor area and should spread over other portions\nof the hurricane warning area during the next several hours.\nTropical storm conditions are occurring in other portions of the\nhurricane and tropical storm warning areas.  Tropical storm\nconditions are likely to persist along portions of the coast through\nat least Sunday.\n\nSURF:  Swells generated by Harvey are affecting the Texas,\nLouisiana, and northeast Mexico coasts.  These swells are likely to\ncause life-threatening surf and rip current conditions. Please\nconsult products from your local weather office.\n\nTORNADOES:  Tornadoes are possible through Saturday near the middle\nand upper Texas coast into far southwest Louisiana.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 100 AM CDT.\nNext complete advisory at 400 AM CDT.\n\n$$\nForecaster Beven\n\nNNNN",
    "messageBinNumber": "4",
    "messageDateTimeLocal": "20170825 10:00:00 PM CDT",
    "messageDateTimeLocalStr": "1000 PM CDT Fri Aug 25",
    "messageDateTimeUTC": "20170826 03:00:00 AM UTC",
    "messageDateTimeUTC24": "201708260300",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "NW OR 325 DEGREES",
    "systemGeoRefPt1": "ABOUT 30 MI...45 KM ENE OF CORPUS CHRISTI TEXAS",
    "systemGeoRefPt2": "ABOUT 45 MI...75 KM SW OF PORT OCONNOR TEXAS",
    "systemIntensityKph": "215",
    "systemIntensityKts": "115",
    "systemIntensityMph": "130",
    "systemMslpInHg": "27.70",
    "systemMslpMb": "938",
    "systemName": "HARVEY",
    "systemSaffirSimpsonCategory": "CATEGORY 4",
    "systemSpeedKph": "11",
    "systemSpeedKts": "6",
    "systemSpeedMph": "7",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1503716400"
  }
}
