{
  "cycloneMessage": {
    "advisoryNumber": "41",
    "atcfID": "AL092017",
    "centerLocLatitude": "30.5",
    "centerLocLatitudeExpanded": "30.5N",
    "centerLocLongitude": "-93.3",
    "centerLocLongitudeExpanded": "93.3W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT4 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Harvey Advisory Number  41\nNWS National Hurricane Center Miami FL       AL092017\n1000 AM CDT Wed Aug 30 2017\n\n...CENTER OF HARVEY MOVING FARTHER INLAND OVER SOUTHWESTERN\nLOUISIANA...\n...FLOODING RAINS CONTINUING OVER EXTREME SOUTHEASTERN TEXAS AND\nSOUTHWESTERN LOUISIANA...\n\n\nSUMMARY OF 1000 AM CDT...1500 UTC...INFORMATION\n-----------------------------------------------\nLOCATION...30.5N 93.3W\nABOUT 30 MI...45 KM NNW OF LAKE CHARLES LOUISIANA\nABOUT 75 MI...115 KM SW OF ALEXANDRIA LOUISIANA\nMAXIMUM SUSTAINED WINDS...45 MPH...75 KM/H\nPRESENT MOVEMENT...NNE OR 20 DEGREES AT 8 MPH...13 KM/H\nMINIMUM CENTRAL PRESSURE...993 MB...29.33 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe Storm Surge Watch is discontinued west of Sabine Pass, Texas.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Warning is in effect for...\n* Holly Beach Louisiana to Morgan City Louisiana\n\nA Storm Surge Watch is in effect for...\n* Sabine Pass Texas to west of Holly Beach Louisiana\n\nA Tropical Storm Warning is in effect for...\n* East of High Island Texas to Grand Isle Louisiana\n\nCatastrophic and life-threatening flooding continues in southeastern\nTexas and portions of southwestern Louisiana.  Please see warnings\nand other products issued by your local National Weather Service\noffice for additional information on this life-threatening\nsituation.\n\nA Storm Surge Warning means there is a danger of life-threatening\ninundation, from rising water moving inland from the coastline,\nduring the next 12 hours in the indicated locations.  For a\ndepiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.  This is a life-threatening situation.  Persons\nlocated within these areas should take all necessary actions to\nprotect life and property from rising water and the potential for\nother dangerous conditions.  Promptly follow evacuation and other\ninstructions from local officials.\n\nFor storm information specific to your area, including possible\ninland watches and warnings, please monitor products issued by your\nlocal National Weather Service forecast office.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 1000 AM CDT (1500 UTC), the center of Tropical Storm Harvey was\nlocated near latitude 30.5 North, longitude 93.3 West.  Harvey is\nmoving toward the north-northeast near 8 mph (13 km/h) and this\ngeneral motion is expected to continue through Thursday.  A turn\ntoward the northeast is expected Thursday night and Friday.  On the\nforecast track, the center of Harvey should move through\nsouthwestern and central Louisiana today and tonight, then move\nthrough northeastern Louisiana and northwestern Mississippi Thursday\nand Thursday night.\n\nMaximum sustained winds are near 45 mph (75 km/h) with higher gusts.\nWeakening is forecast during the next 48 hours as Harvey moves\nfarther inland, and the cyclone is expected to weaken to a tropical\ndepression tonight.\n\nTropical-storm-force winds extend outward up to 80 miles (130 km)\nmainly to the south of the center.  During the past few hours,\nthere have been reports of wind gusts of 40-50 mph (65-80 km/h) in\nsouthwestern Louisiana and southeastern Texas near Lake Charles,\nCameron, and Sabine Pass.\n\nThe minimum central pressure based on surface observations is\n993 mb (29.33 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Harvey is expected to produce additional rainfall\naccumulations of 3 to 6 inches from southwestern Louisiana and the\nadjacent border of eastern Texas northeastward into western\nTennessee and Kentucky through Friday with isolated amounts up to 10\ninches.  The threat of heavy rains has ended in the Houston/\nGalveston area. However catastrophic and life threatening flooding\nwill continue in and around Houston, Beaumont/Port Arthur, eastward\ninto southwest Louisiana for the rest of the week.  The expected\nheavy rains spreading northeastward from Louisiana into western\nKentucky may also lead to flash flooding and increased river, small\nstream flooding.  DO NOT ATTEMPT TO TRAVEL IN THE AFFECTED AREA IF\nYOU ARE IN A SAFE PLACE. DO NOT DRIVE INTO FLOODED ROADWAYS.  Please\nsee warnings and products issued by your local National Weather\nService office for additional information on this life-threatening\nsituation.\n\nElsewhere, the outer bands of Harvey are expected to produce\nadditional rainfall amounts of 3 to 6 inches over portions of the\ncentral and eastern Gulf States and 2 to 4 inches farther north into\nparts of the Tennessee Valley, Ohio Valley and southern Mid Atlantic\nthrough Saturday.  These rains may lead to flooding concerns across\nthese areas.\n\nA list of preliminary rainfall observations compiled by the NOAA\nWeather Prediction Center can be found at:\nwww.wpc.ncep.noaa.gov/discussions/nfdscc1.html\n\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following heights above ground if the peak\nsurge occurs at the time of high tide...\n\nHolly Beach to Morgan City...2 to 4 ft\nSan Luis Pass to west of Holly Beach incl. Galveston Bay...1 to 3 ft\nMorgan City to Grand Isle...1 to 3 ft\n\nThe deepest water will occur along the immediate coast near the\narea of onshore winds. Surge-related flooding depends on the\nrelative timing of the surge and the tidal cycle, and can vary\ngreatly over short distances. For information specific to your\narea, please see products issued by your local National Weather\nService forecast office.\n\nWIND:  Tropical storm conditions are occurring over portions of\nthe warning area along the coast and are likely to persist through\nthis afternoon.\n\nSURF:  Swells generated by Harvey are still affecting the coasts of\nTexas and Louisiana.  These swells are likely to cause life-\nthreatening surf and rip current conditions. Please consult products\nfrom your local weather office.\n\nTORNADOES:  A few tornadoes are possible today and tonight over\nparts of Louisiana, Mississippi, southern Alabama, and southeast\nArkansas.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 100 PM CDT.\nNext complete advisory at 400 PM CDT.\n\n$$\nForecaster Beven\n\nNNNN",
    "messageBinNumber": "4",
    "messageDateTimeLocal": "20170830 10:00:00 AM CDT",
    "messageDateTimeLocalStr": "1000 AM CDT Wed Aug 30",
    "messageDateTimeUTC": "20170830 03:00:00 PM UTC",
    "messageDateTimeUTC24": "201708301500",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "NNE OR 20 DEGREES",
    "systemGeoRefPt1": "ABOUT 30 MI...45 KM NNW OF LAKE CHARLES LOUISIANA",
    "systemGeoRefPt2": "ABOUT 75 MI...115 KM SW OF ALEXANDRIA LOUISIANA",
    "systemIntensityKph": "75",
    "systemIntensityKts": "40",
    "systemIntensityMph": "45",
    "systemMslpInHg": "29.33",
    "systemMslpMb": "993",
    "systemName": "HARVEY",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "13",
    "systemSpeedKts": "7",
    "systemSpeedMph": "8",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1504105200"
  }
}
