{
  "cycloneMessage": {
    "advisoryNumber": "14",
    "atcfID": "AL092017",
    "centerLocLatitude": "22.0",
    "centerLocLatitudeExpanded": "21.9N",
    "centerLocLongitude": "-92.6",
    "centerLocLongitudeExpanded": "92.6W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT4 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Depression Harvey Advisory Number  14\nNWS National Hurricane Center Miami FL       AL092017\n1000 PM CDT Wed Aug 23 2017\n\n...HARVEY DRIFTING ERRATICALLY NORTHWESTWARD AS A TROPICAL\nDEPRESSION...\n\n\nSUMMARY OF 1000 PM CDT...0300 UTC...INFORMATION\n-----------------------------------------------\nLOCATION...21.9N 92.6W\nABOUT 510 MI...815 KM SSE OF PORT OCONNOR TEXAS\nABOUT 445 MI...715 KM SE OF PORT MANSFIELD TEXAS\nMAXIMUM SUSTAINED WINDS...35 MPH...55 KM/H\nPRESENT MOVEMENT...NW OR 325 DEGREES AT 2 MPH...4 KM/H\nMINIMUM CENTRAL PRESSURE...1002 MB...29.59 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Watch is in effect for...\n* Port Mansfield to High Island\n\nA Hurricane Watch is in effect for...\n* North of Port Mansfield to San Luis Pass\n\nA Tropical Storm Watch is in effect for...\n* Boca De Catan Mexico to Port Mansfield Texas\n* North of San Luis Pass to High Island\n\nA Storm Surge Watch means there is a possibility of life-\nthreatening inundation, from rising water moving inland from the\ncoastline, in the indicated locations during the next 48 hours.\nFor a depiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours\nbefore the anticipated first occurrence of tropical-storm-force\nwinds, conditions that make outside preparations difficult or\ndangerous.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, generally within 48 hours.\n\nWarnings will likely be required for portions of the watch area\nThursday morning.  In addition, interests in southwestern\nLouisiana should continue to monitor the progress of this system.\n\nFor storm information specific to your area in the United\nStates, including possible inland watches and warnings, please\nmonitor products issued by your local National Weather Service\nforecast office. For storm information specific to your area outside\nthe United States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 1000 PM CDT (0300 UTC), the center of Tropical Depression Harvey\nwas located near latitude 21.9 North, longitude 92.6 West. The\ndepression is moving toward the northwest near 2 mph (4 km/h). A\ntrack toward the northwest or north-northwest at a faster forward\nspeed is expected for the next 48 hours.  On the forecast track,\nHarvey should be approaching the Texas coast late Friday or Friday\nnight.\n\nReports from an Air Force Reserve Hurricane Hunter aircraft indicate\nthat maximum sustained winds remain near 35 mph (55 km/h) with\nhigher gusts.  Some strengthening is forecast during the next\n48 hours, and Harvey could become a tropical storm later tonight or\nThursday and a hurricane Friday or Friday night.\n\nThe latest minimum central pressure reported by the Hurricane Hunter\nis 1002 mb (29.59 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Harvey is expected to produce total rain accumulations of\n10 to 15 inches and isolated maximum amounts of 20 inches over the\nTexas coast and southwest Louisiana through next Wednesday, with\nheavy rainfall beginning Friday. During the same time period Harvey\nis expected to produce total rain accumulations of 3 to 9 inches\nalong its outer radius including parts of south, central, and\neastern Texas and the lower Mississippi Valley. Rainfall from Harvey\nmay cause life-threatening flooding.\n\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following heights above ground if the peak\nsurge occurs at the time of high tide...\n\nPort Mansfield to High Island...4 to 6 ft\n\nThe deepest water will occur along the immediate coast near and to\nthe northeast of the landfall location, where the surge will be\naccompanied by large and destructive waves.  Surge-related flooding\ndepends on the relative timing of the surge and the tidal cycle, and\ncan vary greatly over short distances.  For information specific to\nyour area, please see products issued by your local National Weather\nService forecast office.\n\nWIND:  Hurricane conditions are possible within the hurricane watch\narea late Friday or Friday night, with tropical storm conditions\npossible by Friday.\n\nSURF:  Swells generated by Harvey are likely to affect the Texas,\nLouisiana, and northeast Mexico coasts by Friday.  These swells are\nlikely to cause life-threatening surf and rip current conditions.\nPlease consult products from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 100 AM CDT.\nNext complete advisory at 400 AM CDT.\n\n$$\nForecaster Beven\n\nNNNN",
    "messageBinNumber": "4",
    "messageDateTimeLocal": "20170823 11:00:00 PM CDT",
    "messageDateTimeLocalStr": "1000 PM CDT Wed Aug 23",
    "messageDateTimeUTC": "20170824 04:00:00 AM UTC",
    "messageDateTimeUTC24": "201708240300",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "NW OR 325 DEGREES",
    "systemGeoRefPt1": "ABOUT 500 MI...810 KM SSE OF PORT OCONNOR TEXAS",
    "systemGeoRefPt2": "ABOUT 440 MI...705 KM SE OF PORT MANSFIELD TEXAS",
    "systemIntensityKph": "65",
    "systemIntensityKts": "35",
    "systemIntensityMph": "40",
    "systemMslpInHg": "29.59",
    "systemMslpMb": "1002",
    "systemName": "HARVEY",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "4",
    "systemSpeedKts": "2",
    "systemSpeedMph": "2",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1503543600"
  }
}
