{
  "cycloneMessage": {
    "advisoryNumber": "13A",
    "atcfID": "AL092017",
    "centerLocLatitude": "21.7",
    "centerLocLatitudeExpanded": "21.7N",
    "centerLocLongitude": "-92.5",
    "centerLocLongitudeExpanded": "92.5W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT4 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Depression Harvey Intermediate Advisory Number 13A\nNWS National Hurricane Center Miami FL       AL092017\n700 PM CDT Wed Aug 23 2017\n\n...HURRICANE HUNTER AIRCRAFT FINDS THAT HARVEY HAS NOT\nSTRENGTHENED...\n\n\nSUMMARY OF 700 PM CDT...0000 UTC...INFORMATION\n----------------------------------------------\nLOCATION...21.7N 92.5W\nABOUT 525 MI...845 KM SSE OF PORT OCONNOR TEXAS\nABOUT 460 MI...740 KM SE OF PORT MANSFIELD TEXAS\nMAXIMUM SUSTAINED WINDS...35 MPH...55 KM/H\nPRESENT MOVEMENT...NW OR 320 DEGREES AT 2 MPH...4 KM/H\nMINIMUM CENTRAL PRESSURE...1003 MB...29.62 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Watch is in effect for...\n* Port Mansfield to High Island\n\nA Hurricane Watch is in effect for...\n* North of Port Mansfield to San Luis Pass\n\nA Tropical Storm Watch is in effect for...\n* Boca De Catan Mexico to Port Mansfield Texas\n* North of San Luis Pass to High Island\n\nA Storm Surge Watch means there is a possibility of life-\nthreatening inundation, from rising water moving inland from the\ncoastline, in the indicated locations during the next 48 hours.\nFor a depiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours\nbefore the anticipated first occurrence of tropical-storm-force\nwinds, conditions that make outside preparations difficult or\ndangerous.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, generally within 48 hours.\n\nInterests in southwestern Louisiana should continue to monitor the\nprogress of this system.\n\nFor storm information specific to your area in the United\nStates, including possible inland watches and warnings, please\nmonitor products issued by your local National Weather Service\nforecast office. For storm information specific to your area outside\nthe United States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 700 PM CDT (0000 UTC), the center of Tropical Depression Harvey\nwas located near latitude 21.7 North, longitude 92.5 West. The\ndepression is moving erratically toward the northwest near 2 mph (4\nkm/h). A track toward the northwest or north-northwest at a faster\nforward speed is expected for the next 48 hours.  On the forecast\ntrack, Harvey should be approaching the Texas coast late Friday.\n\nReports from an Air Force Reserve Hurricane Hunter aircraft\nindicate that maximum sustained winds remain near 35 mph (55 km/h)\nwith higher gusts.  Some strengthening is forecast during the next\n48 hours, and Harvey could become a tropical storm later tonight\nand a hurricane on Friday.\n\nThe minimum central pressure estimated from the Hurricane Hunter\naircraft data and Mexican surface observations is 1003 mb\n(29.62 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Harvey is expected to produce total rain accumulations of\n10 to 15 inches with isolated maximum amounts of 20 inches over the\nmiddle and upper Texas coast and southwest Louisiana through next\nTuesday, with heavy rainfall beginning as early as Friday morning.\nHarvey is also expected to produce total rain accumulations of 3 to\n9 inches in portions of south, central, and northeast Texas and the\nrest of the lower Mississippi Valley. Rainfall from Harvey could\ncause life-threatening flooding.\n\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following heights above ground if the peak\nsurge occurs at the time of high tide...\n\nPort Mansfield to High Island...4 to 6 ft\n\nThe deepest water will occur along the immediate coast near and to\nthe northeast of the landfall location, where the surge will be\naccompanied by large and destructive waves.  Surge-related flooding\ndepends on the relative timing of the surge and the tidal cycle, and\ncan vary greatly over short distances.  For information specific to\nyour area, please see products issued by your local National Weather\nService forecast office.\n\nWIND:  Hurricane conditions are possible within the hurricane watch\narea by late Friday, with tropical storm conditions possible by\nearly Friday.\n\nSURF:  Swells generated by Harvey are likely to affect the Texas,\nLouisiana, and northeast Mexico coasts by Friday.  These swells are\nlikely to cause life-threatening surf and rip current conditions.\nPlease consult products from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 1000 PM CDT.\n\n$$\nForecaster Beven\n\nNNNN",
    "messageBinNumber": "4",
    "messageDateTimeLocal": "20170823 07:00:00 PM CDT",
    "messageDateTimeLocalStr": "0700 PM CDT Wed Aug 23",
    "messageDateTimeUTC": "20170824 12:00:00 AM UTC",
    "messageDateTimeUTC24": "201708240000",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "NW OR 320 DEGREES",
    "systemGeoRefPt1": "ABOUT 525 MI...845 KM SSE OF PORT OCONNOR TEXAS",
    "systemGeoRefPt2": "ABOUT 460 MI...740 KM SE OF PORT MANSFIELD TEXAS",
    "systemIntensityKph": "55",
    "systemIntensityKts": "30",
    "systemIntensityMph": "35",
    "systemMslpInHg": "29.62",
    "systemMslpMb": "1003",
    "systemName": "HARVEY",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "4",
    "systemSpeedKts": "2",
    "systemSpeedMph": "2",
    "systemType": "TROPICAL DEPRESSION",
    "timeEpochSeconds": "1503532800"
  }
}
