{
  "cycloneMessage": {
    "advisoryNumber": "32A",
    "atcfID": "AL112017",
    "centerLocLatitude": "19.7",
    "centerLocLatitudeExpanded": "19.7N",
    "centerLocLongitude": "-67.7",
    "centerLocLongitudeExpanded": "67.7W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT1 ALL\nTTAA00 KNHC DDHHMM CCA\n\nBULLETIN\nHurricane Irma Intermediate Advisory Number 32A...Corrected\nNWS National Hurricane Center Miami FL       AL112017\n200 AM AST Thu Sep 07 2017\n\nCorrected distance from San Juan in kilometers\n\n...EYE OF CATEGORY 5 HURRICANE IRMA MOVING WEST-NORTHWESTWARD TO\nTHE NORTHEAST OF THE DOMINICAN REPUBLIC...\n\n\nSUMMARY OF 200 AM AST...0600 UTC...INFORMATION\n----------------------------------------------\nLOCATION...19.7N 67.7W\nABOUT 140 MI...225 KM NW OF SAN JUAN PUERTO RICO\nABOUT 255 MI...410 KM ESE OF GRAND TURK ISLAND\nMAXIMUM SUSTAINED WINDS...180 MPH...290 KM/H\nPRESENT MOVEMENT...WNW OR 290 DEGREES AT 16 MPH...26 KM/H\nMINIMUM CENTRAL PRESSURE...921 MB...27.20 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Warning is in effect for...\n* Puerto Rico, Vieques, and Culebra\n* Dominican Republic from Cabo Engano to the northern border with\nHaiti\n* Haiti from the northern border with the Dominican Republic to Le\nMole St. Nicholas\n* Southeastern Bahamas and the Turks and Caicos Islands\n* Central Bahamas\n\nA Hurricane Watch is in effect for...\n* Cuba from Matanzas province eastward to Guantanamo province\n* Northwestern Bahamas\n\nA Tropical Storm Warning is in effect for...\n* Dominican Republic from south of Cabo Engano westward to the\nsouthern border with Haiti\n* Haiti from south of Le Mole St. Nicholas to Port-Au-Prince\n* Cuba provinces of Guantanamo, Holguin, and Las Tunas\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area.  Preparations to protect life and\nproperty should be rushed to completion.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours\nbefore the anticipated first occurrence of tropical-storm-force\nwinds, conditions that make outside preparations difficult or\ndangerous.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area.\n\nInterests elsewhere in the Dominican Republic and Haiti, as well as\nCuba, the northwestern Bahamas, and Florida should monitor the\nprogress of Irma.\n\nFor storm information specific to your area in the United\nStates, including possible inland watches and warnings, please\nmonitor products issued by your local National Weather Service\nforecast office. For storm information specific to your area outside\nthe United States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 200 AM AST (0600 UTC), the center of Hurricane Irma was located\nnear latitude 19.7 North, longitude 67.7 West. Irma is moving toward\nthe west-northwest near 16 mph (26 km/h), and this general motion is\nexpected to continue for the next couple of days.  On the forecast\ntrack, the extremely dangerous core of Irma will move away from\nPuerto Rico this morning, pass just north of the coast of Hispaniola\nlater today, and be near the Turks and Caicos and southeastern\nBahamas by this evening.\n\nReports from an Air Force Reserve Hurricane Hunter aircraft\nindicate that maximum sustained winds are now near 180 mph (290\nkm/h) with higher gusts.  Irma is a category 5 hurricane on the\nSaffir-Simpson Hurricane Wind Scale.  Some fluctuations in intensity\nare likely during the next day or two, but Irma is forecast to\nremain a powerful category 4 or 5 hurricane during the next couple\nof days.\n\nHurricane-force winds extend outward up to 50 miles (85 km) from\nthe center and tropical-storm-force winds extend outward up to 185\nmiles (295 km).\n\nThe minimum central pressure reported by the Hurricane Hunter is\n921 mb (27.20 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nSTORM SURGE:  The combination of a life-threatening storm surge and\nlarge breaking waves will raise water levels ABOVE NORMAL TIDE\nLEVELS by the following amounts within the hurricane warning area\nnear and to the north of the center of Irma.  Near the coast, the\nsurge will be accompanied by large and destructive waves.\n\nTurks and Caicos Islands...15 to 20 ft\nSoutheastern and central Bahamas...15 to 20 ft\nNorthern coast of the Dominican Republic...3 to 5 ft\nNorthern coast of Haiti and the Gulf of Gonave...1 to 3 ft\nNorthern coast of Cuba in the warning area...5 to 10 ft\n\nThe combination of a life-threatening storm surge and the tide will\ncause normally dry areas near the coast to be flooded by rising\nwaters moving inland from the shoreline.  The water is expected to\nreach the following HEIGHTS ABOVE GROUND if the peak surge occurs at\nthe time of high tide...\n\nNorthern coast of Puerto Rico...2 to 4 ft\nSouthern coast of Puerto Rico...1 to 3 ft\n\nWater levels in the U.S. and British Virgin Islands will gradually\nsubside tonight and early Thursday.\n\nThe deepest water will occur along the immediate coast in areas of\nonshore winds, where the surge will be accompanied by large and\ndestructive waves.  Surge-related flooding depends on the relative\ntiming of the surge and the tidal cycle, and can vary greatly over\nshort distances.  For information specific to your area, please see\nproducts issued by your local National Weather Service forecast\noffice.\n\nWIND:  Tropical Storm and Hurricane conditions will continue over\nportions of Puerto Rico for the next few hours.  Hurricane\nconditions are expected to begin within the hurricane warning area\nin the Dominican Republic and Haiti today, with tropical\nstorm conditions beginning in the next few hours.  Hurricane\nconditions are expected to begin in the warning area in the\nsoutheastern Bahamas and the Turks and Caicos Islands later today\nwith tropical storm conditions expected within the next several\nhours.  These conditions will spread into the Central Bahamas by\nThursday night or early Friday.\n\nHurricane and tropical storm conditions are possible within the\nwatch area in Cuba by Friday.  Tropical storm conditions are\nexpected to begin within the warning area in Cuba Thursday night.\n\nRAINFALL: Irma is expected to produce the following rain\naccumulations through Saturday:\n\nNorthern Leeward Islands...Additional 1 to 3 inches.  Storm total 8\nto 12 inches, isolated 20 inches.\nNortheast Puerto Rico and the British and U.S. Virgin Islands...6 to\n12 inches, isolated 20 inches.  Southwest Puerto Rico...3 to 6\ninches, isolated 10 inches.\nThe Southern Leeward Islands, and Saint Croix...2 to 4 inches.\nSoutheast Bahamas, Central Bahamas, and the Turks and Caicos...8 to\n12 inches, isolated 20 inches.\nNorthern Dominican Republic and northern Haiti...4 to 10 inches,\nisolated 15 inches.\nEastern and Central Cuba...4 to 10 inches, isolated 15 inches.\nSouthwest Haiti...1 to 4 inches.\n\nIn all areas this rainfall may cause life-threatening flash floods\nand mudslides.\n\nSURF:  Swells generated by Irma will affect the northern Leeward\nIslands, Puerto Rico, the Virgin Islands, the southeastern Bahamas,\nthe Turks and Caicos Islands, the northern coast of the Dominican\nRepublic, and portions of the southeast coast of the United States\nduring the next several days.  These swells are likely to cause\nlife-threatening surf and rip current conditions.  Please consult\nproducts from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 500 AM AST.\n\n$$\nForecaster Pasch\n\nNNNN",
    "messageBinNumber": "1",
    "messageDateTimeLocal": "20170907 02:00:00 AM AST",
    "messageDateTimeLocalStr": "0200 AM AST Thu Sep 07",
    "messageDateTimeUTC": "20170907 06:00:00 AM UTC",
    "messageDateTimeUTC24": "201709070600",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "WNW OR 290 DEGREES",
    "systemGeoRefPt1": "ABOUT 140 MI...225 KM NW OF SAN JUAN PUERTO RICO",
    "systemGeoRefPt2": "ABOUT 255 MI...410 KM ESE OF GRAND TURK ISLAND",
    "systemIntensityKph": "290",
    "systemIntensityKts": "155",
    "systemIntensityMph": "180",
    "systemMslpInHg": "27.20",
    "systemMslpMb": "921",
    "systemName": "IRMA",
    "systemSaffirSimpsonCategory": "CATEGORY 5",
    "systemSpeedKph": "26",
    "systemSpeedKts": "14",
    "systemSpeedMph": "16",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1504764000"
  }
}
