{
  "cycloneMessage": {
    "advisoryNumber": "23",
    "atcfID": "AL112017",
    "centerLocLatitude": "16.7",
    "centerLocLatitudeExpanded": "16.7N",
    "centerLocLongitude": "-55.6",
    "centerLocLongitudeExpanded": "55.6W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT1 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Irma Advisory Number  23\nNWS National Hurricane Center Miami FL       AL112017\n1100 PM AST Mon Sep 04 2017\n\n...HURRICANE WARNINGS ISSUED FOR PUERTO RICO AND THE VIRGIN\nISLANDS...\n\n\nSUMMARY OF 1100 PM AST...0300 UTC...INFORMATION\n-----------------------------------------------\nLOCATION...16.7N 55.6W\nABOUT 410 MI...660 KM E OF THE LEEWARD ISLANDS\nMAXIMUM SUSTAINED WINDS...140 MPH...220 KM/H\nPRESENT MOVEMENT...W OR 270 DEGREES AT 13 MPH...20 KM/H\nMINIMUM CENTRAL PRESSURE...943 MB...27.85 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe Hurricane Watch for the U.S. Virgin Islands, Puerto Rico,\nVieques, and Culebra has been changed to a Hurricane Warning.\n\nThe government of Antigua has changed the Hurricane Watch for the\nBritish Virgin Islands to a Hurricane Warning.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Warning is in effect for...\n* Antigua, Barbuda, Anguilla, Montserrat, St. Kitts, and Nevis\n* Saba, St. Eustatius, and Sint Maarten\n* Saint Martin and Saint Barthelemy\n* British Virgin Islands\n* U.S. Virgin Islands\n* Puerto Rico, Vieques, and Culebra\n\nA Hurricane Watch is in effect for...\n* Guadeloupe\n\nA Tropical Storm Warning is in effect for...\n* Guadeloupe\n\nA Tropical Storm Watch is in effect for...\n* Dominica\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area.  A warning is typically issued\n36 hours before the anticipated first occurrence of tropical-storm-\nforce winds, conditions that make outside preparations difficult or\ndangerous.  Preparations to protect life and property should be\nrushed to completion.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours before\nthe anticipated first occurrence of tropical-storm-force winds,\nconditions that make outside preparations difficult or dangerous.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area within 36 hours.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, generally within 48 hours.\n\nInterests in the Dominican Republic, Haiti, the Turks and Caicos\nIslands, Cuba, and the southeastern and central Bahamas should\nmonitor the progress of Irma.\n\nFor storm information specific to your area in the United\nStates, including possible inland watches and warnings, please\nmonitor products issued by your local National Weather Service\nforecast office. For storm information specific to your area outside\nthe United States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 1100 PM AST (0300 UTC), the eye of Hurricane Irma was located\nby an Air Force Hurricane Hunter aircraft near latitude 16.7 North,\nlongitude 55.6 West.  Irma is moving toward the west near 13 mph (20\nkm/h) and this general motion is expected to continue into Tuesday,\nfollowed by a turn toward the west-northwest late Tuesday.  On the\nforecast track, the center of Irma will move near or over portions\nof the northern Leeward Islands Tuesday night and early Wednesday.\n\nMaximum sustained winds are near 140 mph (220 km/h) with higher\ngusts.  Irma is a category 4 hurricane on the Saffir-Simpson\nHurricane Wind Scale.  Additional strengthening is forecast during\nthe next 48 hours.\n\nHurricane-force winds extend outward up to 45 miles (75 km) from the\ncenter and tropical-storm-force winds extend outward up to 140 miles\n(220 km).\n\nThe minimum central pressure estimated from Hurricane\nHunter observations is 943 mb (27.85 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nSTORM SURGE:  The combination of a dangerous storm surge and large\nbreaking waves will raise water levels by as much as 6 to 9 feet\nabove normal tide levels along the coasts of the extreme northern\nLeeward Islands within the hurricane warning area near and to the\nnorth of the center of Irma.  Near the coast, the surge will be\naccompanied by large and destructive waves.\n\nThe combination of a dangerous storm surge and the tide will cause\nnormally dry areas near the coast to be flooded by rising waters\nmoving inland from the shoreline.  The water is expected to reach\nthe following heights above ground if the peak surge occurs at the\ntime of high tide...\n\nBritish and U.S. Virgin Islands except St. Croix...4 to 6 ft\nNorthern coast of Puerto Rico...2 to 4 ft\nSouthern coast of Puerto Rico and St. Croix...1 to 2 ft\n\nThe deepest water will occur along the immediate coast in areas of\nonshore winds, where the surge will be accompanied by large and\ndestructive waves.  Surge-related flooding depends on the relative\ntiming of the surge and the tidal cycle, and can vary greatly over\nshort distances.  For information specific to your area, please see\nproducts issued by your local National Weather Service forecast\noffice.\n\nWIND:  Hurricane conditions are expected within the hurricane\nwarning area by Tuesday night, with tropical storm conditions\nexpected by late Tuesday.  Hurricane conditions are possible within\nthe hurricane watch area in the Virgin Islands and Puerto Rico by\nlate Wednesday, with tropical storm conditions possible by early\nWednesday.  Tropical Storm conditions are expected within the\ntropical storm warning area by late Tuesday.\n\nRAINFALL:  Irma is expected to produce total rainfall accumulations\nof 3 to 6 inches with isolated maximum amounts of 10 inches across\nthe northern Leeward Islands, the British and U.S. Virgin Islands,\nand Puerto Rico.  These rainfall amounts may cause life-threatening\nflash floods and mudslides.\n\nSURF:  Swells generated by Irma will affect the northern Leeward\nIslands, Puerto Rico, and the U.S. and British Virgin Islands\nduring the next several days.  These swells are likely to cause\nlife-threatening surf and rip current conditions. Please consult\nproducts from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 200 AM AST.\nNext complete advisory at 500 AM AST.\n\n$$\nForecaster Pasch\n\nNNNN",
    "messageBinNumber": "1",
    "messageDateTimeLocal": "20170904 11:00:00 PM AST",
    "messageDateTimeLocalStr": "1100 PM AST Mon Sep 04",
    "messageDateTimeUTC": "20170905 03:00:00 AM UTC",
    "messageDateTimeUTC24": "201709050300",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "W OR 270 DEGREES",
    "systemGeoRefPt1": "ABOUT 410 MI...660 KM E OF THE LEEWARD ISLANDS",
    "systemIntensityKph": "220",
    "systemIntensityKts": "120",
    "systemIntensityMph": "140",
    "systemMslpInHg": "27.85",
    "systemMslpMb": "943",
    "systemName": "IRMA",
    "systemSaffirSimpsonCategory": "CATEGORY 4",
    "systemSpeedKph": "20",
    "systemSpeedKts": "11",
    "systemSpeedMph": "13",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1504580400"
  }
}
