{
  "cycloneMessage": {
    "advisoryNumber": "42",
    "atcfID": "AL112017",
    "centerLocLatitude": "22.8",
    "centerLocLatitudeExpanded": "22.8N",
    "centerLocLongitude": "-79.8",
    "centerLocLongitudeExpanded": "79.8W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT1 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Irma Advisory Number  42\nNWS National Hurricane Center Miami FL       AL112017\n1100 AM EDT Sat Sep 09 2017\n\n...IRMA CONTINUES TO POUND THE NORTH COAST OF CUBA...\n...FORECAST TO RESTRENGTHEN WHILE HEADING FOR SOUTH FLORIDA AND THE\nKEYS...\n\n\nSUMMARY OF 1100 AM EDT...1500 UTC...INFORMATION\n-----------------------------------------------\nLOCATION...22.8N 79.8W\nABOUT 90 MI...145 KM ESE OF VARADERO CUBA\nABOUT 175 MI...285 KM SE OF KEY WEST FLORIDA\nMAXIMUM SUSTAINED WINDS...125 MPH...205 KM/H\nPRESENT MOVEMENT...W OR 280 DEGREES AT 9 MPH...15 KM/H\nMINIMUM CENTRAL PRESSURE...941 MB...27.79 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe Storm Surge Warning has been extended from Chassahowitzka to the\nSuwanee River.\n\nThe Storm Surge Watch has been extended from north of the Suwanee\nRiver to Ochlockonee River and from north of the Volusia/Brevard\nCounty line north to Isle of Palms, South Carolina.\n\nThe Hurricane Warning for the east coast of the United States\nhas been extended northward to Fernandina Beach, and the Hurricane\nWatch has been extended from north of Fernandina Beach to Edisto\nBeach.\n\nThe Hurricane Warning for the Gulf of Mexico coast has been\nextended to the Aucilla River.  The Hurricane Watch is now in\neffect from west of the Aucilla River to Indian Pass.\n\nA Tropical Storm Watch has been issued from north of Edisto Beach\nto the South Santee River.\n\nA Tropical Storm Watch has been issued from west of Indian Pass to\nthe Okaloosa/Walton County Line.\n\nThe government of Cuba has extended the Hurricane Warning to the\nHavana province.\n\nThe government of the Bahamas has adjusted the Hurricane Warning\nto only include Andros Island, Bimini and Grand Bahama.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Warning is in effect for...\n* Volusia/Brevard County line southward around the Florida\npeninsula to the Suwanee River\n* Florida Keys\n* Tampa Bay\n\nA Storm Surge Watch is in effect for...\n* North of the Volusia/Brevard County line to the Isle of Palms,\nSouth Carolina\n* North of the Suwanee River to Ochlockonee River\n\nA Hurricane Warning is in effect for...\n* Fernandina Beach southward around the Florida peninsula to\nthe Aucilla River\n* Florida Keys\n* Lake Okeechobee\n* Florida Bay\n* Cuban provinces of Camaguey, Ciego de Avila, Sancti Spiritus,\nVilla Clara, Matanzas, and Havana\n* Andros Island, Bimini and Grand Bahama\n\nA Hurricane Watch is in effect for...\n* North of Fernandina Beach to Edisto Beach\n* West of the Aucilla River to Indian Pass\n* Cuban provinces of Holguin and Las Tunas\n\nA Tropical Storm Warning is in effect for...\n* Cuban provinces of Holguin, Las Tunas\n\nA Tropical Storm Watch is in effect for...\n* North of Edisto Beach to South Santee River\n* West of Indian Pass to the Okaloosa/Walton County Line\n\nA Storm Surge Warning means there is a danger of life-threatening\ninundation, from rising water moving inland from the coastline,\nduring the next 36 hours in the indicated locations. For a\ndepiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.  This is a life-threatening situation.  Persons\nlocated within these areas should take all necessary actions to\nprotect life and property from rising water and the potential for\nother dangerous conditions.  Promptly follow evacuation and other\ninstructions from local officials.\n\nA Storm Surge Watch means there is a possibility of life-\nthreatening inundation, from rising water moving inland from the\ncoastline, in the indicated locations during the next 48 hours.\nFor a depiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area.  Preparations to protect life and\nproperty should be rushed to completion.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours\nbefore the anticipated first occurrence of tropical-storm-force\nwinds, conditions that make outside preparations difficult or\ndangerous.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, generally within 48 hours.\n\nInterests elsewhere in Cuba and the southeastern United States\nshould monitor the progress of Irma.\n\nFor storm information specific to your area in the United\nStates, including possible inland watches and warnings, please\nmonitor products issued by your local National Weather Service\nforecast office. For storm information specific to your area outside\nthe United States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 1100 AM EDT (1500 UTC), the eye of Hurricane Irma was\nlocated by a reconnaissance plane and radar near latitude 22.8\nNorth, longitude 79.8 West. Irma is moving toward the west along\nthe north coast of Cuba at near 9 mph (15 km/h).  A northwest motion\nis expected to begin later today with a turn toward the north-\nnorthwest on Sunday.  On the forecast track, the core of Irma will\ncontinue to move near or over the north coast of Cuba later today,\nand will reach the Florida Keys Sunday morning.  The hurricane is\nexpected to move along or near the southwest coast of Florida Sunday\nafternoon.\n\nMaximum sustained winds are near 125 mph (205 km/h) with higher\ngusts.  Irma is a category 3 hurricane on the Saffir-Simpson\nHurricane Wind Scale.  Irma is forecast to restrengthen once it\nmoves away from Cuba, and Irma is expected to remain a powerful\nhurricane as it approaches Florida.\n\nHurricane-force winds extend outward up to 70 miles (110 km) from\nthe center and tropical-storm-force winds extend outward up to 195\nmiles (315 km).  Caibarien, Cuba recently reported a wind gust to\n124 mph (200 km/h).\n\nThe minimum central pressure reported by an Air Force plane was 941\nmb (27.79 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following HEIGHTS ABOVE GROUND if the peak\nsurge occurs at the time of high tide...\n\nCape Sable to Captiva...10 to 15 ft\nCaptiva to Ana Maria Island...6 to 10 ft\nCard Sound Bridge through Cape Sable, including the Florida\nKeys...5 to 10 ft\nAna Maria Island to Clearwater Beach, including Tampa Bay...5 to 8\nft\nNorth Miami Beach to Card Sound Bridge, including Biscayne Bay...4\nto 6 ft\nIsle of Palms, South Carolina to Fernandina Beach...4 to 6 ft\nClearwater Beach to Ochlockonee River...4 to 6 ft\nFernandina Beach to North Miami Beach...2 to 4 ft\n\nThe deepest water will occur along the immediate coast in areas of\nonshore winds, where the surge will be accompanied by large and\ndestructive waves.  Surge-related flooding depends on the relative\ntiming of the surge and the tidal cycle, and can vary greatly over\nshort distances.  For information specific to your area, please see\nproducts issued by your local National Weather Service forecast\noffice.\n\nThe combination of a life-threatening storm surge and large breaking\nwaves will raise water levels ABOVE NORMAL TIDE LEVELS by the\nfollowing amounts within the hurricane warning area near and to the\nnorth of the center of Irma.  Near the coast, the surge will be\naccompanied by large and destructive waves.\n\nRagged Island in the Bahamas...15 to 20 ft\nCentral and Northwestern Bahamas...3 to 6 ft\nNorthern coast of Cuba in the warning area...5 to 10 ft\n\nWIND:   Hurricane conditions are expected to continue within the\nhurricane warning area along the north coast of Cuba through today.\nHurricane conditions are expected in portions of the northwestern\nBahamas today, and in portions of the Florida peninsula and the\nFlorida Keys tonight and Sunday.\n\nHurricane and tropical storm conditions are possible within the\nwatch area on Sunday.\n\nRAINFALL: Irma is expected to produce the following rain\naccumulations through Wednesday:\nNorthern Cuba...10 to 15 inches, isolated 20 inches.\nSouthern Cuba...5 to 10 inches, isolated 15 inches.\nWestern Bahamas...3 to 6 inches, isolated 10 inches.\nThe Florida Keys...10 to 20 inches, isolated 25 inches.\nThe Florida peninsula and southeast Georgia...8 to 15 inches,\nisolated 20 inches.\nThe eastern Florida Panhandle...3 to 6 inches, isolated 8 inches.\nRest of eastern Georgia, western South Carolina, and western North\nCarolina...4 to 8 inches.\nWestern Georgia, eastern and northern Alabama, and southern\nTennessee...2 to 5 inches.\nIn all areas this rainfall may cause life-threatening flash floods\nand, in some areas, mudslides.\n\nTORNADOES:  A few tornadoes are possible today and tonight over\nsouthern Florida.\n\nSURF:  Swells generated by Irma are affecting the southeastern\nBahamas, the Turks and Caicos Islands and the southeast coast of the\nUnited States today.  These swells are likely to cause\nlife-threatening surf and rip current conditions.  Please consult\nproducts from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 200 PM EDT.\nNext complete advisory at 500 PM EDT.\n\n$$\nForecaster Avila\n\nNNNN",
    "messageBinNumber": "1",
    "messageDateTimeLocal": "20170909 11:00:00 AM EDT",
    "messageDateTimeLocalStr": "1100 AM EDT Sat Sep 09",
    "messageDateTimeUTC": "20170909 03:00:00 PM UTC",
    "messageDateTimeUTC24": "201709091500",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "W OR 280 DEGREES",
    "systemGeoRefPt1": "ABOUT 90 MI...145 KM ESE OF VARADERO CUBA",
    "systemGeoRefPt2": "ABOUT 175 MI...285 KM SE OF KEY WEST FLORIDA",
    "systemIntensityKph": "205",
    "systemIntensityKts": "110",
    "systemIntensityMph": "125",
    "systemMslpInHg": "27.79",
    "systemMslpMb": "941",
    "systemName": "IRMA",
    "systemSaffirSimpsonCategory": "CATEGORY 3",
    "systemSpeedKph": "15",
    "systemSpeedKts": "8",
    "systemSpeedMph": "9",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1504969200"
  }
}
