{
  "cycloneMessage": {
    "advisoryNumber": "25",
    "atcfID": "AL112017",
    "centerLocLatitude": "16.7",
    "centerLocLatitudeExpanded": "16.7N",
    "centerLocLongitude": "-57.7",
    "centerLocLongitudeExpanded": "57.7W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT1 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Irma Special Advisory Number  25\nNWS National Hurricane Center Miami FL       AL112017\n800 AM AST Tue Sep 05 2017\n\n...IRMA BECOMES AN EXTREMELY DANGEROUS CATEGORY 5 HURRICANE...\n...PREPARATIONS SHOULD BE RUSHED TO COMPLETION IN THE HURRICANE\nWARNING AREA...\n\n\nSUMMARY OF 800 AM AST...1200 UTC...INFORMATION\n----------------------------------------------\nLOCATION...16.7N 57.7W\nABOUT 270 MI...440 KM E OF ANTIGUA\nABOUT 280 MI...445 KM ESE OF BARBUDA\nMAXIMUM SUSTAINED WINDS...175 MPH...280 KM/H\nPRESENT MOVEMENT...W OR 280 DEGREES AT 14 MPH...22 KM/H\nMINIMUM CENTRAL PRESSURE...929 MB...27.44 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe government of the Dominican Republic has issued a Hurricane\nWatch from Cabo Engano to the northern border with Haiti and a\nTropical Storm Watch from south of Cabo Engao to Isla Saona.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Warning is in effect for...\n* Antigua, Barbuda, Anguilla, Montserrat, St. Kitts, and Nevis\n* Saba, St. Eustatius, and Sint Maarten\n* Saint Martin and Saint Barthelemy\n* British Virgin Islands\n* U.S. Virgin Islands\n* Puerto Rico, Vieques, and Culebra\n\nA Hurricane Watch is in effect for...\n* Guadeloupe\n* Dominican Republic from Cabo Engano to the northern border with\nHaiti\n\nA Tropical Storm Warning is in effect for...\n* Guadeloupe\n* Dominica\n\nA Tropical Storm Watch is in effect for...\n* Dominican Republic from south of Cabo Engao to Isla Saona\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area. A warning is typically issued\n36 hours before the anticipated first occurrence of tropical-storm-\nforce winds, conditions that make outside preparations difficult or\ndangerous. In this case, for some of easternmost islands, the\nhurricane conditions are expected within the next 24 hours.\nPreparations to protect life and property should be rushed to\ncompletion.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area in this case within 36\nhours.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, generally within 48 hours.\n\nInterests elsewhere in the Dominican Republic, along with Haiti,\nthe Turks and Caicos Islands, Cuba, and the southeastern and central\nBahamas should monitor the progress of Irma.\n\nFor storm information specific to your area in the United\nStates, including possible inland watches and warnings, please\nmonitor products issued by your local National Weather Service\nforecast office. For storm information specific to your area outside\nthe United States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 800 AM AST (1200 UTC), the distinct eye center of Hurricane Irma\nwas located near latitude 16.7 North, longitude 57.7 West. Irma is\nmoving toward the west near 14 mph (22 km/h), and this general\nmotion is expected to continue today, followed by a turn toward the\nwest-northwest tonight. On the forecast track, the dangerous core of\nIrma will move near or over portions of the northern Leeward Islands\ntonight and early Wednesday.\n\nReports from NOAA and U.S. Air Force Hurricane Hunter aircraft\nindicate Irma continues to strengthen and maximum sustained winds\nhave increased to near 175 mph (280 km/h) with higher gusts.  Irma\nis an extremely dangerous category 5 hurricane on the Saffir-Simpson\nHurricane Wind Scale.  Some fluctuations in intensity are likely\nduring the next day or two, but Irma is forecast to remain a\npowerful category 4 or 5 hurricane during the next couple of days.\n\nHurricane-force winds extend outward up to 45 miles (75 km) from the\ncenter and tropical-storm-force winds extend outward up to 140 miles\n(220 km).\n\nThe latest estimated minimum central pressure from aircraft data is\n929 mb (27.44 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nSTORM SURGE:  The combination of a dangerous storm surge and large\nbreaking waves will raise water levels by as much as 7 to 11 feet\nabove normal tide levels along the coasts of the extreme northern\nLeeward Islands within the hurricane warning area near and to the\nnorth of the center of Irma.  Near the coast, the surge will be\naccompanied by large and destructive waves.\n\nThe combination of a dangerous storm surge and the tide will cause\nnormally dry areas near the coast to be flooded by rising waters\nmoving inland from the shoreline.  The water is expected to reach\nthe following heights above ground if the peak surge occurs at the\ntime of high tide...\n\nBritish and U.S. Virgin Islands except St. Croix...7 to 11 ft\nNorthern coast of Puerto Rico...2 to 4 ft\nSouthern coast of Puerto Rico and St. Croix...1 to 2 ft\n\nThe deepest water will occur along the immediate coast in areas of\nonshore winds, where the surge will be accompanied by large and\ndestructive waves.  Surge-related flooding depends on the relative\ntiming of the surge and the tidal cycle, and can vary greatly over\nshort distances.  For information specific to your area, please see\nproducts issued by your local National Weather Service forecast\noffice.\n\nWIND:  Hurricane conditions are expected within the hurricane\nwarning area in the Leeward Islands by tonight, with tropical storm\nconditions beginning later today. Tropical storm conditions are\nexpected within the tropical storm warning area where hurricane\nconditions are also possible. Hurricane conditions are expected\nto begin within the hurricane warning area in the British and U.S.\nVirgin Islands and Puerto Rico on Wednesday, with tropical storm\nconditions beginning tonight. Hurricane and tropical storm\nconditions are possible within the watch area in the Dominican\nRepublic by early Thursday.\n\nRAINFALL:  Irma is expected to produce total rainfall accumulations\nof 4 to 8 inches with isolated maximum amounts of 12 inches across\nthe northern Leeward Islands, the British and U.S. Virgin Islands,\nand Puerto Rico.  These rainfall amounts may cause life-threatening\nflash floods and mudslides.\n\nSURF:  Swells generated by Irma will affect the northern Leeward\nIslands, Puerto Rico, and the U.S. and British Virgin Islands\nduring the next several days.  These swells are likely to cause\nlife-threatening surf and rip current conditions. Please consult\nproducts from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 800 AM AST.\nNext complete advisory at 1100 AM AST.\n\n$$\nForecaster Brown\n\nNNNN",
    "messageBinNumber": "1",
    "messageDateTimeLocal": "20170905 08:00:00 AM AST",
    "messageDateTimeLocalStr": "0800 AM AST Tue Sep 05",
    "messageDateTimeUTC": "20170905 12:00:00 PM UTC",
    "messageDateTimeUTC24": "201709051200",
    "messageType": "SPECIAL ADVISORY",
    "systemDirectionOfMotion": "W OR 280 DEGREES",
    "systemGeoRefPt1": "ABOUT 270 MI...440 KM E OF ANTIGUA",
    "systemGeoRefPt2": "ABOUT 280 MI...445 KM ESE OF BARBUDA",
    "systemIntensityKph": "280",
    "systemIntensityKts": "150",
    "systemIntensityMph": "175",
    "systemMslpInHg": "27.44",
    "systemMslpMb": "929",
    "systemName": "IRMA",
    "systemSaffirSimpsonCategory": "CATEGORY 5",
    "systemSpeedKph": "22",
    "systemSpeedKts": "12",
    "systemSpeedMph": "14",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1504612800"
  }
}
