{
  "cycloneMessage": {
    "advisoryNumber": "34",
    "atcfID": "AL112017",
    "centerLocLatitude": "20.4",
    "centerLocLatitudeExpanded": "20.4N",
    "centerLocLongitude": "-69.7",
    "centerLocLongitudeExpanded": "69.7W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT1 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Irma Advisory Number  34\nNWS National Hurricane Center Miami FL       AL112017\n1100 AM AST Thu Sep 07 2017\n\n...EXTREMELY DANGEROUS HURRICANE IRMA HEADING FOR THE TURKS AND\nCAICOS ISLANDS...\n...HURRICANE AND STORM SURGE WATCH ARE IN EFFECT FOR PORTIONS OF\nSOUTH FLORIDA AND THE FLORIDA KEYS...\n\n\nSUMMARY OF 1100 AM AST...1500 UTC...INFORMATION\n-----------------------------------------------\nLOCATION...20.4N 69.7W\nABOUT 75 MI...125 KM ENE OF PUERTO PLATA DOMINICAN REPUBLIC\nABOUT 120 MI...190 KM SE OF GRAND TURK ISLAND\nMAXIMUM SUSTAINED WINDS...175 MPH...280 KM/H\nPRESENT MOVEMENT...WNW OR 290 DEGREES AT 16 MPH...26 KM/H\nMINIMUM CENTRAL PRESSURE...921 MB...27.20 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nA Storm Surge Watch has been issued for the Florida peninsula from\nJupiter Inlet southward and around the peninsula to Bonita Beach,\nincluding the Florida Keys.\n\nA Hurricane Watch has been issued for the Florida peninsula from\nJupiter Inlet southward and around the peninsula to Bonita Beach,\nincluding the Florida Keys, Lake Okeechobee, and Florida Bay.\n\nThe government of Cuba has extended the Tropical Storm Warning to\nVilla Clara province.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Watch is in effect for...\n* Jupiter Inlet southward around the Florida peninsula to Bonita\nBeach\n* Florida Keys\n\nA Hurricane Warning is in effect for...\n* Dominican Republic from Cabo Engano to the northern border with\nHaiti\n* Haiti from the northern border with the Dominican Republic to Le\nMole St. Nicholas\n* Southeastern Bahamas and the Turks and Caicos Islands\n* Central Bahamas\n* Northwestern Bahamas\n\nA Hurricane Watch is in effect for...\n* Jupiter Inlet southward around the Florida peninsula to Bonita\nBeach\n* Florida Keys\n* Lake Okeechobee\n* Florida Bay\n* Cuba from Matanzas province eastward to Guantanamo province\n\nA Tropical Storm Warning is in effect for...\n* Dominican Republic from south of Cabo Engano westward to the\nsouthern border with Haiti\n* Haiti from south of Le Mole St. Nicholas to Port-Au-Prince\n* Cuba provinces of Guantanamo, Holguin, Las Tunas, Camaguey, Ciego\nde Avila, Sancti Spiritus and Villa Clara.\n\nA Storm Surge Watch means there is a possibility of life-\nthreatening inundation, from rising water moving inland from the\ncoastline, in the indicated locations during the next 48 hours.\nFor a depiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area.  Preparations to protect life and\nproperty should be rushed to completion.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours\nbefore the anticipated first occurrence of tropical-storm-force\nwinds, conditions that make outside preparations difficult or\ndangerous.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area.\n\nInterests elsewhere in the Dominican Republic and Haiti, as well as\nCuba and Florida should monitor the progress of Irma.\n\nFor storm information specific to your area in the United\nStates, including possible inland watches and warnings, please\nmonitor products issued by your local National Weather Service\nforecast office. For storm information specific to your area outside\nthe United States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 1100 AM AST (1500 UTC), the distinct eye of Hurricane Irma was\nlocated near latitude 20.4 North, longitude 69.7 West. Irma is\nmoving toward the west-northwest near 16 mph (26 km/h), and this\ngeneral motion is expected to continue with some decrease in forward\nspeed for the next couple of days.  On the forecast track, the eye\nof Irma should continue to move just north of the coast of\nHispaniola today, be near the Turks and Caicos and southeastern\nBahamas by this evening, and then be near the central Bahamas by\nFriday.\n\nMaximum sustained winds are near 175 mph (280 km/h) with higher\ngusts.  Irma is a category 5 hurricane on the Saffir-Simpson\nHurricane Wind Scale.  Some fluctuations in intensity are likely\nduring the next day or two, but Irma is forecast to remain a\npowerful category 4 or 5 hurricane during the next couple of\ndays.\n\nHurricane-force winds extend outward up to 60 miles (95 km) from the\ncenter and tropical-storm-force winds extend outward up to 185 miles\n(295 km).\n\nThe minimum central pressure reported by an Air Force plane was 921\nmb (27.20 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following HEIGHTS ABOVE GROUND if the peak\nsurge occurs at the time of high tide...\n\nJupiter Inlet to Bonita Beach, including Florida Keys...5 to 10 ft\n\nThe deepest water will occur along the immediate coast in areas of\nonshore winds, where the surge will be accompanied by large and\ndestructive waves.  Surge-related flooding depends on the relative\ntiming of the surge and the tidal cycle, and can vary greatly over\nshort distances.  For information specific to your area, please see\nproducts issued by your local National Weather Service forecast\noffice.\n\nThe combination of a life-threatening storm surge and large breaking\nwaves will raise water levels ABOVE NORMAL TIDE LEVELS by the\nfollowing amounts within the hurricane warning area near and to the\nnorth of the center of Irma.  Near the coast, the surge will be\naccompanied by large and destructive waves.\n\nTurks and Caicos Islands...15 to 20 ft\nSoutheastern and central Bahamas...15 to 20 ft\nNorthwestern Bahamas...5 to 10 ft\nNorthern coast of the Dominican Republic...3 to 5 ft\nNorthern coast of Haiti and the Gulf of Gonave...1 to 3 ft\nNorthern coast of Cuba in the warning area...5 to 10 ft\n\nWater levels around Puerto Rico should subside today.\n\nWIND:  Hurricane conditions are expected to begin within the\nhurricane warning area in the Dominican Republic and Haiti today.\nHurricane conditions are expected to begin in the southeastern\nBahamas and the Turks and Caicos Islands later today with tropical\nstorm conditions expected within the next several hours.  These\nconditions will spread into the central Bahamas by tonight or early\nFriday.\n\nHurricane and tropical storm conditions are possible within the\nwatch area in Cuba by Friday.  Tropical storm conditions are\nexpected to begin within the warning area in Cuba tonight.\nHurricane conditions are expected in the northwestern Bahamas Friday\nnight and Saturday.\n\nRAINFALL: Irma is expected to produce the following rain\naccumulations through Saturday evening:\n\nNortheast Puerto Rico and the British and U.S. Virgin Islands...\nadditional 2 to 4 inches, isolated 6 inches\nMuch of the Bahamas and Turks and Caicos...8 to 12 inches, isolated\n20 inches\nAndros Island and Bimini, Bahamas...12 to 16 inches, isolated 25\ninches\nNorthern Dominican Republic and northern Haiti...4 to 10 inches,\nisolated 15 inches\nSouthern Dominican Republic and southern Haiti...2 to 5 inches\nEastern and central Cuba...4 to 10 inches, isolated 15 inches\nSoutheast Florida and the upper Florida Keys...8 to 12 inches,\nisolated 20 inches\nLower Florida Keys...2 to 5 inches\n\nIn all areas this rainfall may cause life-threatening flash floods\nand mudslides.\n\nSURF:  Swells generated by Irma are affecting the northern Leeward\nIslands, Puerto Rico, the Virgin Islands, the southeastern Bahamas,\nthe Turks and Caicos Islands, the northern coast of the Dominican\nRepublic, and should start affecting portions of the southeast\ncoast of the United States later today and tonight.  These swells\nare likely to cause life-threatening surf and rip current\nconditions.  Please consult products from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 200 PM AST.\nNext complete advisory at 500 PM AST.\n\n$$\nForecaster Avila\n\nNNNN",
    "messageBinNumber": "1",
    "messageDateTimeLocal": "20170907 11:00:00 AM AST",
    "messageDateTimeLocalStr": "1100 AM AST Thu Sep 07",
    "messageDateTimeUTC": "20170907 03:00:00 PM UTC",
    "messageDateTimeUTC24": "201709071500",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "WNW OR 290 DEGREES",
    "systemGeoRefPt1": "ABOUT 75 MI...125 KM ENE OF PUERTO PLATA DOMINICAN REPUBLIC",
    "systemGeoRefPt2": "ABOUT 120 MI...190 KM SE OF GRAND TURK ISLAND",
    "systemIntensityKph": "280",
    "systemIntensityKts": "150",
    "systemIntensityMph": "175",
    "systemMslpInHg": "27.20",
    "systemMslpMb": "921",
    "systemName": "IRMA",
    "systemSaffirSimpsonCategory": "CATEGORY 5",
    "systemSpeedKph": "26",
    "systemSpeedKts": "14",
    "systemSpeedMph": "16",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1504796400"
  }
}
