{
  "cycloneMessage": {
    "advisoryNumber": "45",
    "atcfID": "AL112017",
    "centerLocLatitude": "24.1",
    "centerLocLatitudeExpanded": "24.1N",
    "centerLocLongitude": "-81.5",
    "centerLocLongitudeExpanded": "81.5W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT1 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Irma Advisory Number  45\nNWS National Hurricane Center Miami FL       AL112017\n500 AM EDT Sun Sep 10 2017\n\n...EYE OF IRMA ABOUT TO MOVE ACROSS THE LOWER FLORIDA KEYS...\n\n\nSUMMARY OF 500 AM EDT...0900 UTC...INFORMATION\n----------------------------------------------\nLOCATION...24.1N 81.5W\nABOUT 40 MI...65 KM SSE OF KEY WEST FLORIDA\nABOUT 140 MI...225 KM S OF NAPLES FLORIDA\nMAXIMUM SUSTAINED WINDS...130 MPH...215 KM/H\nPRESENT MOVEMENT...NW OR 325 DEGREES AT 8 MPH...13 KM/H\nMINIMUM CENTRAL PRESSURE...928 MB...27.41 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe Government of the Bahamas has replaced the Hurricane Warning\nfor the Northwestern Bahamas with a Tropical Storm Watch for the\nNorthwestern Bahamas islands of Bimini and Grand Bahama.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Warning is in effect for...\n* South Santee River southward to Jupiter Inlet\n* North Miami Beach southward around the Florida peninsula to the\nOchlockonee River\n* Florida Keys\n* Tampa Bay\n\nA Hurricane Warning is in effect for...\n* Fernandina Beach southward around the Florida peninsula to Indian\nPass\n* Florida Keys\n* Lake Okeechobee\n* Florida Bay\n* Cuban provinces of Ciego de Avila, Sancti Spiritus, Villa Clara,\nMatanzas, and La Habana\n\nA Hurricane Watch is in effect for...\n* North of Fernandina Beach to Edisto Beach\n\nA Tropical Storm Warning is in effect for...\n* West of Indian Pass to the Okaloosa/Walton County Line\n* North of Fernandina Beach to South Santee River\n\nA Tropical Storm Watch is in effect for...\n* Bimini and Grand Bahama\n\nA Storm Surge Warning means there is a danger of life-threatening\ninundation, from rising water moving inland from the coastline,\nduring the next 36 hours in the indicated locations. For a\ndepiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.  This is a life-threatening situation.  Persons\nlocated within these areas should take all necessary actions to\nprotect life and property from rising water and the potential for\nother dangerous conditions.  Promptly follow evacuation and other\ninstructions from local officials.\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area.  Preparations to protect life and\nproperty should be rushed to completion.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours\nbefore the anticipated first occurrence of tropical-storm-force\nwinds, conditions that make outside preparations difficult or\ndangerous.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, generally within 48 hours.\n\nInterests elsewhere in Cuba and the southeastern United States\nshould monitor the progress of Irma.\n\nFor storm information specific to your area in the United\nStates, including possible inland watches and warnings, please\nmonitor products issued by your local National Weather Service\nforecast office. For storm information specific to your area outside\nthe United States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 500 AM EDT (0900 UTC), the center of Hurricane Irma was located\nnear latitude 24.1 North, longitude 81.5 West. Irma is moving toward\nthe northwest near 8 mph (13 km/h).  A turn toward the north-\nnorthwest and an increase in forward speed are expected later today,\nwith that motion continuing through Monday.  On the forecast track,\nthe eye of Irma should move over the Lower Florida Keys in the next\nfew hours, then move near or over the southwestern coast of the\nFlorida Peninsula later today through tonight.  Irma should then\nmove inland over the Florida panhandle and southwestern Georgia\nMonday afternoon.\n\nMaximum sustained winds are near 130 mph (215 km/h) with higher\ngusts.  Irma is a category 4 hurricane on the Saffir-Simpson\nHurricane Wind Scale.  While weakening is forecast, Irma is\nexpected to remain a powerful hurricane as it moves through the\nFlorida Keys and and near the west coast of Florida.\n\nHurricane-force winds extend outward up to 80 miles (130 km) from\nthe center and tropical-storm-force winds extend outward up to 220\nmiles (350 km).  The National Ocean Service station at Vaca Key\nFlorida recently reported sustained winds of 48 mph (78 km/h) and a\ngust of 78 mph (126 km/h).  A private anemometer at Alligator Reef\nLight, Florida recently reported a wind gust of 88 mph (141 km/h).\n\nThe latest minimum central pressure reported by an Air Force\nReserve Hurricane Hunter aircraft is 928 mb (27.41 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following HEIGHTS ABOVE GROUND if the peak\nsurge occurs at the time of high tide...\n\nCape Sable to Captiva...10 to 15 ft\nCaptiva to Ana Maria Island...6 to 10 ft\nCard Sound Bridge through Cape Sable, including the Florida Keys...\n5 to 10 ft\nAna Maria Island to Clearwater Beach, including Tampa Bay...\n5 to 8 ft\nNorth Miami Beach to Card Sound Bridge, including Biscayne Bay...\n3 to 5 ft\nSouth Santee River to Fernandina Beach...4 to 6 ft\nClearwater Beach to Ochlockonee River...4 to 6 ft\nFernandina Beach to Jupiter Inlet...2 to 4 ft\nNorth of North Miami Beach to Jupiter Inlet...1 to 2 ft\n\nThe deepest water will occur along the immediate coast in areas of\nonshore winds, where the surge will be accompanied by large and\ndestructive waves.  Surge-related flooding depends on the relative\ntiming of the surge and the tidal cycle, and can vary greatly over\nshort distances.  For information specific to your area, please see\nproducts issued by your local National Weather Service forecast\noffice.\n\nThe combination of a life-threatening storm surge and large breaking\nwaves will raise water levels ABOVE NORMAL TIDE LEVELS by the\nfollowing amounts within the hurricane warning area near and to the\nnorth of the center of Irma.  Near the coast, the surge will be\naccompanied by large and destructive waves.\n\nNorthern coast of Cuba in the warning area...5 to 10 ft\n\nWIND:  Hurricane conditions are expected to continue within the\nhurricane warning area along the north coast of Cuba through\nthis morning.  Hurricane conditions are spreading across portions of\nthe Florida Keys, and should spread northward over the remainder of\nthe Keys and the southern Florida peninsula during the next several\nhours.  Tropical storm and hurricane conditions are expected to\nspread northward across the remainder of the warning areas through\nMonday.  Tropical storm conditions are possible in the watch area in\nthe Northwestern Bahamas today.\n\nRAINFALL:  Irma is expected to produce the following rain\naccumulations through Wednesday:\n\nWestern Cuba...Additional 3 to 6 inches, isolated 10 inches.\nWestern Bahamas...Additional 2 to 4 inches, isolated 6 inches.\nThe Florida Keys...15 to 20 inches, isolated 25 inches.\nThe southern Florida peninsula...10 to 15 inches, isolated 20\ninches.\nThe remainder of the Florida peninsula and southeast Georgia...8 to\n12 inches, isolated 16 inches.\nThe rest of Georgia, eastern Florida Panhandle, southern and western\nSouth Carolina, and western North Carolina...3 to 6 inches, isolated\n10 inches.\nEastern Alabama and southern Tennessee...2 to 5 inches.\n\nIn all areas this rainfall may cause life-threatening flash floods\nand, in some areas, mudslides.\n\nTORNADOES:  Tornadoes are possible through tonight, mainly across\nsouthern, central, and eastern portions of the Florida Peninsula.\n\nTHE EYE: Do not venture outside when the calm eye of the hurricane\npasses over, as dangerous winds will return very quickly when the\neye moves away.\n\nSURF:  Swells generated by Irma are affecting the southeast coast of\nthe United States.  These swells are likely to cause life-\nthreatening surf and rip current conditions.  Please consult\nproducts from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 800 AM EDT.\nNext complete advisory at 1100 AM EDT.\n\n$$\nForecaster Beven\n\nNNNN",
    "messageBinNumber": "1",
    "messageDateTimeLocal": "20170910 05:00:00 AM EDT",
    "messageDateTimeLocalStr": "0500 AM EDT Sun Sep 10",
    "messageDateTimeUTC": "20170910 09:00:00 AM UTC",
    "messageDateTimeUTC24": "201709100900",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "NW OR 325 DEGREES",
    "systemGeoRefPt1": "ABOUT 40 MI...65 KM SSE OF KEY WEST FLORIDA",
    "systemGeoRefPt2": "ABOUT 140 MI...225 KM S OF NAPLES FLORIDA",
    "systemIntensityKph": "215",
    "systemIntensityKts": "115",
    "systemIntensityMph": "130",
    "systemMslpInHg": "27.41",
    "systemMslpMb": "928",
    "systemName": "IRMA",
    "systemSaffirSimpsonCategory": "CATEGORY 4",
    "systemSpeedKph": "13",
    "systemSpeedKts": "7",
    "systemSpeedMph": "8",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1505034000"
  }
}
