{
  "cycloneMessage": {
    "advisoryNumber": "46",
    "atcfID": "AL112017",
    "centerLocLatitude": "25.0",
    "centerLocLatitudeExpanded": "25.0N",
    "centerLocLongitude": "-81.5",
    "centerLocLongitudeExpanded": "81.5W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT1 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Irma Advisory Number  46\nNWS National Hurricane Center Miami FL       AL112017\n1100 AM EDT Sun Sep 10 2017\n\n...IRMA HEADED FOR THE SOUTHWEST FLORIDA COAST...\n...WINDS CONTINUE TO INCREASE OVER SOUTH FLORIDA...\n\n\nSUMMARY OF 1100 AM EDT...1500 UTC...INFORMATION\n-----------------------------------------------\nLOCATION...25.0N 81.5W\nABOUT 80 MI...125 KM SSE OF NAPLES FLORIDA\nABOUT 115 MI...180 KM SSE OF FT. MYERS FLORIDA\nMAXIMUM SUSTAINED WINDS...130 MPH...215 KM/H\nPRESENT MOVEMENT...N OR 350 DEGREES AT 9 MPH...15 KM/H\nMINIMUM CENTRAL PRESSURE...933 MB...27.55 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Warning is in effect for...\n* South Santee River southward to Jupiter Inlet\n* North Miami Beach southward around the Florida peninsula to the\nOchlockonee River\n* Florida Keys\n* Tampa Bay\n\nA Hurricane Warning is in effect for...\n* Fernandina Beach southward around the Florida peninsula to Indian\nPass\n* Florida Keys\n* Lake Okeechobee\n* Florida Bay\n* Cuban provinces of Matanzas and La Habana\n\nA Hurricane Watch is in effect for...\n* North of Fernandina Beach to Edisto Beach\n\nA Tropical Storm Warning is in effect for...\n* West of Indian Pass to the Okaloosa/Walton County Line\n* North of Fernandina Beach to South Santee River\n\nA Tropical Storm Watch is in effect for...\n* Bimini and Grand Bahama\n\nA Storm Surge Warning means there is a danger of life-threatening\ninundation, from rising water moving inland from the coastline,\nduring the next 36 hours in the indicated locations. For a\ndepiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.  This is a life-threatening situation.  Persons\nlocated within these areas should take all necessary actions to\nprotect life and property from rising water and the potential for\nother dangerous conditions.  Promptly follow evacuation and other\ninstructions from local officials.\n\nInterests elsewhere in the southeastern United States should monitor\nthe progress of Irma.\n\nFor storm information specific to your area in the United\nStates, including possible inland watches and warnings, please\nmonitor products issued by your local National Weather Service\nforecast office. For storm information specific to your area outside\nthe United States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 1100 AM EDT (1500 UTC), the center of Hurricane Irma was located\nnear latitude 25.0 North, longitude 81.5 West. Irma is moving toward\nthe north near 9 mph (15 km/h, and a north-northwestward motion with\nan increase in forward speed is expected later today, with that\nmotion continuing through Monday.  On the forecast track, the eye of\nIrma should move over the Lower Florida Keys shortly, and then move\nnear or over the west coast of the Florida Peninsula later today\nthrough tonight.  Irma should then move inland over northern Florida\nand southwestern Georgia Monday afternoon.\n\nMaximum sustained winds are near 130 mph (215 km/h) with higher\ngusts.  Irma is a category 4 hurricane on the Saffir-Simpson\nHurricane Wind Scale.  While weakening is forecast, Irma is expected\nto remain a powerful hurricane while it moves near or along the west\ncoast of Florida.\n\nHurricane-force winds extend outward up to 80 miles (130 km) from\nthe center and tropical-storm-force winds extend outward up to 220\nmiles (350 km).  A 120 mph (193 km/h) gust was recently reported at\nthe National Key Deer Refuge in Big Pine Key.  A sustained wind of\n62 mph (100 km/h) with a gust of 94 mph (151 km/h) was reported at\nthe Federal Aviation Administration station at Miami International\nAirport.  A pressure of 940 mb (27.75 inches) was measured in the\ncalm of the eye on Upper Sugarloaf Key.\n\nThe minimum central pressure reported by an Air Force Hurricane\nHunter aircraft is 933 mb (27.55 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following HEIGHTS ABOVE GROUND if the peak\nsurge occurs at the time of high tide...\n\nCape Sable to Captiva...10 to 15 ft\nCaptiva to Ana Maria Island...6 to 10 ft\nCard Sound Bridge through Cape Sable, including the Florida Keys...\n5 to 10 ft\nAna Maria Island to Clearwater Beach, including Tampa Bay...\n5 to 8 ft\nNorth Miami Beach to Card Sound Bridge, including Biscayne Bay...\n3 to 5 ft\nSouth Santee River to Fernandina Beach...4 to 6 ft\nClearwater Beach to Ochlockonee River...4 to 6 ft\nFernandina Beach to Jupiter Inlet...2 to 4 ft\nNorth of North Miami Beach to Jupiter Inlet...1 to 2 ft\n\nThe deepest water will occur along the immediate coast in areas of\nonshore winds, where the surge will be accompanied by large and\ndestructive waves.  Surge-related flooding depends on the relative\ntiming of the surge and the tidal cycle, and can vary greatly over\nshort distances.  For information specific to your area, please see\nproducts issued by your local National Weather Service forecast\noffice.\n\nThe combination of a life-threatening storm surge and large breaking\nwaves will raise water levels ABOVE NORMAL TIDE LEVELS by the\nfollowing amounts within the hurricane warning area near and to the\nnorth of the center of Irma.  Near the coast, the surge will be\naccompanied by large and destructive waves.\n\nWater levels along the north coast of Cuba will gradually subside\ntoday.\n\nWIND:  Hurricane conditions are expected to continue within the\nhurricane warning area along the north coast of Cuba through\nthis morning.  Hurricane conditions are continuing across portions\nof the Florida Keys and southern Florida.  Winds affecting the upper\nfloors of high-rise buildings will be significantly stronger than\nthose near ground level.  Tropical storm and hurricane conditions\nare expected to spread northward across the remainder of the warning\nareas through Monday.  Tropical storm conditions are possible in the\nwatch area in the Northwestern Bahamas today.\n\nRAINFALL:  Irma is expected to produce the following rain\naccumulations through Wednesday:\n\nWestern Cuba...Additional 1 to 3 inches, isolated 5 inches.\nWestern Bahamas...Additional 2 to 4 inches, isolated 6 inches.\nThe Florida Keys...15 to 20 inches, isolated 25 inches.\nWestern Florida peninsula...10 to 15 inches, isolated 20 inches.\nEastern Florida peninsula and southeast Georgia...8 to 12 inches,\nisolated 16 inches.\nThe rest of Georgia, the eastern Florida Panhandle, southern and\nwestern\nSouth Carolina, and western North Carolina...3 to 8 inches, isolated\n12 inches.\nEastern Alabama and southern Tennessee...2 to 5 inches.\n\nIn all areas this rainfall may cause life-threatening flash floods\nand, in some areas, mudslides.\n\nTORNADOES:  Tornadoes are possible through tonight, mainly across\nsouthern, central, and eastern portions of the Florida Peninsula.\n\nTHE EYE: Do not venture outside when the calm eye of the hurricane\npasses over, as dangerous winds will return very quickly when the\neye moves away.\n\nSURF:  Swells generated by Irma are affecting the southeast coast of\nthe United States.  These swells are likely to cause life-\nthreatening surf and rip current conditions.  Please consult\nproducts from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 200 PM EDT.\nNext complete advisory at 500 PM EDT.\n\n$$\nForecaster Pasch\n\nNNNN",
    "messageBinNumber": "1",
    "messageDateTimeLocal": "20170910 11:00:00 AM EDT",
    "messageDateTimeLocalStr": "1100 AM EDT Sun Sep 10",
    "messageDateTimeUTC": "20170910 03:00:00 PM UTC",
    "messageDateTimeUTC24": "201709101500",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "N OR 350 DEGREES",
    "systemGeoRefPt1": "ABOUT 80 MI...125 KM SSE OF NAPLES FLORIDA",
    "systemGeoRefPt2": "ABOUT 115 MI...180 KM SSE OF FT. MYERS FLORIDA",
    "systemIntensityKph": "215",
    "systemIntensityKts": "115",
    "systemIntensityMph": "130",
    "systemMslpInHg": "27.55",
    "systemMslpMb": "933",
    "systemName": "IRMA",
    "systemSaffirSimpsonCategory": "CATEGORY 4",
    "systemSpeedKph": "15",
    "systemSpeedKts": "8",
    "systemSpeedMph": "9",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1505055600"
  }
}
