{
  "cycloneMessage": {
    "advisoryNumber": "51",
    "atcfID": "AL112017",
    "centerLocLatitude": "31.5",
    "centerLocLatitudeExpanded": "31.5N",
    "centerLocLongitude": "-84",
    "centerLocLongitudeExpanded": "84.0W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT1 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Irma Advisory Number  51\nNWS National Hurricane Center Miami FL       AL112017\n500 PM EDT Mon Sep 11 2017\n\n...IRMA CONTINUES TO SLOWLY WEAKEN WHILE MOVING OVER SOUTHWESTERN\nGEORGIA...\n\n\nSUMMARY OF 500 PM EDT...2100 UTC...INFORMATION\n----------------------------------------------\nLOCATION...31.5N 84.0W\nABOUT 10 MI...15 KM E OF ALBANY GEORGIA\nABOUT 150 MI...240 KM S OF ATLANTA GEORGIA\nMAXIMUM SUSTAINED WINDS...50 MPH...85 KM/H\nPRESENT MOVEMENT...NNW OR 340 DEGREES AT 17 MPH...28 KM/H\nMINIMUM CENTRAL PRESSURE...985 MB...29.09 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe Storm Surge Warnings from Fernandina Beach southward, from\nthe Aucilla River westward, and from Clearwater Beach southward,\nincluding Tampa Bay, have been discontinued.\n\nThe Tropical Storm Warning from the Flagler/Volusia County line to\nAltamaha Sound is discontinued.\n\nThe Tropical Storm Warning from north of the Suwannee River to the\nOkaloosa/Walton County line is discontinued.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Warning is in effect for...\n* North of Fernandina Beach to the South Santee River\n* North of Clearwater Beach to the Aucilla River\n\nA Tropical Storm Warning is in effect for...\n* North of Altamaha Sound to the South Santee River\n\nA Storm Surge Warning means there is a danger of life-threatening\ninundation, from rising water moving inland from the coastline,\nduring the next 36 hours in the indicated locations. For a\ndepiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.  This is a life-threatening situation.  Persons\nlocated within these areas should take all necessary actions to\nprotect life and property from rising water and the potential for\nother dangerous conditions.  Promptly follow evacuation and other\ninstructions from local officials.\n\nInterests elsewhere in the southeastern United States should monitor\nthe progress of Irma.\n\nFor storm information specific to your area, including possible\ninland watches and warnings, please monitor products issued by your\nlocal National Weather Service forecast office.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 500 PM EDT (2100 UTC), the center of Tropical Storm Irma was\nlocated near latitude 31.5 North, longitude 84.0 West.  Irma is\nmoving toward the north-northwest near 17 mph (28 km/h), and a\nturn toward the northwest is expected by Tuesday morning.  On the\nforecast track, the center of Irma will continue to move over\nsouthwestern Georgia tonight and move into Alabama on Tuesday.\n\nMaximum sustained winds have decreased to near 50 mph (85 km/h) with\nhigher gusts.  Continued weakening is forecast, and Irma is likely\nto become a tropical depression on Tuesday.\n\nTropical-storm-force winds extend outward up to 415 miles (665 km)\nfrom the center.\n\nThe estimated minimum central pressure is 985 mb (29.09 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following HEIGHTS ABOVE GROUND if the peak\nsurge occurs at the time of high tide...\n\nNorth of Clearwater Beach to Aucilla River...4 t 6 ft\nWest of Aucilla River to Ochlockonee River...1 to 3 ft\nClearwater Beach to Bonita Beach including Tampa Bay...1 to 3 ft\n\nSouth Santee River to North of Fernandina Beach...4 to 6 ft\nFernandina Beach to Flagler/Volusia County line, including the St.\nJohns River...1 to 3 ft\n\nThe deepest water will occur along the immediate coast in areas of\nonshore winds, where the surge will be accompanied by large and\ndestructive waves.  Surge-related flooding depends on the relative\ntiming of the surge and the tidal cycle, and can vary greatly over\nshort distances.  For information specific to your area, please see\nproducts issued by your local National Weather Service forecast\noffice.\n\nWIND:  Tropical storm conditions are expected in portions of the\nwarning area into tonight.\n\nRainfall:  Irma is expected to produce the following rain\naccumulations through Wednesday:\n\nSouth Carolina and north-central Georgia and Alabama into the\nsouthern Appalachians...3 to 6 inches with isolated 10 inches.\nNorthern Mississippi and southern portions of Tennessee and North\nCarolina...2 to 4 inches.\n\nTORNADOES: Isolated tornadoes are possible tonight along the South\nCarolina coast.\n\nSURF:  Swells generated by Irma are affecting the southeast coast of\nthe United States.  These swells are likely to cause life-\nthreatening surf and rip current conditions.  Please consult\nproducts from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 800 PM EDT.\nNext complete advisory at 1100 PM EDT.\n\n$$\nForecaster Pasch\n\nNNNN",
    "messageBinNumber": "1",
    "messageDateTimeLocal": "20170911 05:00:00 PM EDT",
    "messageDateTimeLocalStr": "0500 PM EDT Mon Sep 11",
    "messageDateTimeUTC": "20170911 09:00:00 PM UTC",
    "messageDateTimeUTC24": "201709112100",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "NNW OR 340 DEGREES",
    "systemGeoRefPt1": "ABOUT 10 MI...15 KM E OF ALBANY GEORGIA",
    "systemGeoRefPt2": "ABOUT 150 MI...240 KM S OF ATLANTA GEORGIA",
    "systemIntensityKph": "85",
    "systemIntensityKts": "45",
    "systemIntensityMph": "50",
    "systemMslpInHg": "29.09",
    "systemMslpMb": "985",
    "systemName": "IRMA",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "28",
    "systemSpeedKts": "15",
    "systemSpeedMph": "17",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1505163600"
  }
}
