{
  "cycloneMessage": {
    "advisoryNumber": "47A",
    "atcfID": "AL112017",
    "centerLocLatitude": "26.7",
    "centerLocLatitudeExpanded": "26.7N",
    "centerLocLongitude": "-81.7",
    "centerLocLongitudeExpanded": "81.7W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT1 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Irma Intermediate Advisory Number 47A\nNWS National Hurricane Center Miami FL       AL112017\n800 PM EDT Sun Sep 10 2017\n\n...IRMA MOVING NORTHWARD NEAR FT. MYERS...\n...DANGEROUS STORM SURGES EXPECTED IN AREAS OF ONSHORE WINDS ALONG\nTHE FLORIDA WEST COAST...\n\n\nSUMMARY OF 800 PM EDT...0000 UTC...INFORMATION\n----------------------------------------------\nLOCATION...26.7N 81.7W\nABOUT 15 MI...25 KM ENE OF FT. MYERS FLORIDA\nABOUT 30 MI...50 KM SE OF PORT CHARLOTTE FLORIDA\nMAXIMUM SUSTAINED WINDS...105 MPH...165 KM/H\nPRESENT MOVEMENT...N OR 355 DEGREES AT 14 MPH...22 KM/H\nMINIMUM CENTRAL PRESSURE...942 MB...27.82 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Warning is in effect for...\n* South Santee River southward to Jupiter Inlet\n* North Miami Beach southward around the Florida peninsula to the\nOchlockonee River\n* Florida Keys\n* Tampa Bay\n\nA Hurricane Warning is in effect for...\n* Fernandina Beach southward around the Florida peninsula to Indian\nPass\n* Florida Keys\n* Lake Okeechobee\n* Florida Bay\n\nA Hurricane Watch is in effect for...\n* North of Fernandina Beach to Edisto Beach\n\nA Tropical Storm Warning is in effect for...\n* West of Indian Pass to the Okaloosa/Walton County Line\n* North of Fernandina Beach to South Santee River\n\nA Tropical Storm Warning is in effect for...\n* Bimini and Grand Bahama\n\nA Storm Surge Warning means there is a danger of life-threatening\ninundation, from rising water moving inland from the coastline,\nduring the next 36 hours in the indicated locations. For a\ndepiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.  This is a life-threatening situation.  Persons\nlocated within these areas should take all necessary actions to\nprotect life and property from rising water and the potential for\nother dangerous conditions.  Promptly follow evacuation and other\ninstructions from local officials.\n\nInterests elsewhere in the southeastern United States should monitor\nthe progress of Irma.\n\nFor storm information specific to your area in the United States,\nincluding possible inland watches and warnings, please monitor\nproducts issued by your local National Weather Service forecast\noffice. For storm information specific to your area outside the\nUnited States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 800 PM EDT (0000 UTC), the center of Hurricane Irma was located\nby NOAA Doppler radar near latitude 26.7 North, longitude 81.7 West.\nIrma is moving toward the north near 14 mph (22 km/h), and a\nnorth-northwestward motion with an increase in forward speed is\nexpected by tonight, with that motion continuing through Monday.  On\nthe forecast track, the eye of Irma should move near or over the\nwest coast of the Florida Peninsula through Monday morning.  Irma\nshould then move inland over northern Florida and southwestern\nGeorgia Monday afternoon.\n\nMaximum sustained winds have decreased to near 105 mph (165 km/h)\nwith higher gusts.  Although weakening is forecast, Irma is expected\nto remain a hurricane at least through Monday morning.\n\nHurricane-force winds extend outward up to 80 miles (130 km) from\nthe center, and tropical-storm-force winds extend outward up to 220\nmiles (350 km).\n\nThe estimated minimum central pressure is 942 mb (27.82 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following HEIGHTS ABOVE GROUND if the peak\nsurge occurs at the time of high tide...\n\nCape Sable to Captiva...10 to 15 ft\nCaptiva to Ana Maria Island...6 to 10 ft\nCard Sound Bridge through Cape Sable, including the Florida Keys...\n5 to 10 ft\nAnna Maria Island to Clearwater Beach, including Tampa Bay...\n5 to 8 ft\nNorth Miami Beach to Card Sound Bridge, including Biscayne Bay...\n3 to 5 ft\nSouth Santee River to Fernandina Beach...4 to 6 ft\nClearwater Beach to Ochlockonee River...4 to 6 ft\nFernandina Beach to Jupiter Inlet...3 to 5 ft\nNorth of North Miami Beach to Jupiter Inlet...1 to 2 ft\n\nThe deepest water will occur along the immediate coast in areas of\nonshore winds, where the surge will be accompanied by large and\ndestructive waves.  Surge-related flooding depends on the relative\ntiming of the surge and the tidal cycle, and can vary greatly over\nshort distances.  For information specific to your area, please see\nproducts issued by your local National Weather Service forecast\noffice.\n\nWIND:  Hurricane conditions are continuing across portions of the\nsouthern Florida peninsula.  Winds affecting the upper floors of\nhigh-rise buildings will be significantly stronger than those near\nground level.  Tropical storm and hurricane conditions are expected\nto spread northward across the remainder of the warning areas\nthrough Monday.  Tropical storm conditions are expected in portions\nof the warning area in the Northwestern Bahamas this evening.\n\nRAINFALL:  Irma is expected to produce the following rain\naccumulations through Wednesday:\n\nWestern Bahamas...Additional 2 to 4 inches, isolated 6 inches.\n\nThe Florida Keys...Additional 3 to 6 inches with storm total amounts\nfrom 15 to 20 inches, isolated 25 inches.\n\nWestern Florida peninsula...10 to 15 inches, isolated 20 inches.\n\nEastern Florida peninsula and southeast Georgia...8 to 12 inches,\nisolated 16 inches.\n\nThe rest of Georgia, the eastern Florida Panhandle, southern and\nwestern South Carolina, and western North Carolina...3 to 8 inches,\nisolated 12 inches.\n\nSouthern Tennessee, northern Mississippi and much of Alabama...2 to\n5 inches.\n\nIn all areas this rainfall may cause life-threatening flash floods.\n\nTORNADOES: Tornadoes remain possible through tonight, mainly across\ncentral and eastern portions of the Florida Peninsula and extreme\nsoutheast Georgia.\n\nTHE EYE: Do not venture outside when the calm eye of the hurricane\npasses over, as dangerous winds will return very quickly when the\neye moves away.\n\nSURF:  Swells generated by Irma are affecting the southeast coast of\nthe United States.  These swells are likely to cause life-\nthreatening surf and rip current conditions.  Please consult\nproducts from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 1100 PM EDT.\n\n$$\nForecaster Berg\n\nNNNN",
    "messageBinNumber": "1",
    "messageDateTimeLocal": "20170910 08:00:00 PM EDT",
    "messageDateTimeLocalStr": "0800 PM EDT Sun Sep 10",
    "messageDateTimeUTC": "20170911 12:00:00 AM UTC",
    "messageDateTimeUTC24": "201709110000",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "N OR 355 DEGREES",
    "systemGeoRefPt1": "ABOUT 15 MI...25 KM ENE OF FT. MYERS FLORIDA",
    "systemGeoRefPt2": "ABOUT 30 MI...50 KM SE OF PORT CHARLOTTE FLORIDA",
    "systemIntensityKph": "165",
    "systemIntensityKts": "90",
    "systemIntensityMph": "105",
    "systemMslpInHg": "27.82",
    "systemMslpMb": "942",
    "systemName": "IRMA",
    "systemSaffirSimpsonCategory": "CATEGORY 2",
    "systemSpeedKph": "22",
    "systemSpeedKts": "12",
    "systemSpeedMph": "14",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1505088000"
  }
}
