{
  "cycloneMessage": {
    "advisoryNumber": "39",
    "atcfID": "AL112017",
    "centerLocLatitude": "22.1",
    "centerLocLatitudeExpanded": "22.1N",
    "centerLocLongitude": "-76.5",
    "centerLocLongitudeExpanded": "76.5W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT1 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Irma Advisory Number  39\nNWS National Hurricane Center Miami FL       AL112017\n500 PM EDT Fri Sep 08 2017\n\n...HURRICANE CONDITIONS SPREADING WESTWARD OVER PORTIONS OF CUBA AND\nTHE CENTRAL BAHAMAS...\n...HURRICANE WARNINGS EXTENDED NORTHWARD ALONG THE FLORIDA\nPENINSULA...\n\n\nSUMMARY OF 500 PM EDT...2100 UTC...INFORMATION\n----------------------------------------------\nLOCATION...22.1N 76.5W\nABOUT 195 MI...310 KM E OF CAIBARIEN CUBA\nABOUT 345 MI...555 KM SE OF MIAMI FLORIDA\nMAXIMUM SUSTAINED WINDS...155 MPH...250 KM/H\nPRESENT MOVEMENT...W OR 280 DEGREES AT 12 MPH...19 KM/H\nMINIMUM CENTRAL PRESSURE...925 MB...27.32 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe Hurricane Warning has been extended northward for east coast of\nFlorida to Sebastian Inlet, and along the west coast of the\npeninsula northward to Anna Maria Island.\n\nThe Hurricane Watch has been extended northward along the west coast\nof Florida to Suwannee River.\n\nA Storm Surge Watch has been issued north of Venice to the Anclote\nRiver, including Tampa Bay, and from Ponce Inlet to the Flagler/\nVolusia County Line.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Warning is in effect for...\n* Sebastian Inlet southward around the Florida peninsula to Venice\n* Florida Keys\n\nA Storm Surge Watch is in effect for...\n* North of Sebastian Inlet to the Flagler/Volusia County line\n* North of Venice to Anclote River\n* Tampa Bay\n\nA Hurricane Warning is in effect for...\n* Sebastian Inlet southward around the Florida peninsula to Anna\nMaria Island\n* Florida Keys\n* Lake Okeechobee\n* Florida Bay\n* Southeastern Bahamas\n* Cuban provinces of Camaguey, Ciego de Avila, Sancti Spiritus, and\nVilla Clara\n* Central Bahamas\n* Northwestern Bahamas\n\nA Hurricane Watch is in effect for...\n* North of Sebastian Inlet to the Flagler/Volusia County Line\n* North of Anna Maria Island to the Suwannee River\n* Cuban provinces of Guantanamo, Holguin, Las Tunas and Matanzas\n\nA Tropical Storm Warning is in effect for...\n* Cuban provinces of Guantanamo, Holguin, and Las Tunas\n\nA Storm Surge Warning means there is a danger of life-threatening\ninundation, from rising water moving inland from the coastline,\nduring the next 36 hours in the indicated locations. For a\ndepiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.  This is a life-threatening situation.  Persons\nlocated within these areas should take all necessary actions to\nprotect life and property from rising water and the potential for\nother dangerous conditions.  Promptly follow evacuation and other\ninstructions from local officials.\n\nA Storm Surge Watch means there is a possibility of life-\nthreatening inundation, from rising water moving inland from the\ncoastline, in the indicated locations during the next 48 hours.\nFor a depiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area.  Preparations to protect life and\nproperty should be rushed to completion.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours\nbefore the anticipated first occurrence of tropical-storm-force\nwinds, conditions that make outside preparations difficult or\ndangerous.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area.\n\nInterests elsewhere in Cuba, Florida, and the southeastern United\nStates should monitor the progress of Irma.\n\nFor storm information specific to your area in the United\nStates, including possible inland watches and warnings, please\nmonitor products issued by your local National Weather Service\nforecast office. For storm information specific to your area outside\nthe United States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 500 PM EDT (2100 UTC), the eye of Hurricane Irma was located\nnear latitude 22.1 North, longitude 76.5 West. Irma is moving toward\nthe west near 12 mph (19 km/h), and a turn toward the northwest\nis expected by late Saturday.  On the forecast track, the eye of\nIrma should continue to move near the north coast of Cuba and the\ncentral Bahamas tonight and Saturday, and be near the Florida\nKeys and the southern Florida Peninsula Sunday morning.\n\nMaximum sustained winds are near 155 mph (250 km/h) with higher\ngusts.  Irma is a category 4 hurricane on the Saffir-Simpson\nHurricane Wind Scale.  Some fluctuations in intensity are likely\nto continue during the next day or two, and Irma is expected to\nremain a powerful category 4 hurricane as it approaches Florida.\n\nHurricane-force winds extend outward up to 70 miles (110 km) from\nthe center and tropical-storm-force winds extend outward up to 185\nmiles (295 km).\n\nThe estimated minimum central pressure is 925 mb (27.32 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following HEIGHTS ABOVE GROUND if the peak\nsurge occurs at the time of high tide...\n\nSW Florida from Captiva to Cape Sable...8 to 12 ft\nCape Sable to Boca Raton including the Florida Key...5 to 10 ft\nVenice to Captiva...5 to 8 ft\nAnclote River to Venice including Tampa Bay...3 to 5 ft\nBoca Raton to Flagler/Volusia County line...3 to 6 ft\n\nThe deepest water will occur along the immediate coast in areas of\nonshore winds, where the surge will be accompanied by large and\ndestructive waves.  Surge-related flooding depends on the relative\ntiming of the surge and the tidal cycle, and can vary greatly over\nshort distances.  For information specific to your area, please see\nproducts issued by your local National Weather Service forecast\noffice.\n\nThe combination of a life-threatening storm surge and large breaking\nwaves will raise water levels ABOVE NORMAL TIDE LEVELS by the\nfollowing amounts within the hurricane warning area near and to the\nnorth of the center of Irma.  Near the coast, the surge will be\naccompanied by large and destructive waves.\n\nSoutheastern and central Bahamas...15 to 20 ft\nNorthwestern Bahamas...5 to 10 ft\nNorthern coast of Cuba in the warning area...5 to 10 ft\n\nWIND:  Hurricane conditions are still occurring in portions of the\nsoutheastern and Central Bahamas.  Hurricane conditions are expected\nto continue within the hurricane warning area along the north coast\nof Cuba through Saturday. Hurricane conditions are expected in the\nnorthwestern Bahamas tonight and Saturday, and in portions of\nsouthern and central Florida and the Florida Keys Saturday night or\nearly Sunday.\n\nHurricane conditions are possible within the watch area in central\nand north Florida by Sunday, with tropical storm conditions\npossible by late Saturday.\n\nRAINFALL: Irma is expected to produce the following rain\naccumulations through Tuesday night:\n\nDominican Republic, Haiti, and Turks and Caicos...additional 1 to 3\ninches.\nSouthern Bahamas and northern Cuba...10 to 15 inches, isolated 20\ninches.\nSouthern Cuba...4 to 8 inches, isolated 12 inches.\nJamaica...1 to 2 inches.\nThe Florida Keys, much of the Florida peninsula, and southeast\nGeorgia...8 to 15 inches, isolated 20 inches.\nWestern and Northern Florida peninsula from Tampa northward...4 to 8\ninches, isolated 12 inches.\nRest of Eastern Georgia, western South Carolina, and Western North\nCarolina...4 to 7 inches.\nWestern Georgia, eastern and northern Alabama, and southern\nTennessee...2 to 5 inches.\n\nIn all areas this rainfall may cause life-threatening flash floods\nand, in some areas, mudslides.\n\nTORNADOES: A few tornadoes will be possible beginning Saturday\nmorning across south Florida.\n\nSURF:  Swells generated by Irma are affecting the southeastern\nBahamas, the Turks and Caicos Islands, the northern coast of the\nDominican Republic, and should start affecting portions of the\nsoutheast coast of the United States tonight. These swells are\nlikely to cause life-threatening surf and rip current conditions.\nPlease consult products from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 800 PM EDT.\nNext complete advisory at 1100 PM EDT.\n\n$$\nForecaster Avila\n\nNNNN",
    "messageBinNumber": "1",
    "messageDateTimeLocal": "20170908 05:00:00 PM EDT",
    "messageDateTimeLocalStr": "0500 PM EDT Fri Sep 08",
    "messageDateTimeUTC": "20170908 09:00:00 PM UTC",
    "messageDateTimeUTC24": "201709082100",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "W OR 280 DEGREES",
    "systemGeoRefPt1": "ABOUT 195 MI...310 KM E OF CAIBARIEN CUBA",
    "systemGeoRefPt2": "ABOUT 345 MI...555 KM SE OF MIAMI FLORIDA",
    "systemIntensityKph": "250",
    "systemIntensityKts": "135",
    "systemIntensityMph": "155",
    "systemMslpInHg": "27.32",
    "systemMslpMb": "925",
    "systemName": "IRMA",
    "systemSaffirSimpsonCategory": "CATEGORY 4",
    "systemSpeedKph": "19",
    "systemSpeedKts": "10",
    "systemSpeedMph": "12",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1504904400"
  }
}
