{
  "cycloneMessage": {
    "advisoryNumber": "41",
    "atcfID": "AL112017",
    "centerLocLatitude": "22.5",
    "centerLocLatitudeExpanded": "22.5N",
    "centerLocLongitude": "-78.8",
    "centerLocLongitudeExpanded": "78.8W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT1 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Irma Advisory Number  41\nNWS National Hurricane Center Miami FL       AL112017\n500 AM EDT Sat Sep 09 2017\n\n...EYE OF IRMA CONTINUES MOVING OVER THE CAMAGUEY ARCHIPELAGO OF\nCUBA AS A CATEGORY 4 HURRICANE...\n\n\nSUMMARY OF 500 AM EDT...0900 UTC...INFORMATION\n----------------------------------------------\nLOCATION...22.5N 78.8W\nABOUT 45 MI...70 KM E OF CAIBARIEN CUBA\nABOUT 245 MI...395 KM SSE OF MIAMI FLORIDA\nMAXIMUM SUSTAINED WINDS...155 MPH...250 KM/H\nPRESENT MOVEMENT...WNW OR 285 DEGREES AT 12 MPH...19 KM/H\nMINIMUM CENTRAL PRESSURE...930 MB...27.47 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe Hurricane Warning and the Storm Surge Warning are extended\nnorthward along the Florida West coast from Anclote River to\nChassahowitzka.\n\nThe Hurricane Warning is extended northward along the Florida East\ncoast to the Flagler/Volusia County Line.\n\nA Tropical Storm Watch has been issued north of Fernandina Beach to\nAltamaha Sound, Georgia.\n\nAdditional Watches and Warnings may be required for portions of the\ncoasts of Georgia and South Carolina, as well as portions of the\nFlorida Gulf Coast later today.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Warning is in effect for...\n* Volusia/Brevard County Line southward around the Florida peninsula\nto Chassahowitzka\n* Florida Keys\n* Tampa Bay\n\nA Storm Surge Watch is in effect for...\n* North of the Volusia/Brevard County Line to the Flagler/Volusia\nCounty line\n* North of Chassahowitzka to Suwannee River\n\nA Hurricane Warning is in effect for...\n* Flagler/Volusia County Line southward around the Florida peninsula\nto Chassahowitzka\n* Florida Keys\n* Lake Okeechobee\n* Florida Bay\n* Cuban provinces of Camaguey, Ciego de Avila, Sancti Spiritus,\nVilla Clara, and Matanzas\n* Central Bahamas and Ragged Island\n* Northwestern Bahamas\n\nA Hurricane Watch is in effect for...\n* North of the Flagler/Volusia County Line to Fernandina Beach\n* North and west of Chassahowitzka to Indian Pass\n* Cuban provinces of Holguin and Las Tunas\n\nA Tropical Storm Warning is in effect for...\n* Cuban provinces of Holguin, Las Tunas, La Habana, and Ciudad de\nla Habana\n\nA Tropical Storm Watch is in effect for...\n* North of Fernandina Beach to Altamaha Sound\n\nA Storm Surge Warning means there is a danger of life-threatening\ninundation, from rising water moving inland from the coastline,\nduring the next 36 hours in the indicated locations. For a\ndepiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.  This is a life-threatening situation.  Persons\nlocated within these areas should take all necessary actions to\nprotect life and property from rising water and the potential for\nother dangerous conditions.  Promptly follow evacuation and other\ninstructions from local officials.\n\nA Storm Surge Watch means there is a possibility of life-\nthreatening inundation, from rising water moving inland from the\ncoastline, in the indicated locations during the next 48 hours.\nFor a depiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area.  Preparations to protect life and\nproperty should be rushed to completion.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours\nbefore the anticipated first occurrence of tropical-storm-force\nwinds, conditions that make outside preparations difficult or\ndangerous.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, generally within 48 hours.\n\nInterests elsewhere in Cuba, Florida, and the southeastern United\nStates should monitor the progress of Irma.\n\nFor storm information specific to your area in the United\nStates, including possible inland watches and warnings, please\nmonitor products issued by your local National Weather Service\nforecast office. For storm information specific to your area outside\nthe United States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 500 AM EDT (0900 UTC), the center of Hurricane Irma was located\nnear latitude 22.5 North, longitude 78.8 West. Irma is moving toward\nthe west-northwest near 12 mph (19 km/h).  A turn toward the\nnorthwest is expected by late today, with a turn toward the\nnorth-northwest expected tonight or on Sunday.  On the forecast\ntrack, the center of Irma will move near the north coast of Cuba\ntoday, near the Florida Keys Sunday morning, and then near the\nsouthwest coast of Florida Sunday afternoon.\n\nMaximum sustained winds are near 155 mph (250 km/h) with higher\ngusts.  Irma is a category 4 hurricane on the Saffir-Simpson\nHurricane Wind Scale.  Some fluctuations in intensity are likely\nduring the next day or two, but Irma is expected to remain a\npowerful hurricane as it approaches Florida.\n\nHurricane-force winds extend outward up to 70 miles (110 km) from\nthe center and tropical-storm-force winds extend outward up to 195\nmiles (315 km).\n\nThe estimated minimum central pressure is 930 mb (27.47 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following HEIGHTS ABOVE GROUND if the peak\nsurge occurs at the time of high tide...\n\nSW Florida from Captiva to Cape Sable...8 to 12 ft\nCape Sable to Boca Raton including the Florida Keys...5 to 10 ft\nVenice to Captiva...5 to 8 ft\nSuwannee River to Venice including Tampa Bay...3 to 5 ft\nBoca Raton to Flagler/Volusia County line...2 to 4 ft\n\nThe deepest water will occur along the immediate coast in areas of\nonshore winds, where the surge will be accompanied by large and\ndestructive waves.  Surge-related flooding depends on the relative\ntiming of the surge and the tidal cycle, and can vary greatly over\nshort distances.  For information specific to your area, please see\nproducts issued by your local National Weather Service forecast\noffice.\n\nThe combination of a life-threatening storm surge and large breaking\nwaves will raise water levels ABOVE NORMAL TIDE LEVELS by the\nfollowing amounts within the hurricane warning area near and to the\nnorth of the center of Irma.  Near the coast, the surge will be\naccompanied by large and destructive waves.\n\nRagged Island in the Bahamas...15 to 20 ft\nCentral and Northwestern Bahamas...3 to 6 ft\nNorthern coast of Cuba in the warning area...5 to 10 ft\n\nWIND:  Hurricane conditions are still occurring over portions of the\ncentral Bahamas, as well as Ragged Island.  Hurricane conditions are\nexpected to continue within the hurricane warning area along the\nnorth coast of Cuba through today.  Hurricane conditions are\nexpected in the northwestern Bahamas today, and in portions of\nsouthern and central Florida and the Florida Keys tonight and\nSunday.\n\nHurricane and tropical storm conditions are possible within the\nwatch area in central and north Florida by Sunday.\n\nRAINFALL: Irma is expected to produce the following rain\naccumulations through Tuesday night:\n\nNorthern Cuba...10 to 15 inches, isolated 20 inches. Southern\nCuba...5 to 10 inches, isolated 15 inches.\n\nWestern Bahamas...3 to 6 inches, isolated 10 inches.\n\nThe Florida Keys...10 to 20 inches, isolated 25 inches.\n\nThe Florida peninsula and southeast Georgia...8 to 15 inches,\nisolated 20 inches.\n\nThe eastern Florida Panhandle...3 to 6 inches, isolated 8 inches.\n\nRest of eastern Georgia, western South Carolina, and western North\nCarolina...4 to 8 inches. Western Georgia, eastern and northern\nAlabama, and southern Tennessee...2 to 5 inches.\n\nIn all areas this rainfall may cause life-threatening flash floods\nand, in some areas, mudslides.\n\nTORNADOES:  A few tornadoes are possible today and tonight over\nsouthern Florida.\n\nSURF:  Swells generated by Irma are affecting the southeastern\nBahamas, the Turks and Caicos Islands, the northern coast of the\nDominican Republic, and the southeast coast of the United States\ntoday.  These swells are likely to cause life-threatening surf and\nrip current conditions.  Please consult products from your local\nweather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 800 AM EDT.\nNext complete advisory at 1100 AM EDT.\n\n$$\nForecaster Beven\n\nNNNN",
    "messageBinNumber": "1",
    "messageDateTimeLocal": "20170909 05:00:00 AM EDT",
    "messageDateTimeLocalStr": "0500 AM EDT Sat Sep 09",
    "messageDateTimeUTC": "20170909 09:00:00 AM UTC",
    "messageDateTimeUTC24": "201709090900",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "WNW OR 285 DEGREES",
    "systemGeoRefPt1": "ABOUT 45 MI...70 KM E OF CAIBARIEN CUBA",
    "systemGeoRefPt2": "ABOUT 245 MI...395 KM SSE OF MIAMI FLORIDA",
    "systemIntensityKph": "250",
    "systemIntensityKts": "135",
    "systemIntensityMph": "155",
    "systemMslpInHg": "27.47",
    "systemMslpMb": "930",
    "systemName": "IRMA",
    "systemSaffirSimpsonCategory": "CATEGORY 4",
    "systemSpeedKph": "19",
    "systemSpeedKts": "10",
    "systemSpeedMph": "12",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1504947600"
  }
}
