{
  "cycloneMessage": {
    "advisoryNumber": "36A",
    "atcfID": "AL112017",
    "centerLocLatitude": "21.5",
    "centerLocLatitudeExpanded": "21.5N",
    "centerLocLongitude": "-73.3",
    "centerLocLongitudeExpanded": "73.3W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT1 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Irma Intermediate Advisory Number 36A\nNWS National Hurricane Center Miami FL       AL112017\n200 AM EDT Fri Sep 08 2017\n\n...EYE OF IRMA PASSING JUST NORTH OF GREAT INAGUA ISLAND...\n\n\nSUMMARY OF 200 AM EDT...0600 UTC...INFORMATION\n----------------------------------------------\nLOCATION...21.5N 73.3W\nABOUT 20 MI...30 KM N OF GREAT INAGUA ISLAND\nABOUT 535 MI...860 KM ESE OF MIAMI FLORIDA\nMAXIMUM SUSTAINED WINDS...160 MPH...260 KM/H\nPRESENT MOVEMENT...WNW OR 290 DEGREES AT 16 MPH...26 KM/H\nMINIMUM CENTRAL PRESSURE...925 MB...27.31 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Warning is in effect for...\n* Jupiter Inlet southward around the Florida peninsula to Bonita\nBeach\n* Florida Keys\n\nA Storm Surge Watch is in effect for...\n* North of Jupiter Inlet to Sebastian Inlet\n* North of Bonita Beach to Venice\n\nA Hurricane Warning is in effect for...\n* Jupiter Inlet southward around the Florida peninsula to Bonita\nBeach\n* Florida Keys\n* Lake Okeechobee\n* Florida Bay\n* Haiti from the northern border with the Dominican Republic to Le\nMole St. Nicholas\n* Southeastern Bahamas and the Turks and Caicos Islands\n* Cuban provinces of Camaguey, Ciego de Avila, Sancti Spiritus, and\nVilla Clara\n* Central Bahamas\n* Northwestern Bahamas\n\nA Hurricane Watch is in effect for...\n* North of Jupiter Inlet to Sebastian Inlet\n* North of Bonita Beach to Anna Maria Island\n* Cuban provinces of Guantanamo, Holguin, Las Tunas and Matanzas.\n\nA Tropical Storm Warning is in effect for...\n* Haiti from south of Le Mole St. Nicholas to Port-Au-Prince\n* Cuban provinces of Guantanamo, Holguin, and Las Tunas\n\nA Storm Surge Warning means there is a danger of life-threatening\ninundation, from rising water moving inland from the coastline,\nduring the next 36 hours in the indicated locations. For a\ndepiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.  This is a life-threatening situation.  Persons\nlocated within these areas should take all necessary actions to\nprotect life and property from rising water and the potential for\nother dangerous conditions.  Promptly follow evacuation and other\ninstructions from local officials.\n\nA Storm Surge Watch means there is a possibility of life-\nthreatening inundation, from rising water moving inland from the\ncoastline, in the indicated locations during the next 48 hours.\nFor a depiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area.  Preparations to protect life and\nproperty should be rushed to completion.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours\nbefore the anticipated first occurrence of tropical-storm-force\nwinds, conditions that make outside preparations difficult or\ndangerous.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area.\n\nInterests elsewhere in Cuba and Florida should monitor the progress\nof Irma.\n\nFor storm information specific to your area in the United\nStates, including possible inland watches and warnings, please\nmonitor products issued by your local National Weather Service\nforecast office. For storm information specific to your area outside\nthe United States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 200 AM EDT (0600 UTC), the eye of Hurricane Irma was located near\nlatitude 21.5 North, longitude 73.3 West. Irma is moving toward the\nwest-northwest near 16 mph (26 km/h), and this motion is expected to\ncontinue for the next day or two with a decrease in forward speed.\nA turn toward the northwest is expected by late Saturday.  On the\nforecast track, the eye of Irma should continue to move westward\naway from the Turks and Caicos Islands and toward the southeastern\nBahamas this morning.  The core of the hurricane will then move\nbetween the north coast of Cuba and the Bahamas during the next day\nor two.\n\nReports from an Air Force Reserve Hurricane Hunter aircraft indicate\nthat maximum sustained winds are now near 160 mph (260 km/h) with\nhigher gusts.  Irma is a category 5 hurricane on the Saffir-Simpson\nHurricane Wind Scale.  Some fluctuations in intensity are likely\nduring the next day or two, but Irma is forecast to remain a\npowerful category 4 or 5 hurricane during the next couple of days.\n\nHurricane-force winds extend outward up to 75 miles (120 km) from\nthe center, and tropical-storm-force winds extend outward up to 185\nmiles (295 km).\n\nThe minimum central pressure recently reported by the Hurricane\nHunter aircraft is 925 mb (27.31 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following HEIGHTS ABOVE GROUND if the peak\nsurge occurs at the time of high tide...\n\nJupiter Inlet to Bonita Beach, including Florida Keys...5 to 10 ft\nBonita Beach to Venice...3 to 5 ft\nJupiter Inlet to Sebastian Inlet...3 to 6 ft\n\nThe deepest water will occur along the immediate coast in areas of\nonshore winds, where the surge will be accompanied by large and\ndestructive waves.  Surge-related flooding depends on the relative\ntiming of the surge and the tidal cycle, and can vary greatly over\nshort distances.  For information specific to your area, please see\nproducts issued by your local National Weather Service forecast\noffice.\n\nThe combination of a life-threatening storm surge and large breaking\nwaves will raise water levels ABOVE NORMAL TIDE LEVELS by the\nfollowing amounts within the hurricane warning area near and to the\nnorth of the center of Irma.  Near the coast, the surge will be\naccompanied by large and destructive waves.\n\nTurks and Caicos Islands...15 to 20 ft\nSoutheastern and central Bahamas...15 to 20 ft\nNorthwestern Bahamas...5 to 10 ft\nNorthern coast of Haiti and the Gulf of Gonave...1 to 3 ft\nNorthern coast of Cuba in the warning area...5 to 10 ft\n\nWIND:  Hurricane conditions are expected to continue within the\nhurricane warning area in Haiti this morning. Hurricane conditions\nare occurring on the Turks and Caicos Islands. Tropical storm and\nhurricane conditions are spreading across the southeastern Bahamas\nand will move into the central Bahamas later this morning.\nHurricane conditions are expected within the hurricane warning area\nalong the north coast of Cuba late today and Saturday.  Hurricane\nconditions are expected in the northwestern Bahamas tonight and\nSaturday, and in portions of southern Florida and the Florida Keys\nlate Saturday.\n\nHurricane conditions are possible within the watch area in Florida\nby Sunday, with tropical storm conditions possible by late Saturday.\n\nRAINFALL:  Irma is expected to produce the following rain\naccumulations through Sunday evening:\n\nNortheast Puerto Rico and the British and U.S. Virgin Islands...\nadditional 2 to 4 inches, isolated 6 inches.\nNorthern Dominican Republic and northern Haiti...additional 3 to 6\ninches.\nSouthern Dominican Republic and southern Haiti...additional 1 to 2\ninches.\nMuch of the Bahamas and Turks and Caicos...8 to 12 inches, isolated\n20 inches.\nAndros Island and Bimini, Bahamas...12 to 16 inches, isolated 25\ninches.\nEastern and central Cuba...4 to 10 inches, isolated 15 inches.\nSoutheast Florida and the upper Florida Keys...8 to 12 inches,\nisolated 20 inches\nLower Florida Keys...2 to 5 inches.\nCentral Florida into northeast Florida and coastal Georgia...3 to 6\ninches, isolated 10 inches.\n\nIn all areas this rainfall may cause life-threatening flash floods\nand in some areas mudslides.\n\nSURF:  Swells generated by Irma are affecting Puerto Rico, the\nVirgin Islands, the southeastern Bahamas, the Turks and Caicos\nIslands, the northern coast of the Dominican Republic, and should\nstart affecting portions of the southeast coast of the United States\nlater today and tonight.  These swells are likely to cause\nlife-threatening surf and rip current conditions.  Please consult\nproducts from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 500 AM EDT.\n\n$$\nForecaster Beven\n\nNNNN",
    "messageBinNumber": "1",
    "messageDateTimeLocal": "20170908 02:00:00 AM EDT",
    "messageDateTimeLocalStr": "0200 AM EDT Fri Sep 08",
    "messageDateTimeUTC": "20170908 06:00:00 AM UTC",
    "messageDateTimeUTC24": "201709080600",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "WNW OR 290 DEGREES",
    "systemGeoRefPt1": "ABOUT 20 MI...30 KM N OF GREAT INAGUA ISLAND",
    "systemGeoRefPt2": "ABOUT 535 MI...860 KM ESE OF MIAMI FLORIDA",
    "systemIntensityKph": "260",
    "systemIntensityKts": "140",
    "systemIntensityMph": "160",
    "systemMslpInHg": "27.31",
    "systemMslpMb": "925",
    "systemName": "IRMA",
    "systemSaffirSimpsonCategory": "CATEGORY 5",
    "systemSpeedKph": "26",
    "systemSpeedKts": "14",
    "systemSpeedMph": "16",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1504850400"
  }
}
