{
  "cycloneMessage": {
    "advisoryNumber": "21",
    "atcfID": "AL112017",
    "centerLocLatitude": "16.8",
    "centerLocLatitudeExpanded": "16.8N",
    "centerLocLongitude": "-53.3",
    "centerLocLongitudeExpanded": "53.3W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT1 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Irma Advisory Number  21\nNWS National Hurricane Center Miami FL       AL112017\n1100 AM AST Mon Sep 04 2017\n\n...HURRICANE WARNINGS ISSUED FOR PORTIONS OF THE LEEWARD ISLANDS...\n...HURRICANE WATCHES ISSUED FOR THE BRITISH AND U.S. VIRGIN ISLANDS\nAND PUERTO RICO...\n\n\nSUMMARY OF 1100 AM AST...1500 UTC...INFORMATION\n-----------------------------------------------\nLOCATION...16.8N 53.3W\nABOUT 560 MI...905 KM E OF THE LEEWARD ISLANDS\nMAXIMUM SUSTAINED WINDS...120 MPH...195 KM/H\nPRESENT MOVEMENT...WSW OR 255 DEGREES AT 14 MPH...22 KM/H\nMINIMUM CENTRAL PRESSURE...944 MB...27.88 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe government of Antigua has issued a Hurricane Warning for the\nislands of Antigua, Barbuda, Anguilla, Montserrat, St. Kitts, and\nNevis.  A Hurricane Watch has been issued for the British Virgin\nIslands.\n\nThe government of the Netherlands has issued a Hurricane Warning for\nthe islands of Saba, St. Eustatius, and Sint Maarten.\n\nThe government of France has issued a Hurricane Warning for St.\nMartin and Saint Barthelemy.  A Hurricane Watch has been issued for\nGuadeloupe.\n\nA Hurricane Watch has been issued for the U.S. Virgin Islands,\nPuerto Rico, Vieques, and Culebra.\n\nThe government of Barbados has issued a Tropical Storm Watch for\nDominica.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Warning is in effect for...\n* Antigua, Barbuda, Anguilla, Montserrat, St. Kitts, and Nevis\n* Saba, St. Eustatius, and Sint Maarten\n* Saint Martin and Saint Barthelemy\n\nA Hurricane Watch is in effect for...\n* Guadeloupe\n* British Virgin Islands\n* U.S. Virgin Islands\n* Puerto Rico, Vieques, and Culebra\n\nA Tropical Storm Watch is in effect for...\n* Dominica\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area.  A warning is typically issued\n36 hours before the anticipated first occurrence of tropical-storm-\nforce winds, conditions that make outside preparations difficult or\ndangerous.  Preparations to protect life and property should be\nrushed to completion.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours before\nthe anticipated first occurrence of tropical-storm-force winds,\nconditions that make outside preparations difficult or dangerous.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, generally within 48 hours.\n\nInterests in the Dominican Republic, Haiti, the Turks and Caicos\nIslands, and the southeastern Bahamas should monitor the progress of\nIrma.\n\nFor storm information specific to your area in the United States,\nincluding possible inland watches and warnings, please monitor\nproducts issued by your local National Weather Service forecast\noffice. For storm information specific to your area outside the\nUnited States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 1100 AM AST (1500 UTC), the eye of Hurricane Irma was located\nnear latitude 16.8 North, longitude 53.3 West. Irma is moving toward\nthe west-southwest near 14 mph (22 km/h).  A turn toward the west\nis expected later today, followed by a west-northwestward turn late\nTuesday.  On the forecast track, the center of Irma will move near\nor over portions of the northern Leeward Islands Tuesday night\nand early Wednesday.\n\nMaximum sustained winds are near 120 mph (195 km/h) with higher\ngusts.  Irma is a category 3 hurricane on the Saffir-Simpson\nHurricane Wind Scale.  Additional strengthening is forecast through\nTuesday night.\n\nHurricane-force winds extend outward up to 35 miles (55 km) from the\ncenter and tropical-storm-force winds extend outward up to 140 miles\n(220 km).\n\nThe estimated minimum central pressure based on data from a NOAA\nHurricane Hunter aircraft is 944 mb (27.88 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nSTORM SURGE:  The combination of a dangerous storm surge and large\nbreaking waves will raise water levels by as much as 6 to 9 feet\nabove normal tide levels along the coasts of the extreme northern\nLeeward Islands within the hurricane warning area near and to the\nnorth of the center of Irma.  Near the coast, the surge will be\naccompanied by large and destructive waves.\n\nWIND:  Hurricane conditions are expected within the hurricane\nwarning area by Tuesday night, with tropical storm conditions\nexpected by late Tuesday.  Hurricane conditions are possible within\nthe hurricane watch area by late Wednesday, with tropical storm\nconditions possible by early Wednesday.\n\nRAINFALL:  Irma is expected to produce total rainfall accumulations\nof 3 to 6 inches across the Leeward Islands, with isolated maximum\namounts of 10 inches across the northern Leeward Islands. These\nrainfall amounts may cause life-threatening flash floods and\nmudslides.\n\nSURF:  Swells generated by Irma will affect the northern Leeward\nIslands during the next several days.  These swells are likely to\ncause life-threatening surf and rip current conditions. Please\nconsult products from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 200 PM AST.\nNext complete advisory at 500 PM AST.\n\n$$\nForecaster Brown\n\nNNNN",
    "messageBinNumber": "1",
    "messageDateTimeLocal": "20170904 11:00:00 AM AST",
    "messageDateTimeLocalStr": "1100 AM AST Mon Sep 04",
    "messageDateTimeUTC": "20170904 03:00:00 PM UTC",
    "messageDateTimeUTC24": "201709041500",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "WSW OR 255 DEGREES",
    "systemGeoRefPt1": "ABOUT 560 MI...905 KM E OF THE LEEWARD ISLANDS",
    "systemIntensityKph": "195",
    "systemIntensityKts": "105",
    "systemIntensityMph": "120",
    "systemMslpInHg": "27.88",
    "systemMslpMb": "944",
    "systemName": "IRMA",
    "systemSaffirSimpsonCategory": "CATEGORY 3",
    "systemSpeedKph": "22",
    "systemSpeedKts": "12",
    "systemSpeedMph": "14",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1504537200"
  }
}
