{
  "cycloneMessage": {
    "advisoryNumber": "44",
    "atcfID": "AL112017",
    "centerLocLatitude": "23.5",
    "centerLocLatitudeExpanded": "23.5N",
    "centerLocLongitude": "-81",
    "centerLocLongitudeExpanded": "81.0W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT1 ALL\nTTAA00 KNHC DDHHMM CCA\n\nBULLETIN\nHurricane Irma Advisory Number  44...Corrected\nNWS National Hurricane Center Miami FL       AL112017\n1100 PM EDT Sat Sep 09 2017\n\nCorrected to remove the Storm Surge Watch in the Watch/Warning\nsection\n\n...IRMA TAKING ITS TIME MOVING AWAY FROM CUBA...\n...LIFE-THREATENING STORM SURGE EXPECTED IN THE FLORIDA KEYS AND\nTHE WEST COAST OF FLORIDA...\n\n\nSUMMARY OF 1100 PM EDT...0300 UTC...INFORMATION\n-----------------------------------------------\nLOCATION...23.5N 81.0W\nABOUT 30 MI...50 KM NNE OF VARADERO CUBA\nABOUT 90 MI...145 KM SE OF KEY WEST FLORIDA\nMAXIMUM SUSTAINED WINDS...120 MPH...195 KM/H\nPRESENT MOVEMENT...NW OR 305 DEGREES AT 6 MPH...9 KM/H\nMINIMUM CENTRAL PRESSURE...933 MB...27.55 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe Storm Surge Warning has been extended westward from the Suwannee\nRiver to the Ochlockonee River.\n\nThe Storm Surge Warning has been discontinued north of North Miami\nBeach to Jupiter Inlet.\n\nThe government of Cuba has discontinued the Hurricane Warning for\nthe province of Camaguey.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Warning is in effect for...\n* South Santee River southward to Jupiter Inlet\n* North Miami Beach southward around the Florida peninsula to the\nOchlockonee River\n* Florida Keys\n* Tampa Bay\n\nA Hurricane Warning is in effect for...\n* Fernandina Beach southward around the Florida peninsula to Indian\nPass\n* Florida Keys\n* Lake Okeechobee\n* Florida Bay\n* Cuban provinces of Ciego de Avila, Sancti Spiritus, Villa Clara,\nMatanzas, and La Habana\n* Andros Island, Bimini, and Grand Bahama\n\nA Hurricane Watch is in effect for...\n* North of Fernandina Beach to Edisto Beach\n\nA Tropical Storm Warning is in effect for...\n* West of Indian Pass to the Okaloosa/Walton County Line\n* North of Fernandina Beach to South Santee River\n\nA Storm Surge Warning means there is a danger of life-threatening\ninundation, from rising water moving inland from the coastline,\nduring the next 36 hours in the indicated locations. For a\ndepiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.  This is a life-threatening situation.  Persons\nlocated within these areas should take all necessary actions to\nprotect life and property from rising water and the potential for\nother dangerous conditions.  Promptly follow evacuation and other\ninstructions from local officials.\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area.  Preparations to protect life and\nproperty should be rushed to completion.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours\nbefore the anticipated first occurrence of tropical-storm-force\nwinds, conditions that make outside preparations difficult or\ndangerous.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area.\n\nInterests elsewhere in Cuba and the southeastern United States\nshould monitor the progress of Irma.\n\nFor storm information specific to your area in the United States,\nincluding possible inland watches and warnings, please monitor\nproducts issued by your local National Weather Service forecast\noffice. For storm information specific to your area outside the\nUnited States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 1100 PM EDT (0300 UTC), the eye of Hurricane Irma was located\nnear latitude 23.5 North, longitude 81.0 West. Irma is moving\nslowly northwestward away from the north coast of Cuba near 6 mph\n(9 km/h).  A turn toward the north-northwest with an increase in\nforward speed is expected through late Monday.  On the forecast\ntrack, the center of Irma is expected to cross the Lower Florida\nKeys Sunday morning and then move near or along the west coast of\nFlorida Sunday afternoon through Monday morning.  Irma should then\nmove inland over the Florida panhandle and southwestern Georgia\nMonday afternoon.\n\nMaximum sustained winds are near 120 mph (195 km/h) with higher\ngusts.  Irma is a category 3 hurricane on the Saffir-Simpson\nHurricane Wind Scale.  Irma is forecast to restrengthen a little\nwhile it moves through the Straits of Florida and remain a powerful\nhurricane as it approaches the Florida Keys and the west coast of\nFlorida.\n\nHurricane-force winds extend outward up to 70 miles (110 km) from\nthe center, and tropical-storm-force winds extend outward up to 205\nmiles (335 km).\n\nThe estimated minimum central pressure is 933 mb (27.55 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following HEIGHTS ABOVE GROUND if the peak\nsurge occurs at the time of high tide...\n\nCape Sable to Captiva...10 to 15 ft\nCaptiva to Ana Maria Island...6 to 10 ft\nCard Sound Bridge through Cape Sable, including the Florida Keys...\n5 to 10 ft\nAna Maria Island to Clearwater Beach, including Tampa Bay...\n5 to 8 ft\nNorth Miami Beach to Card Sound Bridge, including Biscayne Bay...\n3 to 5 ft\nSouth Santee River to Fernandina Beach...4 to 6 ft\nClearwater Beach to Ochlockonee River...4 to 6 ft\nFernandina Beach to Jupiter Inlet...2 to 4 ft\nNorth of North Miami Beach to Jupiter Inlet...1 to 2 ft\n\nThe deepest water will occur along the immediate coast in areas of\nonshore winds, where the surge will be accompanied by large and\ndestructive waves.  Surge-related flooding depends on the relative\ntiming of the surge and the tidal cycle, and can vary greatly over\nshort distances.  For information specific to your area, please see\nproducts issued by your local National Weather Service forecast\noffice.\n\nThe combination of a life-threatening storm surge and large breaking\nwaves will raise water levels ABOVE NORMAL TIDE LEVELS by the\nfollowing amounts within the hurricane warning area near and to the\nnorth of the center of Irma.  Near the coast, the surge will be\naccompanied by large and destructive waves.\n\nNorthwestern Bahamas...3 to 6 ft\nNorthern coast of Cuba in the warning area...5 to 10 ft\n\nWIND:  Hurricane conditions are expected to continue within the\nhurricane warning area along the north coast of Cuba through\ntonight. Hurricane conditions are expected in portions of the\nnorthwestern Bahamas tonight, and in portions of the Florida\npeninsula and the Florida Keys beginning Sunday morning.  Tropical\nstorm and hurricane conditions are expected to spread northward\nacross the remainder of the warning areas through Monday.\n\nRAINFALL:  Irma is expected to produce the following rain\naccumulations through Wednesday:\n\nNorthern Cuba...10 to 15 inches, isolated 20 inches.\nSouthern Cuba...5 to 10 inches, isolated 15 inches.\nWestern Bahamas...3 to 6 inches, isolated 10 inches.\nThe Florida Keys...10 to 20 inches, isolated 25 inches.\nThe Florida peninsula and southeast Georgia...8 to 15 inches,\nisolated 20 inches.\nThe eastern Florida Panhandle and southern South Carolina...4 to 8\ninches, isolated 10 inches.\nRest of eastern Georgia, western South Carolina, and western North\nCarolina...4 to 8 inches.\nWestern Georgia, eastern and northern Alabama, and southern\nTennessee...2 to 5 inches.\n\nIn all areas this rainfall may cause life-threatening flash floods\nand, in some areas, mudslides.\n\nTORNADOES:  A few tornadoes are possible through Sunday night,\nmainly across southern, central, and eastern portions of the Florida\npeninsula.\n\nSURF:  Swells generated by Irma are affecting the southeast coast of\nthe United States.  These swells are likely to cause life-\nthreatening surf and rip current conditions.  Please consult\nproducts from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 200 AM EDT.\nNext complete advisory at 500 AM EDT.\n\n$$\nForecaster Berg\n\nNNNN",
    "messageBinNumber": "1",
    "messageDateTimeLocal": "20170909 11:00:00 PM EDT",
    "messageDateTimeLocalStr": "1100 PM EDT Sat Sep 09",
    "messageDateTimeUTC": "20170910 03:00:00 AM UTC",
    "messageDateTimeUTC24": "201709100300",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "NW OR 305 DEGREES",
    "systemGeoRefPt1": "ABOUT 30 MI...50 KM NNE OF VARADERO CUBA",
    "systemGeoRefPt2": "ABOUT 90 MI...145 KM SE OF KEY WEST FLORIDA",
    "systemIntensityKph": "195",
    "systemIntensityKts": "105",
    "systemIntensityMph": "120",
    "systemMslpInHg": "27.55",
    "systemMslpMb": "933",
    "systemName": "IRMA",
    "systemSaffirSimpsonCategory": "CATEGORY 3",
    "systemSpeedKph": "9",
    "systemSpeedKts": "5",
    "systemSpeedMph": "6",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1505012400"
  }
}
