{
  "cycloneMessage": {
    "advisoryNumber": "24",
    "atcfID": "AL112017",
    "centerLocLatitude": "16.6",
    "centerLocLatitudeExpanded": "16.6N",
    "centerLocLongitude": "-57",
    "centerLocLongitudeExpanded": "57.0W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT1 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Irma Advisory Number  24\nNWS National Hurricane Center Miami FL       AL112017\n500 AM AST Tue Sep 05 2017\n\n...DANGEROUS HURRICANE IRMA HEADING FOR THE LEEWARD ISLANDS WITH 150\nMPH WINDS...\n\n\nSUMMARY OF 500 AM AST...0900 UTC...INFORMATION\n----------------------------------------------\nLOCATION...16.6N 57.0W\nABOUT 320 MI...515 KM E OF THE LEEWARD ISLANDS\nMAXIMUM SUSTAINED WINDS...150 MPH...240 KM/H\nPRESENT MOVEMENT...W OR 270 DEGREES AT 14 MPH...22 KM/H\nMINIMUM CENTRAL PRESSURE...937 MB...27.67 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe government of Barbados has issued a Tropical Storm Warning for\nDominica.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Warning is in effect for...\n* Antigua, Barbuda, Anguilla, Montserrat, St. Kitts, and Nevis\n* Saba, St. Eustatius, and Sint Maarten\n* Saint Martin and Saint Barthelemy\n* British Virgin Islands\n* U.S. Virgin Islands\n* Puerto Rico, Vieques, and Culebra\n\nA Hurricane Watch is in effect for...\n* Guadeloupe\n\nA Tropical Storm Warning is in effect for...\n* Guadeloupe\n* Dominica\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area. A warning is typically issued\n36 hours before the anticipated first occurrence of tropical-storm-\nforce winds, conditions that make outside preparations difficult or\ndangerous. In this case, for some of easternmost islands, the\nhurricane conditions are expected within the next 24 hours.\nPreparations to protect life and property should be rushed to\ncompletion.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area in this case within 36\nhours.\n\nInterests in the Dominican Republic, Haiti, the Turks and Caicos\nIslands, Cuba, and the southeastern and central Bahamas should\nmonitor the progress of Irma.\n\nFor storm information specific to your area in the United\nStates, including possible inland watches and warnings, please\nmonitor products issued by your local National Weather Service\nforecast office. For storm information specific to your area outside\nthe United States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 500 AM AST (0900 UTC), the distinct eye of Hurricane Irma was\nlocated near latitude 16.6 North, longitude 57.0 West. Irma is\nmoving toward the west near 14 mph (22 km/h), and this general\nmotion is expected to continue today, followed by a turn toward the\nwest-northwest tonight. On the forecast track, the core of Irma\nwill move near or over portions of the northern Leeward Islands\ntonight and early Wednesday.\n\nMaximum sustained winds have increased to near 150 mph (240 km/h)\nwith higher gusts.  Irma is a category 4 hurricane on the\nSaffir-Simpson Hurricane Wind Scale.  A NOAA Hurricane Hunter\nplane is scheduled to be in the eye of Irma within the hour.\n\nSome fluctuations in intensity are likely during the next day\nor two, but Irma is forecast to remain a powerful category 4\nhurricane.\n\nHurricane-force winds extend outward up to 45 miles (75 km) from the\ncenter and tropical-storm-force winds extend outward up to 140 miles\n(220 km).\n\nThe estimated minimum central pressure is 937 mb (27.67 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nSTORM SURGE:  The combination of a dangerous storm surge and large\nbreaking waves will raise water levels by as much as 6 to 9 feet\nabove normal tide levels along the coasts of the extreme northern\nLeeward Islands within the hurricane warning area near and to the\nnorth of the center of Irma.  Near the coast, the surge will be\naccompanied by large and destructive waves.\n\nThe combination of a dangerous storm surge and the tide will cause\nnormally dry areas near the coast to be flooded by rising waters\nmoving inland from the shoreline.  The water is expected to reach\nthe following heights above ground if the peak surge occurs at the\ntime of high tide...\n\nBritish and U.S. Virgin Islands except St. Croix...4 to 6 ft\nNorthern coast of Puerto Rico...2 to 4 ft\nSouthern coast of Puerto Rico and St. Croix...1 to 2 ft\n\nThe deepest water will occur along the immediate coast in areas of\nonshore winds, where the surge will be accompanied by large and\ndestructive waves.  Surge-related flooding depends on the relative\ntiming of the surge and the tidal cycle, and can vary greatly over\nshort distances.  For information specific to your area, please see\nproducts issued by your local National Weather Service forecast\noffice.\n\nWIND:  Hurricane conditions are expected within the hurricane\nwarning area by tonight, with tropical storm conditions\nbeginning later today. Tropical storm conditions are expected within\nthe tropical storm warning area where hurricane conditions are also\npossible.\n\nRAINFALL:  Irma is expected to produce total rainfall accumulations\nof 4 to 8 inches with isolated maximum amounts of 12 inches across\nthe northern Leeward Islands, the British and U.S. Virgin Islands,\nand Puerto Rico.  These rainfall amounts may cause life-threatening\nflash floods and mudslides.\n\nSURF:  Swells generated by Irma will affect the northern Leeward\nIslands, Puerto Rico, and the U.S. and British Virgin Islands\nduring the next several days.  These swells are likely to cause\nlife-threatening surf and rip current conditions. Please consult\nproducts from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 800 AM AST.\nNext complete advisory at 1100 AM AST.\n\n$$\nForecaster Avila\n\nNNNN",
    "messageBinNumber": "1",
    "messageDateTimeLocal": "20170905 05:00:00 AM AST",
    "messageDateTimeLocalStr": "0500 AM AST Tue Sep 05",
    "messageDateTimeUTC": "20170905 09:00:00 AM UTC",
    "messageDateTimeUTC24": "201709050900",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "W OR 270 DEGREES",
    "systemGeoRefPt1": "ABOUT 320 MI...515 KM E OF THE LEEWARD ISLANDS",
    "systemIntensityKph": "240",
    "systemIntensityKts": "130",
    "systemIntensityMph": "150",
    "systemMslpInHg": "27.67",
    "systemMslpMb": "937",
    "systemName": "IRMA",
    "systemSaffirSimpsonCategory": "CATEGORY 4",
    "systemSpeedKph": "22",
    "systemSpeedKts": "12",
    "systemSpeedMph": "14",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1504602000"
  }
}
