{
  "cycloneMessage": {
    "advisoryNumber": "33",
    "atcfID": "AL112017",
    "centerLocLatitude": "20.0",
    "centerLocLatitudeExpanded": "20.0N",
    "centerLocLongitude": "-68.3",
    "centerLocLongitudeExpanded": "68.3W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT1 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Irma Advisory Number  33\nNWS National Hurricane Center Miami FL       AL112017\n500 AM AST Thu Sep 07 2017\n\n...EYE OF IRMA MOVING WEST-NORTHWESTWARD OFF THE NORTHERN COAST OF\nTHE DOMINICAN REPUBLIC...\n\n\nSUMMARY OF 500 AM AST...0900 UTC...INFORMATION\n----------------------------------------------\nLOCATION...20.0N 68.3W\nABOUT 95 MI...155 KM N OF PUNTA CANA DOMINICAN REPUBLIC\nABOUT 210 MI...335 KM ESE OF GRAND TURK ISLAND\nMAXIMUM SUSTAINED WINDS...180 MPH...285 KM/H\nPRESENT MOVEMENT...WNW OR 290 DEGREES AT 17 MPH...28 KM/H\nMINIMUM CENTRAL PRESSURE...921 MB...27.20 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe Government of the Bahamas has issued a Hurricane Warning for\nthe Northwestern Bahamas.\n\nAll warnings are discontinued for Puerto Rico, Vieques, and Culebra.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Warning is in effect for...\n* Dominican Republic from Cabo Engano to the northern border with\nHaiti\n* Haiti from the northern border with the Dominican Republic to Le\nMole St. Nicholas\n* Southeastern Bahamas and the Turks and Caicos Islands\n* Central Bahamas\n* Northwestern Bahamas\n\nA Hurricane Watch is in effect for...\n* Cuba from Matanzas province eastward to Guantanamo province\n\nA Tropical Storm Warning is in effect for...\n* Dominican Republic from south of Cabo Engano westward to the\nsouthern border with Haiti\n* Haiti from south of Le Mole St. Nicholas to Port-Au-Prince\n* Cuba provinces of Guantanamo, Holguin, and Las Tunas\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area.  Preparations to protect life and\nproperty should be rushed to completion.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours\nbefore the anticipated first occurrence of tropical-storm-force\nwinds, conditions that make outside preparations difficult or\ndangerous.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area.\n\nInterests elsewhere in the Dominican Republic and Haiti, as well as\nCuba and Florida should monitor the progress of Irma.  A Hurricane\nWatch will likely be required later today for portions of southern\nFlorida and the Florida Keys.\n\nFor storm information specific to your area, please monitor\nproducts issued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 500 AM AST (0900 UTC), the center of Hurricane Irma was located\nnear latitude 20.0 North, longitude 68.3 West. Irma is moving toward\nthe west-northwest near 17 mph (28 km/h), and this general motion is\nexpected to continue with some decrease in forward speed for the\nnext couple of days.  On the forecast track, the center should pass\nnorth of the coast of Hispaniola later today, be near the Turks and\nCaicos and southeastern Bahamas by this evening, and then be near\nthe Central Bahamas by Friday.\n\nMaximum sustained winds are near 180 mph (285 km/h) with higher\ngusts.  Irma is a category 5 hurricane on the Saffir-Simpson\nHurricane Wind Scale.  Some fluctuations in intensity are likely\nduring the next day or two, but Irma is forecast to remain a\npowerful category 4 or 5 hurricane during the next couple of days.\n\nHurricane-force winds extend outward up to 50 miles (85 km) from the\ncenter and tropical-storm-force winds extend outward up to 185 miles\n(295 km).\n\nThe estimated minimum central pressure is 921 mb (27.20 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nSTORM SURGE:  The combination of a life-threatening storm surge and\nlarge breaking waves will raise water levels ABOVE NORMAL TIDE\nLEVELS by the following amounts within the hurricane warning area\nnear and to the north of the center of Irma.  Near the coast, the\nsurge will be accompanied by large and destructive waves.\n\nTurks and Caicos Islands...15 to 20 ft\nSoutheastern and central Bahamas...15 to 20 ft\nNorthern coast of the Dominican Republic...3 to 5 ft\nNorthern coast of Haiti and the Gulf of Gonave...1 to 3 ft\nNorthern coast of Cuba in the warning area...5 to 10 ft\n\nWater levels around Puerto Rico should subside today.\n\nThe deepest water will occur along the immediate coast in areas of\nonshore winds, where the surge will be accompanied by large and\ndestructive waves.  Surge-related flooding depends on the relative\ntiming of the surge and the tidal cycle, and can vary greatly over\nshort distances.  For information specific to your area, please see\nproducts issued by your local National Weather Service forecast\noffice.\n\nWIND:  Hurricane conditions are expected to begin within the\nhurricane warning area in the Dominican Republic and Haiti today,\nwith tropical storm conditions beginning in the next few hours.\nHurricane conditions are expected to begin in the warning area in\nthe southeastern Bahamas and the Turks and Caicos Islands later\ntoday with tropical storm conditions expected within the next\nseveral hours.  These conditions will spread into the Central\nBahamas by Thursday night or early Friday.\n\nHurricane and tropical storm conditions are possible within the\nwatch area in Cuba by Friday.  Tropical storm conditions are\nexpected to begin within the warning area in Cuba Thursday night.\nHuricane conditions are expected in the northwestern Bahamas Friday\nnight and Saturday.\n\nRAINFALL: Irma is expected to produce the following rain\naccumulations through Saturday:\n\nNortheast Puerto Rico and the British and U.S. Virgin Islands...An\nadditional 2 to 4 inches.\nSoutheast Bahamas, Central Bahamas, and the Turks and Caicos...8 to\n12 inches, isolated 20 inches.\nNorthern Dominican Republic and northern Haiti...4 to 10 inches,\nisolated 15 inches.\nEastern and Central Cuba...4 to 10 inches, isolated 15 inches.\nSouthern Haiti...1 to 4 inches.\n\nIn all areas this rainfall may cause life-threatening flash floods\nand mudslides.\n\nSURF:  Swells generated by Irma are affecting the northern Leeward\nIslands, Puerto Rico, the Virgin Islands, the southeastern Bahamas,\nthe Turks and Caicos Islands, the northern coast of the Dominican\nRepublic, and they should start affecting portions of the southeast\ncoast of the United States later today and tonight.  These swells\nare likely to cause life-threatening surf and rip current\nconditions.  Please consult products from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 800 AM AST.\nNext complete advisory at 1100 AM AST.\n\n$$\nForecaster Beven\n\nNNNN",
    "messageBinNumber": "1",
    "messageDateTimeLocal": "20170907 05:00:00 AM AST",
    "messageDateTimeLocalStr": "0500 AM AST Thu Sep 07",
    "messageDateTimeUTC": "20170907 09:00:00 AM UTC",
    "messageDateTimeUTC24": "201709070900",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "WNW OR 290 DEGREES",
    "systemGeoRefPt1": "ABOUT 95 MI...155 KM N OF PUNTA CANA DOMINICAN REPUBLIC",
    "systemGeoRefPt2": "ABOUT 210 MI...335 KM ESE OF GRAND TURK ISLAND",
    "systemIntensityKph": "285",
    "systemIntensityKts": "155",
    "systemIntensityMph": "180",
    "systemMslpInHg": "27.20",
    "systemMslpMb": "921",
    "systemName": "IRMA",
    "systemSaffirSimpsonCategory": "CATEGORY 5",
    "systemSpeedKph": "28",
    "systemSpeedKts": "15",
    "systemSpeedMph": "17",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1504774800"
  }
}
