{
  "cycloneMessage": {
    "advisoryNumber": "37A",
    "atcfID": "AL112017",
    "centerLocLatitude": "21.8",
    "centerLocLatitudeExpanded": "21.8N",
    "centerLocLongitude": "-74.7",
    "centerLocLongitudeExpanded": "74.7W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT1 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Irma Intermediate Advisory Number 37A\nNWS National Hurricane Center Miami FL       AL112017\n800 AM EDT Fri Sep 08 2017\n\n...CORE OF HURRICANE IRMA FORECAST TO MOVE BETWEEN THE CENTRAL\nBAHAMAS AND THE NORTH COAST OF CUBA TODAY...\n\n\nSUMMARY OF 800 AM EDT...1200 UTC...INFORMATION\n----------------------------------------------\nLOCATION...21.8N 74.7W\nABOUT 80 MI...125 KM NE OF CABO LUCRECIA CUBA\nABOUT 450 MI...720 KM SE OF MIAMI FLORIDA\nMAXIMUM SUSTAINED WINDS...150 MPH...240 KM/H\nPRESENT MOVEMENT...WNW OR 285 DEGREES AT 16 MPH...26 KM/H\nMINIMUM CENTRAL PRESSURE...927 MB...27.37 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe Hurricane and Tropical Storm Warnings for Haiti have been\ndiscontinued.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Warning is in effect for...\n* Jupiter Inlet southward around the Florida peninsula to Bonita\nBeach\n* Florida Keys\n\nA Storm Surge Watch is in effect for...\n* North of Jupiter Inlet to Sebastian Inlet\n* North of Bonita Beach to Venice\n\nA Hurricane Warning is in effect for...\n* Jupiter Inlet southward around the Florida peninsula to Bonita\nBeach\n* Florida Keys\n* Lake Okeechobee\n* Florida Bay\n* Southeastern Bahamas and the Turks and Caicos Islands\n* Cuban provinces of Camaguey, Ciego de Avila, Sancti Spiritus, and\nVilla Clara\n* Central Bahamas\n* Northwestern Bahamas\n\nA Hurricane Watch is in effect for...\n* North of Jupiter Inlet to Sebastian Inlet\n* North of Bonita Beach to Anna Maria Island\n* Cuban provinces of Guantanamo, Holguin, Las Tunas and Matanzas\n\nA Tropical Storm Warning is in effect for...\n* Cuban provinces of Guantanamo, Holguin, and Las Tunas\n\nA Storm Surge Warning means there is a danger of life-threatening\ninundation, from rising water moving inland from the coastline,\nduring the next 36 hours in the indicated locations. For a\ndepiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.  This is a life-threatening situation.  Persons\nlocated within these areas should take all necessary actions to\nprotect life and property from rising water and the potential for\nother dangerous conditions.  Promptly follow evacuation and other\ninstructions from local officials.\n\nA Storm Surge Watch means there is a possibility of life-\nthreatening inundation, from rising water moving inland from the\ncoastline, in the indicated locations during the next 48 hours.\nFor a depiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area.  Preparations to protect life and\nproperty should be rushed to completion.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours\nbefore the anticipated first occurrence of tropical-storm-force\nwinds, conditions that make outside preparations difficult or\ndangerous.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area.\n\nInterests elsewhere in Cuba, Florida, and the southeastern United\nStates should monitor the progress of Irma.\n\nFor storm information specific to your area in the United\nStates, including possible inland watches and warnings, please\nmonitor products issued by your local National Weather Service\nforecast office. For storm information specific to your area outside\nthe United States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 800 AM EDT (1200 UTC), the eye of Hurricane Irma was located near\nlatitude 21.8 North, longitude 74.7 West. Irma is moving toward the\nwest-northwest near 16 mph (26 km/h), and this motion is expected to\ncontinue for the next day or so with a decrease in forward speed.  A\nturn toward the northwest is expected by late Saturday.  On the\nforecast track, the eye of Irma should move near the north coast\nof Cuba and the central Bahamas today and Saturday, and be near the\nFlorida Keys and the southern Florida Peninsula Sunday morning.\n\nMaximum sustained winds are near 150 mph (240 km/h) with higher\ngusts.  Irma is a category 4 hurricane on the Saffir-Simpson\nHurricane Wind Scale.  Some fluctuations in intensity are likely\nduring the next day or two, but Irma is forecast to remain a\npowerful category 4 hurricane as it approaches Florida.\n\nHurricane-force winds extend outward up to 70 miles (110 km) from\nthe center and tropical-storm-force winds extend outward up to 185\nmiles (295 km).\n\nThe latest minimum central pressure reported by a reconnaissance\nplane was 927 mb (27.37 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following HEIGHTS ABOVE GROUND if the peak\nsurge occurs at the time of high tide...\n\nJupiter Inlet to Bonita Beach, including Florida Keys...5 to 10 ft\nBonita Beach to Venice...3 to 5 ft\nJupiter Inlet to Sebastian Inlet...3 to 6 ft\n\nThe deepest water will occur along the immediate coast in areas of\nonshore winds, where the surge will be accompanied by large and\ndestructive waves.  Surge-related flooding depends on the relative\ntiming of the surge and the tidal cycle, and can vary greatly over\nshort distances.  For information specific to your area, please see\nproducts issued by your local National Weather Service forecast\noffice.\n\nThe combination of a life-threatening storm surge and large breaking\nwaves will raise water levels ABOVE NORMAL TIDE LEVELS by the\nfollowing amounts within the hurricane warning area near and to the\nnorth of the center of Irma.  Near the coast, the surge will be\naccompanied by large and destructive waves.\n\nTurks and Caicos Islands...15 to 20 ft\nSoutheastern and central Bahamas...15 to 20 ft\nNorthwestern Bahamas...5 to 10 ft\nNorthern coast of Haiti and the Gulf of Gonave...1 to 3 ft\nNorthern coast of Cuba in the warning area...5 to 10 ft\n\nWIND:  Hurricane conditions are occurring on the Turks and Caicos\nIslands, with tropical storm and hurricane conditions ongoing in the\nsoutheastern Bahamas.  These conditions will move into the central\nBahamas later today.  Hurricane conditions are expected within the\nhurricane warning area along the north coast of Cuba late today and\nSaturday.  Hurricane conditions are expected in the northwestern\nBahamas tonight and Saturday, and in portions of southern Florida\nand the Florida Keys Saturday night or early Sunday.\n\nHurricane conditions are possible within the watch area in Florida\nby Sunday, with tropical storm conditions possible by late Saturday.\n\nRAINFALL: Irma is expected to produce the following rain\naccumulations through Tuesday night:\n\nNorthern Dominican Republic and northern Haiti...additional 2 to 4\ninches.\nSouthern Dominican Republic and southern Haiti...additional 1 to 2\ninches.\nTurks and Caicos...additional 3 to 6 inches.\nSouthern Bahamas and northern Cuba...10 to 15 inches, isolated 20\ninches.\nSouthern Cuba...4 to 8 inches, isolated 12 inches.\nThe upper Florida Keys into southeast Florida...10 to 15 inches,\nisolated 20 inches.\nEastern Florida northward into coastal Georgia...8 to 12 inches,\nisolated 16 inches.\nLower Florida Keys...3 to 5 inches.\nWestern Florida Peninsula into much of Georgia...South\nCarolina...and Western North Carolina...3 to 6 inches.\n\nIn all areas this rainfall may cause life-threatening flash floods\nand in some areas mudslides.\n\nSURF:  Swells generated by Irma are affecting Puerto Rico, the\nVirgin Islands, the southeastern Bahamas, the Turks and Caicos\nIslands, the northern coast of the Dominican Republic, and should\nstart affecting portions of the southeast coast of the United States\nlater today and tonight.  These swells are likely to cause\nlife-threatening surf and rip current conditions.  Please consult\nproducts from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 1100 AM EDT.\n\n$$\nForecaster Avila\n\nNNNN",
    "messageBinNumber": "1",
    "messageDateTimeLocal": "20170908 08:00:00 AM EDT",
    "messageDateTimeLocalStr": "0800 AM EDT Fri Sep 08",
    "messageDateTimeUTC": "20170908 12:00:00 PM UTC",
    "messageDateTimeUTC24": "201709081200",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "WNW OR 285 DEGREES",
    "systemGeoRefPt1": "ABOUT 80 MI...125 KM NE OF CABO LUCRECIA CUBA",
    "systemGeoRefPt2": "ABOUT 450 MI...720 KM SE OF MIAMI FLORIDA",
    "systemIntensityKph": "240",
    "systemIntensityKts": "130",
    "systemIntensityMph": "150",
    "systemMslpInHg": "27.37",
    "systemMslpMb": "927",
    "systemName": "IRMA",
    "systemSaffirSimpsonCategory": "CATEGORY 4",
    "systemSpeedKph": "26",
    "systemSpeedKts": "14",
    "systemSpeedMph": "16",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1504872000"
  }
}
