{
  "cycloneMessage": {
    "advisoryNumber": "50",
    "atcfID": "AL112017",
    "centerLocLatitude": "30.3",
    "centerLocLatitudeExpanded": "30.3N",
    "centerLocLongitude": "-83.1",
    "centerLocLongitudeExpanded": "83.1W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT1 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Irma Advisory Number  50\nNWS National Hurricane Center Miami FL       AL112017\n1100 AM EDT Mon Sep 11 2017\n\n...IRMA GRADUALLY WEAKENING WHILE MOVING OVER NORTHERN FLORIDA ...\n\n\nSUMMARY OF 1100 AM EDT...1500 UTC...INFORMATION\n-----------------------------------------------\nLOCATION...30.3N 83.1W\nABOUT 70 MI...115 KM E OF TALLAHASSEE FLORIDA\nABOUT 85 MI...135 KM N OF CEDAR KEY FLORIDA\nMAXIMUM SUSTAINED WINDS...65 MPH...100 KM/H\nPRESENT MOVEMENT...NNW OR 340 DEGREES AT 17 MPH...28 KM/H\nMINIMUM CENTRAL PRESSURE...975 MB...28.80 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe Storm Surge Warning has been discontinued from Bonita Beach\nsouthward.\n\nThe Tropical Storm Warning has been discontinued for Lake\nOkeechobee.\n\nThe Tropical Storm Warning has been discontinued from the\nVolusia/Brevard County line southward.\n\nThe Tropical Storm Warning has been discontinued south of Anclote\nRiver.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Warning is in effect for...\n* South Santee River southward to the Flagler/Volusia County line\n* North of Bonita Beach to the Ochlockonee River\n* Tampa Bay\n\nA Tropical Storm Warning is in effect for...\n* Anclote River to the Okaloosa/Walton County Line\n* North of the Volusia/Brevard County line to the South Santee\nRiver\n\nA Storm Surge Warning means there is a danger of life-threatening\ninundation, from rising water moving inland from the coastline,\nduring the next 36 hours in the indicated locations. For a\ndepiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.  This is a life-threatening situation.  Persons\nlocated within these areas should take all necessary actions to\nprotect life and property from rising water and the potential for\nother dangerous conditions.  Promptly follow evacuation and other\ninstructions from local officials.\n\nInterests elsewhere in the southeastern United States should monitor\nthe progress of Irma.\n\nFor storm information specific to your area in the United\nStates, including possible inland watches and warnings, please\nmonitor products issued by your local National Weather Service\nforecast office.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 1100 AM EDT (1500 UTC), the center of Tropical Storm Irma was\nlocated near latitude 30.3 North, longitude 83.1 West.  Irma is\nmoving toward the north-northwest near 17 mph (28 km/h), and this\nmotion is expected to continue through Tuesday.  On the forecast\ntrack, the center of Irma will move into southwestern Georgia later\ntoday, and move into eastern Alabama Tuesday morning.\n\nMaximum sustained winds have decreased to near 65 mph (100 km/h)\nwith higher gusts.  Continued slow weakening is forecast, and Irma\nis likely to become a tropical depression on Tuesday.\n\nIrma remains a large tropical cyclone.  Tropical-storm-force winds\nextend outward up to 415 miles (665 km) from the center.  A 60 mph\n(96 km/h) sustained wind and a 69 mph (111 km/h) gust was recently\nreported at the National Data Buoy Center C-MAN station in St.\nAugustine.\n\nThe estimated minimum central pressure is 975 mb (28.80 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following HEIGHTS ABOVE GROUND if the peak\nsurge occurs at the time of high tide...\n\nClearwater Beach to Ochlockonee River...4 t 6 ft\nAnna Maria Island to Clearwater, including Tampa Bay...2 to 4 ft\nCaptiva to Anna Maria Island...3 to 5 ft\nBonita Beach to Captiva...2 to 4 ft\n\nSouth Santee River to Fernandina Beach...4 to 6 ft\nFernandina Beach to Flagler/Volusia County line, including the\nSt. Johns River...3 to 5 ft\n\nThe deepest water will occur along the immediate coast in areas of\nonshore winds, where the surge will be accompanied by large and\ndestructive waves.  Surge-related flooding depends on the relative\ntiming of the surge and the tidal cycle, and can vary greatly over\nshort distances.  For information specific to your area, please see\nproducts issued by your local National Weather Service forecast\noffice.\n\nWIND: Tropical storm conditions will continue across portions of the\ncentral and northern Florida peninsula and southern Georgia.\nTropical storm conditions are spreading into the eastern Florida\nPanhandle.  Tropical storm conditions are also expected to spread\nnorthward across the remainder of the warning area through today.\n\nRainfall:  Irma is expected to produce the following rain\naccumulations through Wednesday:\n\nNorthern Florida peninsula and southern Georgia: additional 3 to 6\ninches with storm total amounts of 8 to 15 inches.\n\nCentral Georgia, eastern Alabama and southern South Carolina: 3 to\ninches, isolated 10 inches.\n\nCentral Florida Panhandle, western Alabama, northern Mississippi,\nsouthern Tennessee, northern Georgia, northern South Carolina and\nwestern North Carolina: 2 to 4 inches.\n\nThe precipitation threat for most of the Florida peninsula, except\nfor the northernmost portions, has diminished.  Scattered showers\nare expected to produce additional rainfall amounts of less than an\ninch across most of the Florida peninsula during Monday.\n\nTORNADOES:  A few tornadoes are possible today and tonight near the\nGeorgia and South Carolina coasts.\n\nSURF:  Swells generated by Irma are affecting the southeast coast of\nthe United States.  These swells are likely to cause life-\nthreatening surf and rip current conditions.  Please consult\nproducts from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 200 PM EDT.\nNext complete advisory at 500 PM EDT.\n\n$$\nForecaster Pasch\n\nNNNN",
    "messageBinNumber": "1",
    "messageDateTimeLocal": "20170911 11:00:00 AM EDT",
    "messageDateTimeLocalStr": "1100 AM EDT Mon Sep 11",
    "messageDateTimeUTC": "20170911 03:00:00 PM UTC",
    "messageDateTimeUTC24": "201709111500",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "NNW OR 340 DEGREES",
    "systemGeoRefPt1": "ABOUT 70 MI...115 KM E OF TALLAHASSEE FLORIDA",
    "systemGeoRefPt2": "ABOUT 85 MI...135 KM N OF CEDAR KEY FLORIDA",
    "systemIntensityKph": "100",
    "systemIntensityKts": "55",
    "systemIntensityMph": "65",
    "systemMslpInHg": "28.80",
    "systemMslpMb": "975",
    "systemName": "IRMA",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "28",
    "systemSpeedKts": "15",
    "systemSpeedMph": "17",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1505142000"
  }
}
