{
  "cycloneMessage": {
    "advisoryNumber": "57",
    "atcfID": "AL122017",
    "centerLocLatitude": "36.5",
    "centerLocLatitudeExpanded": "36.5N",
    "centerLocLongitude": "-71.7",
    "centerLocLongitudeExpanded": "71.7W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT2 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Jose Advisory Number  57\nNWS National Hurricane Center Miami FL       AL122017\n1100 AM EDT Tue Sep 19 2017\n\n...JOSE MAINTAINING STATUS AS A CATEGORY 1 HURRICANE...\n...DANGEROUS SURF AND RIP CURRENTS EXPECTED TO CONTINUE ALONG\nTHE EAST COAST OF THE UNITED STATES FOR SEVERAL MORE DAYS...\n\n\nSUMMARY OF 1100 AM EDT...1500 UTC...INFORMATION\n-----------------------------------------------\nLOCATION...36.5N 71.7W\nABOUT 230 MI...370 KM ENE OF CAPE HATTERAS NORTH CAROLINA\nABOUT 335 MI...545 KM SSW OF NANTUCKET MASSACHUSETTS\nMAXIMUM SUSTAINED WINDS...75 MPH...120 KM/H\nPRESENT MOVEMENT...N OR 355 DEGREES AT 7 MPH...11 KM/H\nMINIMUM CENTRAL PRESSURE...976 MB...28.82 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe Tropical Storm Watch has been discontinued from New Haven to\nWatch Hill.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Tropical Storm Warning is in effect for...\n* Watch Hill to Hull\n* Block Island\n* Martha's Vineyard\n* Nantucket\n\nA Tropical Storm Watch is in effect for...\n* The coast of Long Island from Fire Island Inlet to Port Jefferson\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area within 36 hours.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, in this case within the next 24 to\n36 hours.\n\nInterests elsewhere along the U.S. east coast from North Carolina\nnorthward to New England should monitor the progress of Jose.\n\nFor storm information specific to your area, including possible\ninland watches and warnings, please monitor products issued by your\nlocal National Weather Service forecast office.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 1100 AM EDT (1500 UTC), the center of Hurricane Jose was located\nby an an Air Force Reserve Hurricane Hunter aircraft near latitude\n36.5 North, longitude 71.7 West. Jose is moving toward the north\nnear 7 mph (11 km/h). This general motion is expected to continue\nthrough today with a turn to the northeast anticipated tonight.  On\nthe forecast track, the center of Jose is forecast to pass well\noffshore of the Delmarva peninsula later today, pass well to the\neast of the New Jersey coast on Wednesday, and pass offshore of\nsoutheastern Massachusetts by Thursday.\n\nMaximum sustained winds remain near 75 mph (120 km/h) with higher\ngusts. Little change in strength is expected today, but Jose should\nbegin to gradually weaken on Wednesday.\n\nHurricane-force winds extend outward up to 60 miles (95 km) from the\ncenter and tropical-storm-force winds extend outward up to 310 miles\n(500 km).  NOAA Buoy 44014, located east of the Virginia-North\nCarolina border or about 160 miles west of the center of Jose,\nrecently reported a sustained wind of 40 mph (65 km/h).\n\nThe minimum central pressure recently reported by the reconnaissance\naircraft was 976 mb (28.82 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nWIND:  Tropical storm conditions are expected to begin in the\nwarning area early Wednesday.  Tropical storm conditions are\npossible in the watch area beginning tonight.\n\nSURF:  Swells generated by Jose are affecting Bermuda, the Bahamas,\nand much of the U.S. east coast.  These swells are likely to cause\ndangerous surf and rip current conditions for the next several\ndays in these areas.  For more information, please consult products\nfrom your local weather office.\n\nRAINFALL:  Jose is expected to produce total rain accumulations of\n1 to 3 inches over eastern Long Island, southeast Connecticut,\nsouthern Rhode Island, and southeast Massachusetts. Rainfall\namounts of 3 to 5 inches are expected for Martha's Vineyard,\nNantucket and Cape Cod through Wednesday.  This rainfall could cause\nisolated flooding.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 200 PM EDT.\nNext complete advisory at 500 PM EDT.\n\n$$\nForecaster Stewart\n\nNNNN",
    "messageBinNumber": "2",
    "messageDateTimeLocal": "20170919 11:00:00 AM EDT",
    "messageDateTimeLocalStr": "1100 AM EDT Tue Sep 19",
    "messageDateTimeUTC": "20170919 03:00:00 PM UTC",
    "messageDateTimeUTC24": "201709191500",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "N OR 355 DEGREES",
    "systemGeoRefPt1": "ABOUT 230 MI...370 KM ENE OF CAPE HATTERAS NORTH CAROLINA",
    "systemGeoRefPt2": "ABOUT 335 MI...545 KM SSW OF NANTUCKET MASSACHUSETTS",
    "systemIntensityKph": "120",
    "systemIntensityKts": "65",
    "systemIntensityMph": "75",
    "systemMslpInHg": "28.82",
    "systemMslpMb": "976",
    "systemName": "JOSE",
    "systemSaffirSimpsonCategory": "CATEGORY 1",
    "systemSpeedKph": "11",
    "systemSpeedKts": "6",
    "systemSpeedMph": "7",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1505833200"
  }
}
