{
  "cycloneMessage": {
    "advisoryNumber": "16",
    "atcfID": "AL122017",
    "centerLocLatitude": "17.5",
    "centerLocLatitudeExpanded": "17.5N",
    "centerLocLongitude": "-60.3",
    "centerLocLongitudeExpanded": "60.3W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT2 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Jose Advisory Number  16\nNWS National Hurricane Center Miami FL       AL122017\n500 AM AST Sat Sep 09 2017\n\n...JOSE HEADED TOWARD THE NORTHERN LEEWARD ISLANDS...\n\n\nSUMMARY OF 500 AM AST...0900 UTC...INFORMATION\n----------------------------------------------\nLOCATION...17.5N 60.3W\nABOUT 190 MI...305 KM ESE OF THE NORTHERN LEEWARD ISLANDS\nMAXIMUM SUSTAINED WINDS...150 MPH...240 KM/H\nPRESENT MOVEMENT...WNW OR 300 DEGREES AT 13 MPH...20 KM/H\nMINIMUM CENTRAL PRESSURE...940 MB...27.76 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Warning is in effect for...\n* Barbuda and Anguilla\n* Sint Maarten\n* St. Martin\n* St. Barthelemy\n\nA Hurricane Watch is in effect for...\n* Antigua\n\nA Tropical Storm Warning is in effect for...\n* Antigua\n* Saba and St. Eustatius\n\nA Tropical Storm Watch is in effect for...\n* Montserrat, St Kitts, and Nevis\n* British Virgin Islands\n* St. Thomas and St. John\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area, in this case within 24 hours.\nPreparations to protect life and property should be rushed to\ncompletion.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area within 36 hours.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area, in this case within 24 hours.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, generally within 48 hours.\n\nFor storm information specific to your area in the United\nStates, including possible inland watches and warnings, please\nmonitor products issued by your local National Weather Service\nforecast office. For storm information specific to your area outside\nthe United States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 500 AM AST (0900 UTC), the center of Hurricane Jose was located\nnear latitude 17.5 North, longitude 60.3 West. Jose is moving toward\nthe west-northwest near 13 mph (20 km/h).  A continued\nwest-northwest to northwest motion is expected during the next\ncouple of days.  On the forecast track, the core of Jose will pass\nclose to or just east of the northern Leeward Islands today.\n\nMaximum sustained winds are near 150 mph (240 km/h) with higher\ngusts.  Jose is a category 4 hurricane on the Saffir-Simpson\nHurricane Wind Scale.  Some fluctuation in intensity, up or down,\ncould occur during the next 24 hours.  Afterward, gradual weakening\nis expected to occur.\n\nHurricane-force winds extend outward up to 35 miles (55 km) from the\ncenter and tropical-storm-force winds extend outward up to 140 miles\n(220 km).\n\nThe estimated minimum central pressure is 940 mb (27.76 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nWIND:  Hurricane conditions are expected within the hurricane\nwarning area today.  Hurricane conditions are also possible within\nthe hurricane watch area today.  Tropical storm conditions are\nexpected within the tropical storm warning areas by this morning.\nTropical storm conditions are possible in the tropical storm watch\narea in the northeastern Leeward Islands by this morning and in the\nwatch area in the Virgin Islands by tonight.\n\nRAINFALL:  Jose is expected to produce total rain accumulations of\n3 to 5 inches in the Leeward Islands from Guadeloupe to Anguilla,\nwith isolated maximum amounts of 8 inches. Jose is also expected to\nproduce total rain accumulations of 1 to 3 inches over the Virgin\nIslands and Dominica. This rainfall will maintain any ongoing\nflooding and may cause additional life-threatening flooding.\n\nSTORM SURGE:  A dangerous storm surge will raise water levels by\n2 to 4 feet above normal tide levels along the immediate coast in\nthe hurricane warning areas.  Near the coast, the surge will be\naccompanied by large and destructive waves.\n\nSURF:  Swells generated by Jose are affecting portions of the\nLeeward Islands.  These swells are expected to continue for a couple\nof days, and could cause life-threatening surf and rip current\nconditions.  Please consult products from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 800 AM AST.\nNext complete advisory at 1100 AM AST.\n\n$$\nForecaster Roberts\n\nNNNN",
    "messageBinNumber": "2",
    "messageDateTimeLocal": "20170909 05:00:00 AM AST",
    "messageDateTimeLocalStr": "0500 AM AST Sat Sep 09",
    "messageDateTimeUTC": "20170909 09:00:00 AM UTC",
    "messageDateTimeUTC24": "201709090900",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "WNW OR 300 DEGREES",
    "systemGeoRefPt1": "ABOUT 190 MI...305 KM ESE OF THE NORTHERN LEEWARD ISLANDS",
    "systemIntensityKph": "240",
    "systemIntensityKts": "130",
    "systemIntensityMph": "150",
    "systemMslpInHg": "27.76",
    "systemMslpMb": "940",
    "systemName": "JOSE",
    "systemSaffirSimpsonCategory": "CATEGORY 4",
    "systemSpeedKph": "20",
    "systemSpeedKts": "11",
    "systemSpeedMph": "13",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1504947600"
  }
}
