{
  "cycloneMessage": {
    "advisoryNumber": "17",
    "atcfID": "AL122017",
    "centerLocLatitude": "18.3",
    "centerLocLatitudeExpanded": "18.3N",
    "centerLocLongitude": "-61.3",
    "centerLocLongitudeExpanded": "61.3W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT2 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Jose Advisory Number  17\nNWS National Hurricane Center Miami FL       AL122017\nIssued by the NWS Weather Prediction Center College Park MD\n1100 AM AST Sat Sep 09 2017\n\n...JOSE REMAINS A DANGEROUS CATEGORY FOUR HURRICANE...\n\n\nSUMMARY OF 1100 AM AST...1500 UTC...INFORMATION\n-----------------------------------------------\nLOCATION...18.3N 61.3W\nABOUT 120 MI...190 KM E OF THE NORTHERN LEEWARD ISLANDS\nMAXIMUM SUSTAINED WINDS...145 MPH...230 KM/H\nPRESENT MOVEMENT...NW OR 305 DEGREES AT 13 MPH...20 KM/H\nMINIMUM CENTRAL PRESSURE...945 MB...27.91 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe Tropical Storm Watch for St. Thomas and St. John in the U.S.\nVirgin Island has been discontinued.\n\nThe government of Antigua has discontinued the Tropical Storm\nWatch for Antigua and the British Virgin Islands.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Warning is in effect for...\n* Sint Maarten\n* St. Martin\n* St. Barthelemy\n\nA Tropical Storm Warning is in effect for...\n* Barbuda and Anguilla\n* Saba and St. Eustatius\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area, in this case within 24 hours.\nPreparations to protect life and property should be rushed to\ncompletion.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area within 36 hours.\n\nFor storm information specific to your area outside the United\nStates, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 1100 AM AST (1500 UTC), the center of Hurricane Jose was located\nnear latitude 18.3 North, longitude 61.3 West. Jose is moving toward\nthe northwest near 13 mph (20 km/h).  A continued northwest motion\nis expected during the next couple of days.  On the forecast track,\nthe core of Jose will pass just north of the northern Leeward\nIslands later today.\n\nMaximum sustained winds are near 145 mph (230 km/h) with higher\ngusts.  Jose is a category 4 hurricane on the Saffir-Simpson\nHurricane Wind Scale.  Gradual weakening is expected to occur over\nthe next couple of days.\n\nHurricane-force winds extend outward up to 35 miles (55 km) from the\ncenter and tropical-storm-force winds extend outward up to 140 miles\n(220 km).\n\nThe latest minimum central pressure reported by an Air Force\nReserve reconnaissance aircraft is 945 mb (27.91 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nWIND:  Hurricane conditions are expected within the hurricane\nwarning area today. Tropical storm conditions are expected within\nthe tropical storm warning areas through this evening.\n\nRAINFALL:  Jose is expected to produce total rain accumulations of\n2 to 4 inches in the portions of Northern Leeward Islands, with\nwith isolated maximum amounts of 6 inches. This rainfall will\nmaintain any ongoing flooding and may cause additional\nlife-threatening flooding.\n\nSTORM SURGE:  A dangerous storm surge will raise water levels by\n1 to 3 feet above normal tide levels along the immediate coast in\nthe hurricane warning and tropical storm warning areas.  Near the\ncoast, the surge will be accompanied by large and destructive waves.\n\nSURF:  Swells generated by Jose are affecting portions of the\nLeeward Islands.  These swells are expected to continue for a couple\nof days, and could cause life-threatening surf and rip current\nconditions.  Please consult products from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 200 PM AST.\nNext complete advisory at 500 PM AST.\n\n$$\nForecaster Brown/Cohen\n\nNNNN",
    "messageBinNumber": "2",
    "messageDateTimeLocal": "20170909 11:00:00 AM AST",
    "messageDateTimeLocalStr": "1100 AM AST Sat Sep 09",
    "messageDateTimeUTC": "20170909 03:00:00 PM UTC",
    "messageDateTimeUTC24": "201709091500",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "NW OR 305 DEGREES",
    "systemGeoRefPt1": "ABOUT 120 MI...190 KM E OF THE NORTHERN LEEWARD ISLANDS",
    "systemIntensityKph": "230",
    "systemIntensityKts": "125",
    "systemIntensityMph": "145",
    "systemMslpInHg": "27.91",
    "systemMslpMb": "945",
    "systemName": "JOSE",
    "systemSaffirSimpsonCategory": "CATEGORY 4",
    "systemSpeedKph": "20",
    "systemSpeedKts": "11",
    "systemSpeedMph": "13",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1504969200"
  }
}
