{
  "cycloneMessage": {
    "advisoryNumber": "13",
    "atcfID": "AL122017",
    "centerLocLatitude": "16.3",
    "centerLocLatitudeExpanded": "16.3N",
    "centerLocLongitude": "-57.1",
    "centerLocLongitudeExpanded": "57.1W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT2 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Jose Advisory Number  13\nNWS National Hurricane Center Miami FL       AL122017\n1100 AM AST Fri Sep 08 2017\n\n...JOSE NOW AN EXTREMELY DANGEROUS CATEGORY 4 HURRICANE...\n\n\nSUMMARY OF 1100 AM AST...1500 UTC...INFORMATION\n-----------------------------------------------\nLOCATION...16.3N 57.1W\nABOUT 415 MI...670 KM ESE OF THE NORTHERN LEEWARD ISLANDS\nMAXIMUM SUSTAINED WINDS...150 MPH...240 KM/H\nPRESENT MOVEMENT...WNW OR 285 DEGREES AT 18 MPH...30 KM/H\nMINIMUM CENTRAL PRESSURE...942 MB...27.82 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nA Tropical Storm Watch has been issued for St. Thomas and St. John.\n\nThe government of Antigua has issued a Tropical Storm Watch for the\nBritish Virgin Islands\n\nThe government of France has issued a Tropical Storm Warning for\nSt. Martin and St. Barthelemy.\n\nThe government of Sint Maarten has issued a Tropical Storm Warning\nfor Sint Maarten.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Watch is in effect for...\n* Antigua, Barbuda, and Anguilla\n* Sint Maarten\n* St. Martin\n* St. Barthelemy\n\nA Tropical Storm Warning is in effect for...\n* Antigua, Barbuda, and Anguilla\n* St. Martin\n* St. Barthelemy\n* Sint Maarten\n\nA Tropical Storm Watch is in effect for...\n* Montserrat, St Kitts, and Nevis\n* Saba and St. Eustatius\n* British Virgin Islands\n* St. Thomas and St. John\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area, in this case within 36 hours.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area within 36 hours.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, generally within 48 hours.\n\nFor storm information specific to your area in the United\nStates, including possible inland watches and warnings, please\nmonitor products issued by your local National Weather Service\nforecast office. For storm information specific to your area outside\nthe United States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 1100 AM AST (1500 UTC), the eye of Hurricane Jose was located\nnear latitude 16.3 North, longitude 57.1 West. Jose is moving toward\nthe west-northwest near 18 mph (30 km/h).  A gradual turn toward\nthe northwest with a decrease in forward speed is expected during\nthe next 48 hours.  On the forecast track, the center of Jose will\npass near or east of the northeastern Leeward Islands on Saturday.\n\nRecent data from an Air Force Hurricane Hunter plane indicate that\nmaximum sustained winds are near 150 mph (240 km/h) with higher\ngusts.  Jose is a category 4 hurricane on the Saffir-Simpson\nHurricane Wind Scale.  Some fluctuations in intensity are possible\nfor the next day or so, and gradual weakening is expected after\nthat.\n\nHurricane-force winds extend outward up to 35 miles (55 km) from the\ncenter and tropical-storm-force winds extend outward up to 115 miles\n(185 km).\n\nThe minimum central pressure indicated by data from the aircraft is\n942 mb (27.82 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nWIND:  Hurricane conditions are possible within the hurricane watch\narea on Saturday, and tropical storm conditions are expected within\nthe tropical storm warning areas by Saturday morning. Tropical storm\nconditions are possible in the tropical storm watch area in the\nnortheastern Leeward Islands by Saturday morning and in the watch\narea in the Virgin Islands by Saturday night.\n\nRAINFALL:  Jose is expected to produce total rain accumulations of\n3 to 5 inches in the Leeward Islands from Guadeloupe to Anguilla,\nwith isolated maximum amounts of 8 inches. Jose is also expected to\nproduce total rain accumulations of 1 to 3 inches over the Virgin\nIslands and Dominica. This rainfall will maintain any ongoing\nflooding and may cause additional life-threatening flooding.\n\nSURF:  Swells generated by Jose are expected to affect portions of\nthe Leeward Islands by later today.  These swells are likely to\ncause life-threatening surf and rip current conditions.  Please\nconsult products from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 200 PM AST.\nNext complete advisory at 500 PM AST.\n\n$$\nForecaster Zelinsky\n\nNNNN",
    "messageBinNumber": "2",
    "messageDateTimeLocal": "20170908 11:00:00 AM AST",
    "messageDateTimeLocalStr": "1100 AM AST Fri Sep 08",
    "messageDateTimeUTC": "20170908 03:00:00 PM UTC",
    "messageDateTimeUTC24": "201709081500",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "WNW OR 285 DEGREES",
    "systemGeoRefPt1": "ABOUT 415 MI...670 KM ESE OF THE NORTHERN LEEWARD ISLANDS",
    "systemIntensityKph": "240",
    "systemIntensityKts": "130",
    "systemIntensityMph": "150",
    "systemMslpInHg": "27.82",
    "systemMslpMb": "942",
    "systemName": "JOSE",
    "systemSaffirSimpsonCategory": "CATEGORY 4",
    "systemSpeedKph": "30",
    "systemSpeedKts": "16",
    "systemSpeedMph": "18",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1504882800"
  }
}
