{
  "cycloneMessage": {
    "advisoryNumber": "14",
    "atcfID": "AL132017",
    "centerLocLatitude": "20.6",
    "centerLocLatitudeExpanded": "20.6N",
    "centerLocLongitude": "-97.2",
    "centerLocLongitudeExpanded": "97.2W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT3 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Katia Advisory Number  14\nNWS National Hurricane Center Miami FL       AL132017\nIssued by the NWS Weather Prediction Center College Park MD\n1000 PM CDT Fri Sep 08 2017\n\n...KATIA MAKING LANDFALL NORTH OF TECOLUTLA MEXICO...\n\n\nSUMMARY OF 1000 PM CDT...0300 UTC...INFORMATION\n-----------------------------------------------\nLOCATION...20.6N 97.2W\nABOUT 120 MI...190 KM SSE OF TAMPICO MEXICO\nABOUT 115 MI...185 KM NW OF VERACRUZ MEXICO\nMAXIMUM SUSTAINED WINDS...75 MPH...120 KM/H\nPRESENT MOVEMENT...WSW OR 250 DEGREES AT 7 MPH...11 KM/H\nMINIMUM CENTRAL PRESSURE...988 MB...29.18 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Warning is in effect for...\n* Cabo Rojo to Laguna Verde\n\nA Tropical Storm Warning is in effect for...\n* North of Cabo Rojo to Rio Panuco\n* South of Laguna Verde to Puerto Veracruz\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area.  Preparations to protect life and\nproperty should be completed.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area.\n\nFor storm information specific to your area, please monitor\nproducts issued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 1000 PM CDT (0300 UTC), the center of Hurricane Katia was located\nnear latitude 20.6 North, longitude 97.2 West. Katia is moving\ntoward the west-southwest near 7 mph (11 km/h) and this motion is\nexpected to continue until dissipation on Saturday.\n\nMaximum sustained winds are near 75 mph (120 km/h) with higher\ngusts.  Rapid weakening is forecast during the next 24 hours.\n\nHurricane-force winds extend outward up to 15 miles (30 km) from the\ncenter and tropical-storm-force winds extend outward up to 65 miles\n(100 km).\n\nThe estimated minimum central pressure is 988 mb (29.18 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nSTORM SURGE:  A dangerous storm surge will raise water levels by\nas much as 5 to 8 feet above normal tide levels near and to the\nnorth of where Katia makes landfall.  Near the coast, the surge will\nbe accompanied by large and destructive waves.\n\nRAINFALL:  Katia is expected to produce total rain accumulations of\n10 to 15 inches over northern Veracruz, eastern Hidalgo, and\nPuebla.  Katia is also expected to produce total rain accumulations\nof 2 to 5 inches over southern Tamaulipas, eastern San Luis Potosi,\nwestern Hidalgo, eastern Queretaro, and southern Veracruz through\nSaturday evening.  Isolated maximum amounts of 25 inches are\npossible in northern Veracruz, eastern Hidalgo, Puebla, and San\nLuis Potosi. This rainfall will likely cause life-threatening flash\nfloods and mudslides, especially in areas of mountainous terrain.\n\nWIND:  Hurricane conditions are expected within portions of the\nhurricane warning area tonight or early Saturday, with tropical\nstorm conditions expected to continue within the tropical storm\nwarning areas.\n\nSURF:  Swells generated by Katia will continue to affect portions of\nthe coast of southeastern Mexico during the next couple of days.\nThese swells are likely to cause life-threatening surf and rip\ncurrent conditions. Please consult products from your local weather\noffice.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 100 AM CDT.\nNext complete advisory at 400 AM CDT.\n\n$$\nForecaster Roth/Lamers\n\nNNNN",
    "messageBinNumber": "3",
    "messageDateTimeLocal": "20170908 10:00:00 PM CDT",
    "messageDateTimeLocalStr": "1000 PM CDT Fri Sep 08",
    "messageDateTimeUTC": "20170909 03:00:00 AM UTC",
    "messageDateTimeUTC24": "201709090300",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "WSW OR 250 DEGREES",
    "systemGeoRefPt1": "ABOUT 120 MI...190 KM SSE OF TAMPICO MEXICO",
    "systemGeoRefPt2": "ABOUT 115 MI...185 KM NW OF VERACRUZ MEXICO",
    "systemIntensityKph": "120",
    "systemIntensityKts": "65",
    "systemIntensityMph": "75",
    "systemMslpInHg": "29.18",
    "systemMslpMb": "988",
    "systemName": "KATIA",
    "systemSaffirSimpsonCategory": "CATEGORY 1",
    "systemSpeedKph": "11",
    "systemSpeedKts": "6",
    "systemSpeedMph": "7",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1504926000"
  }
}
