{
  "cycloneMessage": {
    "advisoryNumber": "8A",
    "atcfID": "AL132017",
    "centerLocLatitude": "21.6",
    "centerLocLatitudeExpanded": "21.6N",
    "centerLocLongitude": "-94.6",
    "centerLocLongitudeExpanded": "94.6W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT3 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Katia Intermediate Advisory Number 8A\nNWS National Hurricane Center Miami FL       AL132017\n100 PM CDT Thu Sep 07 2017\n\n...KATIA EXPECTED TO BEGIN MOVING TOWARD THE COAST OF MEXICO AND\nSTRENGTHEN TONIGHT OR EARLY FRIDAY...\n\n\nSUMMARY OF 100 PM CDT...1800 UTC...INFORMATION\n----------------------------------------------\nLOCATION...21.6N 94.6W\nABOUT 215 MI...345 KM E OF TAMPICO MEXICO\nABOUT 195 MI...315 KM NNE OF VERACRUZ MEXICO\nMAXIMUM SUSTAINED WINDS...80 MPH...130 KM/H\nPRESENT MOVEMENT...STATIONARY\nMINIMUM CENTRAL PRESSURE...980 MB...28.94 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Warning is in effect for...\n* Cabo Rojo to Laguna Verde\n\nA Tropical Storm Warning is in effect for...\n* North of Cabo Rojo to Rio Panuco\n* South of Laguna Verde to Puerto Veracruz.\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area.  A warning is typically issued\n36 hours before the anticipated first occurrence of tropical-\nstorm-force winds, conditions that make outside preparations\ndifficult or dangerous.  Preparations to protect life and property\nshould be rushed to completion.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area within 36 hours.\n\nFor storm information specific to your area, please monitor\nproducts issued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 100 PM CDT (1800 UTC), the center of Hurricane Katia was located\nnear latitude 21.6 North, longitude 94.6 West.  Katia is stationary\nand little overall motion is anticipated through late today.\nHowever, the hurricane is forecast to turn west-southwestward and\napproach the coast within the warning area late Friday or early\nSaturday.\n\nMaximum sustained winds are near 80 mph (130 km/h) with higher\ngusts.  Some strengthening is forecast during the next 36 hours and\nKatia could be near major hurricane strength at landfall.\n\nKatia is a small tropical cyclone.  Hurricane-force winds extend\noutward up to 10 miles (20 km) from the center and\ntropical-storm-force winds extend outward up to 45 miles (75 km).\n\nThe estimated minimum central pressure is 980 mb (28.94 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nSTORM SURGE:  A dangerous storm surge will raise water levels by\nas much as 5 to 7 feet above normal tide levels near and to the\nnorth of where Katia makes landfall.  Near the coast, the surge will\nbe accompanied by large and destructive waves.\n\nRAINFALL: Katia is expected to produce total rain accumulations of\n10 to 15 inches over northern Veracruz and eastern Hidalgo, Puebla,\nand San Luis Potosi.  Katia is expected to produce total rain\naccumulations of 2 to 5 inches over southern Tamaulipas, central San\nLuis Potosi, western Hidalgo, eastern Queretaro, and southern\nVeracruz through Saturday evening.  Isolated maximum amounts of 25\ninches are possible in northern Veracruz and eastern Hidalgo,\nPuebla, and San Luis Potosi.  This rainfall may cause life-\nthreatening flash floods and mudslides, especially in areas of\nmountainous terrain.\n\nWIND:  Hurricane conditions are expected within portions of the\nhurricane warning area by Friday night or early Saturday, with\ntropical storm conditions expected within the tropical storm warning\nareas by late Friday.\n\nSURF:  Swells generated by Katia are expected to affect portions of\nthe coast of southeastern Mexico today.  These swells are likely to\ncause life-threatening surf and rip current conditions. Please\nconsult products from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 400 PM CDT.\n\n$$\nForecaster Pasch\n\nNNNN",
    "messageBinNumber": "3",
    "messageDateTimeLocal": "20170907 01:00:00 PM CDT",
    "messageDateTimeLocalStr": "0100 PM CDT Thu Sep 07",
    "messageDateTimeUTC": "20170907 06:00:00 PM UTC",
    "messageDateTimeUTC24": "201709071800",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "STATIONARY",
    "systemGeoRefPt1": "ABOUT 215 MI...345 KM E OF TAMPICO MEXICO",
    "systemGeoRefPt2": "ABOUT 195 MI...315 KM NNE OF VERACRUZ MEXICO",
    "systemIntensityKph": "130",
    "systemIntensityKts": "70",
    "systemIntensityMph": "80",
    "systemMslpInHg": "28.94",
    "systemMslpMb": "980",
    "systemName": "KATIA",
    "systemSaffirSimpsonCategory": "CATEGORY 1",
    "systemSpeedKph": "0",
    "systemSpeedKts": "0",
    "systemSpeedMph": "0",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1504807200"
  }
}
