{
  "cycloneMessage": {
    "advisoryNumber": "16A",
    "atcfID": "AL152017",
    "centerLocLatitude": "17.6",
    "centerLocLatitudeExpanded": "17.6N",
    "centerLocLongitude": "-65.1",
    "centerLocLongitudeExpanded": "65.1W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT5 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Maria Intermediate Advisory Number 16A\nNWS National Hurricane Center Miami FL       AL152017\n200 AM AST Wed Sep 20 2017\n\n...CORE OF POTENTIALLY CATASTROPHIC CATEGORY 5 HURRICANE MARIA\nEXPECTED TO REACH SOUTHEASTERN PUERTO RICO THIS MORNING...\n\n\nSUMMARY OF 200 AM AST...0600 UTC...INFORMATION\n----------------------------------------------\nLOCATION...17.6N 65.1W\nABOUT 20 MI...35 KM WSW OF ST. CROIX\nABOUT 85 MI...140 KM SE OF SAN JUAN PUERTO RICO\nMAXIMUM SUSTAINED WINDS...165 MPH...270 KM/H\nPRESENT MOVEMENT...WNW OR 300 DEGREES AT 10 MPH...17 KM/H\nMINIMUM CENTRAL PRESSURE...910 MB...26.87 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe government of the Netherlands has discontinued the Tropical\nStorm Warning for St. Eustatius.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Warning is in effect for...\n* U.S. Virgin Islands\n* British Virgin Islands\n* Puerto Rico, Culebra, and Vieques\n* Dominican Republic from Cabo Engano to Puerto Plata\n\nA Tropical Storm Warning is in effect for...\n* Saba\n* St. Maarten\n* Guadeloupe\n* Dominican Republic west of Puerto Plata to the northern border of\nthe Dominican Republic and Haiti\n* Dominican Republic west of Cabo Engano to Punta Palenque\n\nA Hurricane Watch is in effect for...\n* Saba and St. Eustatius\n* St. Maarten\n* St. Martin and St. Barthelemy\n* Dominican Republic from Isla Saona to Cabo Engano\n* Turks and Caicos Islands and the Southeastern Bahamas\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area.  Preparations to protect life and\nproperty should be rushed to completion.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours before\nthe anticipated first occurrence of tropical-storm-force winds,\nconditions that make outside preparations difficult or dangerous.\n\nInterests elsewhere in Hispaniola and the Bahamas should monitor the\nprogress of Maria.\n\nFor storm information specific to your area in the United\nStates, including possible inland watches and warnings, please\nmonitor products issued by your local National Weather Service\nforecast office.  For storm information specific to your area\noutside the United States, please monitor products issued by your\nnational meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 200 AM AST (0600 UTC), the eye of Hurricane Maria was located\nnear latitude 17.6 North, longitude 65.1 West.  Maria is moving\ntoward the west-northwest near 10 mph (17 km/h).  A west-northwest\nto northwest motion is expected to continue through today, followed\nby a northwestward motion on Thursday.  On the forecast track, the\neye of Maria will cross Puerto Rico today, and pass just north of\nthe northeast coast of the Dominican Republic tonight and Thursday.\n\nMaximum sustained winds are near 165 mph (270 km/h) with higher\ngusts.  Maria is a potentially catastrophic category 5 hurricane on\nthe Saffir-Simpson Hurricane Wind Scale.  Some fluctuations in\nintensity could occur before the hurricane reaches Puerto Rico, but\nMaria is forecast to remain an extremely dangerous category 4 or 5\nhurricane as it moves over Puerto Rico.  Slow weakening is expected\nafter the hurricane emerges over the Atlantic north of Puerto Rico\nand the Dominican Republic.\n\nHurricane-force winds extend outward up to 60 miles (95 km) from\nthe center, and tropical-storm-force winds extend outward up to 150\nmiles (240 km).  A sustained wind of 104 mph (167 km/h) with a wind\ngust to 137 mph (220 km/h) was reported within the hour in the\nwestern portion of St. Croix in the U.S. Virgin Islands.\n\nThe latest minimum central pressure estimated from Air Force\nHurricane Hunter observations is 910 mb (26.87 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nWIND:  Tropical storm conditions will continue in portions of the\nwarning area in the Leeward Islands this morning.  Tropical storm\nand hurricane conditions are occurring over the Virgin Islands and\nwill spread over Puerto Rico in the next few hours.  Hurricane\nconditions are expected within the Hurricane Warning area in the\nDominican Republic tonight, with tropical storm conditions\nexpected by later today.  Tropical storm conditions are expected in\nthe Tropical Storm Warning areas in the Dominican Republic later\ntoday.  Hurricane and tropical storm conditions are possible on\nThursday in the Turks and Caicos Islands and the southeastern\nBahamas.\n\nWind speeds atop and on the windward sides of hills and mountains\nand on high-rise buildings could be much stronger than the near-\nsurface winds indicated in this advisory.\n\nSTORM SURGE:  A dangerous storm surge accompanied by large and\ndestructive waves will raise water levels by as much as 7 to 11\nfeet above normal tide levels in portions of the hurricane warning\narea near the British Virgin Islands.\n\nA dangerous storm surge accompanied by large and destructive waves\nwill raise water levels by as much as 4 to 6 feet above normal tide\nlevels in the hurricane warning area in the Dominican Republic, and\n1 to 3 ft elsewhere along the northern coasts of the Dominican\nRepublic and Haiti.\n\nThe combination of a dangerous storm surge and the tide will cause\nnormally dry areas near the coast to be flooded by rising waters\nmoving inland from the shoreline.  The water is expected to reach\nthe following heights above ground if the peak surge occurs at the\ntime of high tide...\n\nPuerto Rico and the U.S. Virgin Islands...6 to 9 ft\n\nThe deepest water will occur along the immediate coast near and to\nthe north and east of the landfall location, where the surge will be\naccompanied by large and destructive waves.  Surge-related\nflooding depends on the relative timing of the surge and the tidal\ncycle, and can vary greatly over short distances.  For information\nspecific to your area, please see products issued by your local\nNational Weather Service forecast office.\n\nRAINFALL: Maria is expected to produce the following rain\naccumulations through Friday:\n\nCentral and southern Leeward Islands...additional 1 to 3 inches.\nNorthern Leeward Islands from Barbuda to Anguilla...additional 3 to\n6 inches.\nU.S. and British Virgin Islands...additional 8 to 12 inches,\nisolated 16 inches.\nPuerto Rico...12 to 18 inches, isolated 25 inches.\nEastern Dominican Republic...4 to 8 inches, isolated 12 inches.\n\nRainfall on all of these islands will cause life-threatening flash\nfloods and mudslides.\n\nTORNADOES: Several tornadoes are possible over Puerto Rico and the\nU.S. Virgin Islands today.\n\nSURF:  Swells generated by Maria are affecting the Leeward Islands,\nPuerto Rico, and the Virgin Islands.  These swells will begin\naffecting the northern coast of Hispaniola, the Turks and Caicos\nIslands, and the Southeastern Bahamas during the next day or two.\nThese swells are likely to cause life-threatening surf and rip\ncurrent conditions.  Please consult products from your local weather\noffice.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 500 AM AST.\n\n$$\nForecaster Pasch\n\nNNNN",
    "messageBinNumber": "5",
    "messageDateTimeLocal": "20170920 02:00:00 AM AST",
    "messageDateTimeLocalStr": "0200 AM AST Wed Sep 20",
    "messageDateTimeUTC": "20170920 06:00:00 AM UTC",
    "messageDateTimeUTC24": "201709200600",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "WNW OR 300 DEGREES",
    "systemGeoRefPt1": "ABOUT 20 MI...35 KM WSW OF ST. CROIX",
    "systemGeoRefPt2": "ABOUT 85 MI...140 KM SE OF SAN JUAN PUERTO RICO",
    "systemIntensityKph": "270",
    "systemIntensityKts": "145",
    "systemIntensityMph": "165",
    "systemMslpInHg": "26.87",
    "systemMslpMb": "910",
    "systemName": "MARIA",
    "systemSaffirSimpsonCategory": "CATEGORY 5",
    "systemSpeedKph": "17",
    "systemSpeedKts": "9",
    "systemSpeedMph": "10",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1505887200"
  }
}
