{
  "cycloneMessage": {
    "advisoryNumber": "20",
    "atcfID": "AL152017",
    "centerLocLatitude": "19.2",
    "centerLocLatitudeExpanded": "19.2N",
    "centerLocLongitude": "-67.9",
    "centerLocLongitudeExpanded": "67.9W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT5 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Maria Advisory Number  20\nNWS National Hurricane Center Miami FL       AL152017\n1100 PM AST Wed Sep 20 2017\n\n...HURRICANE MARIA MOVING AWAY FROM PUERTO RICO BUT TORRENTIAL\nRAINS CONTINUE...\n...WEATHER CONDITIONS DETERIORATING OVER EASTERN DOMINICAN REPUBLIC\nAND WILL SOON IN THE TURK AND CAICOS ISLANDS...\n\n\nSUMMARY OF 1100 PM AST...0300 UTC...INFORMATION\n-----------------------------------------------\nLOCATION...19.2N 67.9W\nABOUT 55 MI...85 KM NE OF PUNTA CANA DOMINICAN REPUBLIC\nABOUT 260 MI...420 KM SE OF GRAND TURK ISLAND\nMAXIMUM SUSTAINED WINDS...110 MPH...175 KM/H\nPRESENT MOVEMENT...NW OR 310 DEGREES AT 9 MPH...15 KM/H\nMINIMUM CENTRAL PRESSURE...959 MB...28.32 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe Hurricane Warning for Puerto Rico, Culebra, and Vieques has\nbeen discontinued.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Warning is in effect for...\n* Dominican Republic from Cabo Engano to Puerto Plata\n* Turks and Caicos Islands and the Southeastern Bahamas\n\nA Tropical Storm Warning is in effect for...\n* Dominican Republic west of Puerto Plata to the northern border of\nthe Dominican Republic and Haiti\n* Dominican Republic west of Cabo Engano to Punta Palenque\n\nA Hurricane Watch is in effect for...\n* Dominican Republic from Isla Saona to Cabo Engano\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area.  Preparations to protect life and\nproperty should be rushed to completion.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area, in this case within the next 12 hours.\n\nInterests elsewhere in Hispaniola and the Bahamas should monitor the\nprogress of Maria.\n\nFor storm information specific to your area in the United States,\nincluding possible inland watches and warnings, please monitor\nproducts issued by your local National Weather Service forecast\noffice.  For storm information specific to your area outside\nthe United States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 1100 PM AST (0300 UTC), the large eye of Hurricane Maria\nwas located near latitude 19.2 North, longitude 67.9 West.  Maria is\nmoving toward the northwest near 9 mph (15 km/h), and this general\nmotion with a decrease in forward speed is expected through Thursday\nnight.  A turn toward the north-northwest is forecast on Friday.  On\nthe forecast track, the core of Hurricane Maria will continue to\nmove away from Puerto Rico during the next several hours, and then\npass offshore of the northeastern coast of the Dominican Republic\nearly Thursday.  Maria should then move near the Turks and Caicos\nIslands and the southeastern Bahamas Thursday night and Friday.\n\nMaximum sustained winds remain near 110 mph (175 km/h) with higher\ngusts.  Some strengthening is forecast during the next day or two,\nand Maria could regain major hurricane status by Thursday.\n\nHurricane-force winds extend outward up to 60 miles (95 km) from the\ncenter and tropical-storm-force winds extend outward up to 150 miles\n(240 km).  Punta Cana in the Dominican Republic recently reported a\nwind gust to 66 mph (106 km/h).\n\nThe minimum central pressure estimated from reconnaissance aircraft\ndata is 959 mb (28.32 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nWIND:  Strong gusty winds are still occurring over portions of\nPuerto Rico, but should continue to gradually subside.  Tropical\nstorm conditions are already spreading across the warning areas in\nthe Dominican Republic, and hurricane conditions should start in the\nHurricane Warning area soon.  Tropical storm conditions are expected\nto begin in the Turks and Caicos Islands and the southeastern\nBahamas on Thursday, with hurricane conditions starting Thursday\nnight.\n\nSTORM SURGE:  Water levels in Puerto Rico should begin to recede\nin the next few hours.\n\nA dangerous storm surge accompanied by large and destructive waves\nwill raise water levels by as much as 4 to 6 feet above normal tide\nlevels in the hurricane warning area in the Dominican Republic, and\n1 to 3 ft elsewhere along the northern coasts of the Dominican\nRepublic and Haiti.\n\nA dangerous storm surge accompanied by large and destructive waves\nwill raise water levels by as much as 9 to 12 feet above normal\ntide levels within the hurricane warning area of the southeastern\nBahamas and the Turks and Caicos Islands.\n\nRAINFALL: Maria is expected to produce the following\nrainfall totals through Saturday:\n\nPuerto Rico...20 to 30 inches, isolated 35 inches.\nU.S. and British Virgin Islands...additional 3 to 5 inches.\nNorthern and eastern Dominican Republic, Turks and Caicos, and the\nSoutheastern Bahamas...8 to 16 inches, isolated 20 inches.\nNorthern Haiti...2 to 4 inches.\n\nRainfall on these islands will continue to cause life-threatening\nflash floods and mudslides.\n\nSURF:  Swells generated by Maria are still affecting the Leeward\nIslands, Puerto Rico, and the Virgin Islands.  These swells are\nalso affecting the northern coast of Hispaniola, the Turks and\nCaicos Islands, and should begin in the Southeastern Bahamas during\nthe next day or two.  These swells are likely to cause life-\nthreatening surf and rip current conditions.  Please consult\nproducts from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 200 AM AST.\nNext complete advisory at 500 AM AST.\n\n$$\nForecaster Avila\n\nNNNN",
    "messageBinNumber": "5",
    "messageDateTimeLocal": "20170920 11:00:00 PM AST",
    "messageDateTimeLocalStr": "1100 PM AST Wed Sep 20",
    "messageDateTimeUTC": "20170921 03:00:00 AM UTC",
    "messageDateTimeUTC24": "201709210300",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "NW OR 310 DEGREES",
    "systemGeoRefPt1": "ABOUT 55 MI...85 KM NE OF PUNTA CANA DOMINICAN REPUBLIC",
    "systemGeoRefPt2": "ABOUT 260 MI...420 KM SE OF GRAND TURK ISLAND",
    "systemIntensityKph": "175",
    "systemIntensityKts": "95",
    "systemIntensityMph": "110",
    "systemMslpInHg": "28.32",
    "systemMslpMb": "959",
    "systemName": "MARIA",
    "systemSaffirSimpsonCategory": "CATEGORY 2",
    "systemSpeedKph": "15",
    "systemSpeedKts": "8",
    "systemSpeedMph": "9",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1505962800"
  }
}
