{
  "cycloneMessage": {
    "advisoryNumber": "2",
    "atcfID": "AL152017",
    "centerLocLatitude": "12.3",
    "centerLocLatitudeExpanded": "12.3N",
    "centerLocLongitude": "-52.6",
    "centerLocLongitudeExpanded": "52.6W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT5 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Maria Advisory Number   2\nNWS National Hurricane Center Miami FL       AL152017\n500 PM AST Sat Sep 16 2017\n\n...DEPRESSION BECOMES TROPICAL STORM MARIA...\n...ADDITIONAL STRENGTHENING IS FORECAST...\n\n\nSUMMARY OF 500 PM AST...2100 UTC...INFORMATION\n----------------------------------------------\nLOCATION...12.3N 52.6W\nABOUT 620 MI...1000 KM ESE OF THE LESSER ANTILLES\nMAXIMUM SUSTAINED WINDS...50 MPH...85 KM/H\nPRESENT MOVEMENT...W OR 275 DEGREES AT 20 MPH...31 KM/H\nMINIMUM CENTRAL PRESSURE...1002 MB...29.59 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe government of Antigua has issued a Hurricane Watch for Antigua,\nBarbuda, St. Kitts, Nevis, and Montserrat.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Watch is in effect for...\n* Antigua, Barbuda, St. Kitts, Nevis, and Montserrat\n\nA Tropical Storm Watch is in effect for...\n* St. Lucia\n* Martinique and Guadeloupe\n* Dominica\n* Barbados\n* St. Vincent and the Grenadines\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours\nbefore the anticipated first occurrence of tropical-storm-force\nwinds, conditions that make outside preparations difficult or\ndangerous.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, generally within 48 hours.\n\nInterests elsewhere in the Lesser Antilles should monitor the\nprogress of this system.  Additional Tropical Storm or Hurricane\nWatches will likely be issued tonight or early Sunday.\n\nFor storm information specific to your area, please monitor\nproducts issued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 500 PM AST (2100 UTC), the center of Tropical Storm Maria was\nlocated near latitude 12.3 North, longitude 52.6 West. Maria is\nmoving toward the west near 20 mph (31 km/h). A slower\nwest-northwest motion is expected during the next couple of\ndays.  On the forecast track, Maria is expected to approach the\nLeeward Islands on Monday.\n\nMaximum sustained winds have increased to near 50 mph (85 km/h)\nwith higher gusts. Additional strengthening is expected during the\nnext 48 hours, and Maria is forecast to be a hurricane when it\napproaches the Leeward Islands early next week.\n\nTropical-storm-force winds extend outward up to 45 miles (75 km)\nfrom the center.\n\nThe estimated minimum central pressure is 1002 mb (29.59 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nWIND:  Hurricane conditions are possible within the hurricane watch\narea by Monday night or Tuesday, with tropical storm conditions\npossible on Monday.  Tropical storm conditions are possible in the\ntropical storm watch area on Monday.\n\nSTORM SURGE:  A dangerous storm surge accompanied by large and\ndestructive waves will raise water levels by as much as 3 to 5 feet\nabove normal tide levels within the hurricane watch area.\n\nRAINFALL:  Maria is expected to produce total rain accumulations of\n6 to 12 inches with isolated maximum amounts of 20 inches across\nportions of the central and southern Leeward Islands through Tuesday\nnight.  Rainfall amounts of 2 to 4 inches with isolated maximum\namounts of 8 inches will be possible for portions of the northern\nLeeward Islands through Tuesday night.  These rains could cause\nlife-threatening flash floods and mudslides.\n\nSURF:  Swells generated by Maria are expected to begin affecting the\nLesser Antilles by Sunday night.  These swells are likely to cause\nlife-threatening surf and rip current conditions.  Please consult\nproducts from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 800 PM AST.\nNext complete advisory at 1100 PM AST.\n\n$$\nForecaster Cangialosi\n\nNNNN",
    "messageBinNumber": "5",
    "messageDateTimeLocal": "20170916 05:00:00 PM AST",
    "messageDateTimeLocalStr": "0500 PM AST Sat Sep 16",
    "messageDateTimeUTC": "20170916 09:00:00 PM UTC",
    "messageDateTimeUTC24": "201709162100",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "W OR 275 DEGREES",
    "systemGeoRefPt1": "ABOUT 620 MI...1000 KM ESE OF THE LESSER ANTILLES",
    "systemIntensityKph": "85",
    "systemIntensityKts": "45",
    "systemIntensityMph": "50",
    "systemMslpInHg": "29.59",
    "systemMslpMb": "1002",
    "systemName": "MARIA",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "31",
    "systemSpeedKts": "17",
    "systemSpeedMph": "20",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1505595600"
  }
}
