{
  "cycloneMessage": {
    "advisoryNumber": "44A",
    "atcfID": "AL152017",
    "centerLocLatitude": "34.8",
    "centerLocLatitudeExpanded": "34.8N",
    "centerLocLongitude": "-73",
    "centerLocLongitudeExpanded": "73.0W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT5 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Maria Intermediate Advisory Number 44A\nNWS National Hurricane Center Miami FL       AL152017\n200 AM EDT Wed Sep 27 2017\n\n...SUSTAINED TROPICAL-STORM-FORCE WINDS OCCURRING ON PORTIONS OF THE\nNORTH CAROLINA OUTER BANKS...\n\n\nSUMMARY OF 200 AM EDT...0600 UTC...INFORMATION\n----------------------------------------------\nLOCATION...34.8N 73.0W\nABOUT 145 MI...235 KM E OF CAPE HATTERAS NORTH CAROLINA\nMAXIMUM SUSTAINED WINDS...70 MPH...110 KM/H\nPRESENT MOVEMENT...N OR 360 DEGREES AT 5 MPH...7 KM/H\nMINIMUM CENTRAL PRESSURE...976 MB...28.82 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Warning is in effect for...\n* Ocracoke Inlet to Cape Hatteras\n\nA Tropical Storm Warning is in effect for...\n* Bogue Inlet to the North Carolina/Virginia border\n* Albemarle and Pamlico Sounds\n\nA Storm Surge Watch is in effect for...\n* Cape Lookout to west of Ocracoke Inlet\n* North of Cape Hatteras to Duck\n\nA Storm Surge Warning means there is a danger of life-threatening\ninundation, from rising water moving inland from the coastline in\nthe indicated locations. For a depiction of areas at risk, please\nsee the National Weather Service Storm Surge Watch/Warning Graphic,\navailable at hurricanes.gov.  This is a life-threatening situation.\nPersons located within these areas should take all necessary actions\nto protect life and property from rising water and the potential for\nother dangerous conditions.  Promptly follow evacuation and other\ninstructions from local officials.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area.\n\nA Storm Surge Watch means there is a possibility of life-\nthreatening inundation, from rising water moving inland from the\ncoastline in the indicated locations. For a depiction of areas at\nrisk, please see the National Weather Service Storm Surge\nWatch/Warning Graphic, available at hurricanes.gov.\n\nFor storm information specific to your area, including possible\ninland watches and warnings, please monitor products issued by your\nlocal National Weather Service forecast office.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 200 AM EDT (0600 UTC), the center of Tropical Storm Maria was\nlocated by an Air Force Reserve reconnaissance aircraft near\nlatitude 34.8 North, longitude 73.0 West.  Maria is slowing down and\nis now moving toward the north near 5 mph (7 km/h).  A turn toward\nthe north-northeast is expected later today, and a turn toward the\neast-northeast is anticipated on Thursday.  On the forecast track,\nthe center of Maria will pass east of the coast of North Carolina\nduring the next day or so.\n\nMaximum sustained winds are near 70 mph (110 km/h) with higher\ngusts.  Some slight weakening is forecast during the next day or\ntwo.\n\nMaria is a large tropical storm.  Tropical-storm-force winds extend\noutward up to 230 miles (370 km) from the center.  The United\nStates Coast Guard station at Hatteras, North Carolina, recently\nreported a sustained wind of 39 mph (63 km/h) and gust to 47 mph\n(76 km/h).\n\nThe minimum central pressure estimated from Air Force Hurricane\nHunter aircraft observations is 976 mb (28.82 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nWIND:  Tropical storm conditions are expected within the warning\narea through today.\n\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following heights above ground if the peak\nsurge occurs at the time of high tide...\n\nCape Lookout to Duck including the sound side of the Outer\nBanks...2 to 4 ft\n\nSurge-related flooding depends on the relative timing of the surge\nand the tidal cycle, and can vary greatly over short distances.  For\ninformation specific to your area, please see products issued by\nyour local National Weather Service forecast office.\n\nRAINFALL:  Maria is expected to produce additional rain\naccumulations of less than 1 inch, and storm total amounts less than\n2 inches, over the Outer Banks of North Carolina and far southeast\nVirginia through tonight.\n\nSURF:  Large swells generated by Maria are affecting much of the\neast coast of the United States.  These swells are also affecting\nBermuda, the Turks and Caicos Islands, and the Bahamas and are\nlikely to cause life-threatening surf and rip current conditions.\nPlease consult products from your local weather office for more\ninformation.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 500 AM EDT.\n\n$$\nForecaster Berg\n\nNNNN",
    "messageBinNumber": "5",
    "messageDateTimeLocal": "20170927 02:00:00 AM EDT",
    "messageDateTimeLocalStr": "0200 AM EDT Wed Sep 27",
    "messageDateTimeUTC": "20170927 06:00:00 AM UTC",
    "messageDateTimeUTC24": "201709270600",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "N OR 360 DEGREES",
    "systemGeoRefPt1": "ABOUT 145 MI...235 KM E OF CAPE HATTERAS NORTH CAROLINA",
    "systemIntensityKph": "110",
    "systemIntensityKts": "60",
    "systemIntensityMph": "70",
    "systemMslpInHg": "28.82",
    "systemMslpMb": "976",
    "systemName": "MARIA",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "7",
    "systemSpeedKts": "4",
    "systemSpeedMph": "5",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1506492000"
  }
}
