{
  "cycloneMessage": {
    "advisoryNumber": "39A",
    "atcfID": "AL152017",
    "centerLocLatitude": "32.0",
    "centerLocLatitudeExpanded": "32.0N",
    "centerLocLongitude": "-73",
    "centerLocLongitudeExpanded": "73.0W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT5 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Maria Intermediate Advisory Number 39A\nNWS National Hurricane Center Miami FL       AL152017\n800 PM EDT Mon Sep 25 2017\n\n...LARGE SWELLS AFFECTING MUCH OF THE EAST COAST OF THE UNITED\nSTATES...\n\n\nSUMMARY OF 800 PM EDT...0000 UTC...INFORMATION\n----------------------------------------------\nLOCATION...32.0N 73.0W\nABOUT 265 MI...425 KM SSE OF CAPE HATTERAS NORTH CAROLINA\nMAXIMUM SUSTAINED WINDS...80 MPH...130 KM/H\nPRESENT MOVEMENT...N OR 360 DEGREES AT 7 MPH...11 KM/H\nMINIMUM CENTRAL PRESSURE...965 MB...28.50 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Tropical Storm Warning is in effect for...\n* Bogue Inlet to the North Carolina/Virginia border\n* Albemarle and Pamlico Sounds\n\nA Storm Surge Watch is in effect for...\n* Cape Lookout to Duck\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area.\n\nA Storm Surge Watch means there is a possibility of life-\nthreatening inundation, from rising water moving inland from the\ncoastline, in the indicated locations during the next 48 hours.\nFor a depiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.\n\nFor storm information specific to your area, including possible\ninland watches and warnings, please monitor products issued by your\nlocal National Weather Service forecast office.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 800 PM EDT (0000 UTC), the center of Hurricane Maria was located\nnear latitude 32.0 North, longitude 73.0 West.  Maria is moving\ntoward the north near 7 mph (11 km/h), and this general motion with\nsome decrease in forward speed is expected through Tuesday night. A\nturn toward the north-northeast is expected on Wednesday.  On the\nforecast track, the center of Maria will pass east of the coast of\nNorth Carolina during the next couple of days.\n\nMaximum sustained winds are near 80 mph (130 km/h) with higher\ngusts.  Gradual weakening is forecast during the next couple of\ndays, and Maria is forecast to become a tropical storm Tuesday night\nor Wednesday.\n\nMaria is a large hurricane.  Hurricane-force winds extend outward up\nto 105 miles (165 km) from the center and tropical-storm-force winds\nextend outward up to 205 miles (335 km).  NOAA buoy 41002, located\nabout 105 miles west of Maria's center, recently reported sustained\nwinds of 47 mph (76 km/h) and a gust to 60 mph (96 km/h).\n\nThe minimum central pressure estimated from reconnaissance aircraft\nobservations is 965 mb (28.50 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nWIND:  Tropical storm conditions are expected within the warning\narea beginning Tuesday.\n\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following heights above ground if the peak\nsurge occurs at the time of high tide...\n\nCape Lookout to Duck including the sound side of the Outer\nBanks...2 to 4 ft\n\nSurge-related flooding depends on the relative timing of the surge\nand the tidal cycle, and can vary greatly over short distances.  For\ninformation specific to your area, please see products issued by\nyour local National Weather Service forecast office.\n\nRAINFALL:  Maria is expected to produce total rainfall accumulations\nof 1 to 2 inches over the Outer Banks of North Carolina through\nWednesday.\n\nSURF:  Large swells generated by Maria are affecting much of the\neast coast of the United States from Florida through southern New\nEngland.  These swells are also affecting Bermuda, Puerto Rico, the\nnorthern coast of Hispaniola, the Turks and Caicos Islands, and\nthe Bahamas.  These swells are likely to cause life-threatening surf\nand rip current conditions.  Please consult products from your local\nweather office for more information.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 1100 PM EDT.\n\n$$\nForecaster Pasch\n\nNNNN",
    "messageBinNumber": "5",
    "messageDateTimeLocal": "20170925 08:00:00 PM EDT",
    "messageDateTimeLocalStr": "0800 PM EDT Mon Sep 25",
    "messageDateTimeUTC": "20170926 12:00:00 AM UTC",
    "messageDateTimeUTC24": "201709260000",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "N OR 360 DEGREES",
    "systemGeoRefPt1": "ABOUT 265 MI...425 KM SSE OF CAPE HATTERAS NORTH CAROLINA",
    "systemIntensityKph": "130",
    "systemIntensityKts": "70",
    "systemIntensityMph": "80",
    "systemMslpInHg": "28.50",
    "systemMslpMb": "965",
    "systemName": "MARIA",
    "systemSaffirSimpsonCategory": "CATEGORY 1",
    "systemSpeedKph": "11",
    "systemSpeedKts": "6",
    "systemSpeedMph": "7",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1506384000"
  }
}
