{
  "cycloneMessage": {
    "advisoryNumber": "23A",
    "atcfID": "AL152017",
    "centerLocLatitude": "20.9",
    "centerLocLatitudeExpanded": "20.9N",
    "centerLocLongitude": "-70",
    "centerLocLongitudeExpanded": "70.0W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT5 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Maria Intermediate Advisory Number 23A\nNWS National Hurricane Center Miami FL       AL152017\n800 PM AST Thu Sep 21 2017\n\n...LARGE EYE OF HURRICANE MARIA GRADUALLY APPROACHING THE TURKS AND\nCAICOS ISLANDS...\n\n\nSUMMARY OF 800 PM AST...0000 UTC...INFORMATION\n----------------------------------------------\nLOCATION...20.9N 70.0W\nABOUT 85 MI...135 KM NNE OF PUERTO PLATA DOMINICAN REPUBLIC\nABOUT 80 MI...130 KM ESE OF GRAND TURK ISLAND\nMAXIMUM SUSTAINED WINDS...125 MPH...205 KM/H\nPRESENT MOVEMENT...NW OR 315 DEGREES AT 9 MPH...15 KM/H\nMINIMUM CENTRAL PRESSURE...955 MB...28.20 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Warning is in effect for...\n* Dominican Republic from Cabo Engano to Puerto Plata\n* Turks and Caicos Islands and the Southeastern Bahamas\n\nA Tropical Storm Warning is in effect for...\n* Dominican Republic west of Puerto Plata to the northern border of\nthe Dominican Republic and Haiti\n\nA Tropical Storm Watch is in effect for...\n* Central Bahamas\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area.  Preparations to protect life and\nproperty should be rushed to completion.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, generally within 48 hours.\n\nInterests in the Bahamas should monitor the progress of Maria.\n\nFor storm information specific to your area, please monitor products\nissued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 800 PM AST (0000 UTC), the large eye of Hurricane Maria was\nlocated near latitude 20.9 North, longitude 70.0 West.  Maria is\nmoving toward the northwest near 9 mph (15 km/h), and this general\nmotion is expected to continue through tonight.  A turn toward the\nnorth-northwest is forecast early Friday, with that motion\ncontinuing through Saturday.  On the forecast track, Maria's eye\nwill continue to pass offshore of the northern coast of the\nDominican Republic this evening, and then move near or just east of\nthe Turks and Caicos Islands and southeastern Bahamas later\ntonight and on Friday.\n\nPreliminary reports from an Air Force reconnaissance plane indicate\nthat the maximum sustained winds have increased to around 125 mph\n(205 km/h) with higher gusts.  Maria is a category 3 hurricane on\nthe Saffir-Simpson Hurricane Wind Scale.  Little change in strength\nis expected during the next couple of days.\n\nHurricane-force winds extend outward up to 70 miles (110 km) from\nthe center, and tropical-storm-force winds extend outward up to 160\nmiles (260 km).\n\nThe estimated minimum central pressure from the reconnaissance\nplane was 955 mb (28.20 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nWIND:  Hurricane and tropical storm conditions continue across\nportions of the Dominican Republic.  Tropical storm conditions are\nbeginning to spread across the Turks and Caicos Islands and the\nsoutheastern Bahamas, and hurricane conditions are expected tonight\nor early Friday.  Tropical storm conditions are possible in the\ncentral Bahamas beginning late Friday.\n\nSTORM SURGE:  A dangerous storm surge accompanied by large and\ndestructive waves will raise water levels by as much as 4 to 6 feet\nabove normal tide levels in the hurricane warning area in the\nDominican Republic, and 1 to 3 ft elsewhere along the northern\ncoasts of the Dominican Republic and Haiti.\n\nA dangerous storm surge accompanied by large and destructive waves\nwill raise water levels by as much as 9 to 12 feet above normal\ntide levels within the hurricane warning area of the southeastern\nBahamas and the Turks and Caicos Islands.\n\nRAINFALL:  Maria is expected to produce the following rainfall\naccumulations through Saturday:\n\nPuerto Rico...additional 4 to 8 inches, isolated maximum storm total\namounts 40 inches\nNorthern and eastern Dominican Republic, Turks and Caicos, and\nMayaguana in southeast Bahamas...8 to 16 inches, isolated 20 inches\nInagua Islands, Crooked Island, and rest of southeast Bahamas...4 to\n8 inches\nNorthern Haiti...4 to 8 inches\n\nRainfall on these islands will continue to cause life-threatening\nflash floods and mudslides.\n\nSURF:  Swells generated by Maria are affecting Puerto Rico, the\nVirgin Islands, the northern coast of Hispaniola, the Turks and\nCaicos Islands, and the southeastern Bahamas.  These swells will\nreach the remainder of the Bahamas tonight and should reach portions\nof the United States southeastern coast on Friday.  These swells are\nlikely to cause life-threatening surf and rip current conditions.\nPlease consult products from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 1100 PM AST.\n\n$$\nForecaster Avila\n\nNNNN",
    "messageBinNumber": "5",
    "messageDateTimeLocal": "20170921 08:00:00 PM AST",
    "messageDateTimeLocalStr": "0800 PM AST Thu Sep 21",
    "messageDateTimeUTC": "20170922 12:00:00 AM UTC",
    "messageDateTimeUTC24": "201709220000",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "NW OR 315 DEGREES",
    "systemGeoRefPt1": "ABOUT 85 MI...135 KM NNE OF PUERTO PLATA DOMINICAN REPUBLIC",
    "systemGeoRefPt2": "ABOUT 80 MI...130 KM ESE OF GRAND TURK ISLAND",
    "systemIntensityKph": "205",
    "systemIntensityKts": "110",
    "systemIntensityMph": "125",
    "systemMslpInHg": "28.20",
    "systemMslpMb": "955",
    "systemName": "MARIA",
    "systemSaffirSimpsonCategory": "CATEGORY 3",
    "systemSpeedKph": "15",
    "systemSpeedKts": "8",
    "systemSpeedMph": "9",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1506038400"
  }
}
