{
  "cycloneMessage": {
    "advisoryNumber": "35A",
    "atcfID": "AL152017",
    "centerLocLatitude": "29.7",
    "centerLocLatitudeExpanded": "29.7N",
    "centerLocLongitude": "-72.9",
    "centerLocLongitudeExpanded": "72.9W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT5 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Maria Intermediate Advisory Number 35A\nNWS National Hurricane Center Miami FL       AL152017\n800 PM EDT Sun Sep 24 2017\n\n...MARIA CONTINUES MOVING NORTHWARD...\n\n\nSUMMARY OF 800 PM EDT...0000 UTC...INFORMATION\n----------------------------------------------\nLOCATION...29.7N 72.9W\nABOUT 410 MI...660 KM SSE OF CAPE HATTERAS NORTH CAROLINA\nMAXIMUM SUSTAINED WINDS...105 MPH...165 KM/H\nPRESENT MOVEMENT...N OR 360 DEGREES AT 9 MPH...15 KM/H\nMINIMUM CENTRAL PRESSURE...947 MB...27.96 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Tropical Storm Watch is in effect for...\n* North of Surf City northward to the North Carolina/Virginia border\n* Albemarle and Pamlico Sounds\n\nA Storm Surge Watch is in effect for...\n* Cape Lookout to Duck\n\nInterests elsewhere along the Carolina and Mid-Atlantic coasts\nshould monitor the progress of Maria.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, generally within 48 hours.\n\nA Storm Surge Watch means there is a possibility of life-\nthreatening inundation, from rising water moving inland from the\ncoastline, in the indicated locations during the next 48 hours.\nFor a depiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.\n\nFor storm information specific to your area, including possible\ninland watches and warnings, please monitor products issued by your\nlocal National Weather Service forecast office.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 800 PM EDT (0000 UTC), the center of Hurricane Maria was located\nnear latitude 29.7 North, longitude 72.9 West.  Maria is moving\ntoward the north near 9 mph (15 km/h), and this general motion with\nsome decrease in forward speed is expected through Tuesday.  On the\nforecast track, the core of Maria will move well east of the\nsoutheast coast of the United States during the next day or so.\n\nMaximum sustained winds are near 105 mph (165 km/h) with higher\ngusts.  Some fluctuations in intensity are possible during the next\n24 hours, but gradual weakening is expected to begin by Monday night\nor Tuesday.\n\nMaria is a large hurricane.  Hurricane-force winds extend outward\nup to 60 miles (95 km) from the center and tropical-storm-force\nwinds extend outward up to 230 miles (370 km).\n\nThe latest minimum central pressure estimated from Hurricane Hunter\naircraft observations is 947 mb (27.96 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nWIND:  Tropical storm conditions are possible within the watch area\nbeginning Tuesday.\n\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following heights above ground if the peak\nsurge occurs at the time of high tide...\n\nCape Lookout to Duck including the sound side of the Outer\nBanks...2 to 4 ft\n\nSurge-related flooding depends on the relative timing of the surge\nand the tidal cycle, and can vary greatly over short distances.  For\ninformation specific to your area, please see products issued by\nyour local National Weather Service forecast office.\n\nSURF:  Swells generated by Maria are increasing along portions of\nthe southeastern United States coast and Bermuda and will be\nincreasing along the Mid-Atlantic coast later today.  Swells also\ncontinue to affect Puerto Rico, the Virgin Islands, the northern\ncoast of Hispaniola, the Turks and Caicos Islands, and the Bahamas.\nThese swells are likely to cause life-threatening surf and rip\ncurrent conditions.  Please consult products from your local weather\noffice for more information.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 1100 PM EDT.\n\n$$\nForecaster Pasch\n\nNNNN",
    "messageBinNumber": "5",
    "messageDateTimeLocal": "20170924 08:00:00 PM EDT",
    "messageDateTimeLocalStr": "0800 PM EDT Sun Sep 24",
    "messageDateTimeUTC": "20170925 12:00:00 AM UTC",
    "messageDateTimeUTC24": "201709250000",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "N OR 360 DEGREES",
    "systemGeoRefPt1": "ABOUT 410 MI...660 KM SSE OF CAPE HATTERAS NORTH CAROLINA",
    "systemIntensityKph": "165",
    "systemIntensityKts": "90",
    "systemIntensityMph": "105",
    "systemMslpInHg": "27.96",
    "systemMslpMb": "947",
    "systemName": "MARIA",
    "systemSaffirSimpsonCategory": "CATEGORY 2",
    "systemSpeedKph": "15",
    "systemSpeedKts": "8",
    "systemSpeedMph": "9",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1506297600"
  }
}
