{
  "cycloneMessage": {
    "advisoryNumber": "38A",
    "atcfID": "AL152017",
    "centerLocLatitude": "31.4",
    "centerLocLatitudeExpanded": "31.4N",
    "centerLocLongitude": "-73",
    "centerLocLongitudeExpanded": "73.0W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT5 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Maria Intermediate Advisory Number 38A\nNWS National Hurricane Center Miami FL       AL152017\n200 PM EDT Mon Sep 25 2017\n\n...MARIA CONTINUES TO MOVE SLOWLY NORTHWARD...\n...LARGE SWELLS AFFECTING MUCH OF THE EAST COAST OF THE UNITED\nSTATES...\n\n\nSUMMARY OF 200 PM EDT...1800 UTC...INFORMATION\n----------------------------------------------\nLOCATION...31.4N 73.0W\nABOUT 300 MI...480 KM SSE OF CAPE HATTERAS NORTH CAROLINA\nMAXIMUM SUSTAINED WINDS...80 MPH...130 KM/H\nPRESENT MOVEMENT...N OR 360 DEGREES AT 7 MPH...11 KM/H\nMINIMUM CENTRAL PRESSURE...966 MB...28.53 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Tropical Storm Warning is in effect for...\n* Cape Lookout to Duck\n* Albemarle and Pamlico Sounds\n\nA Tropical Storm Watch is in effect for...\n* North of Duck to the North Carolina/Virginia border\n* North of Surf City to south of Cape Lookout\n\nA Storm Surge Watch is in effect for...\n* Cape Lookout to Duck\n\nInterests elsewhere along the Carolina and Mid-Atlantic coasts\nshould monitor the progress of Maria.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area, in this case within\n24 to 36 hours.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, in this case within the next 24\nto to 36 hours.\n\nA Storm Surge Watch means there is a possibility of life-\nthreatening inundation, from rising water moving inland from the\ncoastline, in the indicated locations during the next 48 hours.\nFor a depiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.\n\nFor storm information specific to your area, including possible\ninland watches and warnings, please monitor products issued by your\nlocal National Weather Service forecast office.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 200 PM EDT (1800 UTC), the center of Hurricane Maria was located\nnear latitude 31.4 North, longitude 73.0 West. Maria is moving\ntoward the north near 7 mph (11 km/h), and this general motion with\nsome decrease in forward speed is expected through Tuesday night. On\nthe forecast track, the center of Maria will move well east of the\nsoutheast coast of the United States during the next day or so.\n\nReports from an Air Force Reserve Hurricane Hunter aircraft\nindicate that maximum sustained winds are near 80 mph (130 km/h)\nwith higher gusts. Gradual weakening is forecast during the next\ncouple of days and Maria is forecast to become a tropical storm\nTuesday night.\n\nMaria is a large hurricane. Hurricane-force winds extend outward up\nto 90 miles (150 km), primarily to the east of center, and tropical-\nstorm-force winds extend outward up to 230 miles (370 km).  NOAA\nbuoy 41002, located about 100 miles west-northwest of Maria's\ncenter, recently reported sustained winds of 45 mph (72 km/h) and a\ngust to 60 mph (96 km/h).\n\nThe latest minimum central pressure reported by reconnaissance\naircraft is 966 mb (28.53 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nWIND:  Tropical storm conditions are expected within the warning\narea beginning Tuesday.  Tropical storm conditions are possible\nwithin the watch area beginning Tuesday.\n\nSTORM SURGE:  The combination of a dangerous storm surge and the\ntide will cause normally dry areas near the coast to be flooded by\nrising waters moving inland from the shoreline.  The water is\nexpected to reach the following heights above ground if the peak\nsurge occurs at the time of high tide...\n\nCape Lookout to Duck including the sound side of the Outer\nBanks...2 to 4 ft\n\nSurge-related flooding depends on the relative timing of the surge\nand the tidal cycle, and can vary greatly over short distances.  For\ninformation specific to your area, please see products issued by\nyour local National Weather Service forecast office.\n\nRAINFALL:  Maria is expected to produce total rainfall accumulations\nof 1 to 2 inches over the Outer Banks of North Carolina through\nWednesday.\n\nSURF:  Swells generated by Maria are affecting portions of the coast\nof the southeastern United States and Bermuda and will be increasing\nalong the Mid-Atlantic and southern New England coasts today.\nSwells also continue to affect Puerto Rico, the northern coast of\nHispaniola, the Turks and Caicos Islands, and the Bahamas.  These\nswells are likely to cause life-threatening surf and rip current\nconditions.  Please consult products from your local weather office\nfor more information.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 500 PM EDT.\n\n$$\nForecaster Brown\n\nNNNN",
    "messageBinNumber": "5",
    "messageDateTimeLocal": "20170925 02:00:00 PM EDT",
    "messageDateTimeLocalStr": "0200 PM EDT Mon Sep 25",
    "messageDateTimeUTC": "20170925 06:00:00 PM UTC",
    "messageDateTimeUTC24": "201709251800",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "N OR 360 DEGREES",
    "systemGeoRefPt1": "ABOUT 300 MI...480 KM SSE OF CAPE HATTERAS NORTH CAROLINA",
    "systemIntensityKph": "130",
    "systemIntensityKts": "70",
    "systemIntensityMph": "80",
    "systemMslpInHg": "28.53",
    "systemMslpMb": "966",
    "systemName": "MARIA",
    "systemSaffirSimpsonCategory": "CATEGORY 1",
    "systemSpeedKph": "11",
    "systemSpeedKts": "6",
    "systemSpeedMph": "7",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1506362400"
  }
}
