{
  "cycloneMessage": {
    "advisoryNumber": "3A",
    "atcfID": "AL152017",
    "centerLocLatitude": "12.7",
    "centerLocLatitudeExpanded": "12.7N",
    "centerLocLongitude": "-54.4",
    "centerLocLongitudeExpanded": "54.4W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT5 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Maria Intermediate Advisory Number 3A\nNWS National Hurricane Center Miami FL       AL152017\n200 AM AST Sun Sep 17 2017\n\n...MARIA CONTINUES MOVING TOWARD THE LESSER ANTILLES...\n\n\nSUMMARY OF 200 AM AST...0600 UTC...INFORMATION\n----------------------------------------------\nLOCATION...12.7N 54.4W\nABOUT 500 MI...800 KM ESE OF THE LESSER ANTILLES\nMAXIMUM SUSTAINED WINDS...50 MPH...85 KM/H\nPRESENT MOVEMENT...W OR 280 DEGREES AT 16 MPH...26 KM/H\nMINIMUM CENTRAL PRESSURE...1000 MB...29.53 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Watch is in effect for...\n* Antigua, Barbuda, St. Kitts, Nevis, and Montserrat\n* Guadeloupe\n* Saba and St. Eustatius\n* St. Maarten\n* Anguilla\n\nA Tropical Storm Watch is in effect for...\n* St. Lucia\n* Martinique\n* Dominica\n* Barbados\n* St. Vincent and the Grenadines\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours\nbefore the anticipated first occurrence of tropical-storm-force\nwinds, conditions that make outside preparations difficult or\ndangerous.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, generally within 48 hours.\n\nInterests elsewhere in the Lesser Antilles and the British and U. S.\nVirgin Islands should monitor the progress of this system.\nAdditional Tropical Storm or Hurricane Watches and Warnings will\nlikely be issued today.\n\nFor storm information specific to your area, please monitor\nproducts issued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 200 AM AST (0600 UTC), the center of Tropical Storm Maria was\nlocated near latitude 12.7 North, longitude 54.4 West.  Maria is\nmoving toward the west near 16 mph (26 km/h).  A turn toward the\nwest-northwest and a slower forward speed are expected during next\ncouple of days.  On the forecast track, the center of Maria will be\nnear the Leeward Islands Monday or Monday night.\n\nMaximum sustained winds are near 50 mph (85 km/h) with higher\ngusts.  Strengthening is expected during the next 48 hours, and\nMaria is forecast to be a hurricane when it approaches the Leeward\nIslands.\n\nTropical-storm-force winds extend outward up to 45 miles (75 km)\nfrom the center.\n\nThe estimated minimum central pressure is 1000 mb (29.53 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nWIND:  Hurricane conditions are possible within the hurricane watch\narea by Monday night or Tuesday, with tropical storm conditions\npossible on Monday.  Tropical storm conditions are possible in the\nTropical Storm Watch area on Monday.\n\nSTORM SURGE:  A dangerous storm surge accompanied by large and\ndestructive waves will raise water levels by as much as 3 to 5 feet\nabove normal tide levels within the Hurricane Watch area.\n\nRAINFALL: Maria is expected to produce total rain accumulations of 6\nto 12 inches with isolated maximum amounts of 20 inches across the\ncentral and southern Leeward Islands through Tuesday night.  Maria\nis also expected to produce total rain accumulations of 2 to 4\ninches with isolated maximum amounts of 8 inches in the northern\nLeeward Islands through Tuesday night.  This rainfall could cause\nlife-threatening flash floods and mudslides.\n\nSURF:  Swells generated by Maria are expected to begin affecting the\nLesser Antilles by tonight.  These swells are likely to cause\nlife-threatening surf and rip current conditions.  Please consult\nproducts from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 500 AM AST.\n\n$$\nForecaster Pasch\n\nNNNN",
    "messageBinNumber": "5",
    "messageDateTimeLocal": "20170917 02:00:00 AM AST",
    "messageDateTimeLocalStr": "0200 AM AST Sun Sep 17",
    "messageDateTimeUTC": "20170917 06:00:00 AM UTC",
    "messageDateTimeUTC24": "201709170600",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "W OR 280 DEGREES",
    "systemGeoRefPt1": "ABOUT 500 MI...800 KM ESE OF THE LESSER ANTILLES",
    "systemIntensityKph": "85",
    "systemIntensityKts": "45",
    "systemIntensityMph": "50",
    "systemMslpInHg": "29.53",
    "systemMslpMb": "1000",
    "systemName": "MARIA",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "26",
    "systemSpeedKts": "14",
    "systemSpeedMph": "16",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1505628000"
  }
}
