{
  "cycloneMessage": {
    "advisoryNumber": "6",
    "atcfID": "AL152017",
    "centerLocLatitude": "13.8",
    "centerLocLatitudeExpanded": "13.8N",
    "centerLocLongitude": "-57.5",
    "centerLocLongitudeExpanded": "57.5W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT5 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Maria Advisory Number   6\nNWS National Hurricane Center Miami FL       AL152017\n500 PM AST Sun Sep 17 2017\n\n...MARIA BECOMES A HURRICANE...\n...ADDITIONAL WARNINGS AND WATCHES ISSUED FOR PORTIONS OF THE\nLEEWARD ISLANDS...\n\n\nSUMMARY OF 500 PM AST...2100 UTC...INFORMATION\n----------------------------------------------\nLOCATION...13.8N 57.5W\nABOUT 140 MI...225 KM ENE OF BARBADOS\nABOUT 275 MI...445 KM ESE OF DOMINICA\nMAXIMUM SUSTAINED WINDS...75 MPH...120 KM/H\nPRESENT MOVEMENT...WNW OR 285 DEGREES AT 15 MPH...24 KM/H\nMINIMUM CENTRAL PRESSURE...982 MB...29.00 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe government of Antigua and Barbuda has issued a Hurricane\nWarning for St. Kitts, Nevis, and Montserrat.\n\nThe government of Antigua and Barbuda has issued a Tropical Storm\nWarning for Antigua and Barbuda.  The Hurricane Watch has been\ndiscontinued for these islands.\n\nThe government of the Netherlands has issued a Tropical Storm\nWarning for Saba and St. Eustatius.\n\nA Hurricane Watch has been issued for the U.S. Virgin Islands.\n\nThe government of Antigua and Barbuda has issued a Hurricane Watch\nfor the British Virgin Islands.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Warning is in effect for...\n* Guadeloupe\n* Dominica\n* St. Kitts, Nevis, and Montserrat\n\nA Tropical Storm Warning is in effect for...\n* Martinique\n* Antigua and Barbuda\n* Saba and St. Eustatius\n* St. Lucia\n\nA Hurricane Watch is in effect for...\n* U.S. Virgin Islands\n* British Virgin Islands\n* Saba and St. Eustatius\n* St. Maarten\n* St. Martin and St. Barthelemy\n* Anguilla\n\nA Tropical Storm Watch is in effect for...\n* Barbados\n* St. Vincent and the Grenadines\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area.  A warning is typically issued\n36 hours before the anticipated first occurrence of tropical-storm-\nforce winds, conditions that make outside preparations difficult or\ndangerous.  Preparations to protect life and property should be\nrushed to completion.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area within 36 hours.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours\nbefore the anticipated first occurrence of tropical-storm-force\nwinds, conditions that make outside preparations difficult or\ndangerous.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, generally within 48 hours.\n\nInterests elsewhere in the Lesser Antilles and Puerto Rico should\nmonitor the progress of this system.  Additional Tropical Storm or\nHurricane Watches and Warnings will likely be issued tonight or on\nMonday.\n\nFor storm information specific to your area, please monitor\nproducts issued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 500 PM AST (2100 UTC), the center of Hurricane Maria was located\nby an Air Force Reserve reconnaissance aircraft near latitude 13.8\nNorth, longitude 57.5 West.  Maria is moving toward the\nwest-northwest near 15 mph (24 km/h), and this motion with a\ndecrease in forward speed is expected through Tuesday.  On the\nforecast track, the center of Maria will move across the Leeward\nIslands Monday night and then over the extreme northeastern\nCaribbean Sea on Tuesday.\n\nReconnaissance data indicate that maximum sustained winds have\nincreased to near 75 mph (120 km/h) with higher gusts.  Additional\nstrengthening is forecast during the next 48 hours, and Maria could\nbe near major hurricane intensity when it moves across the Leeward\nIslands Monday night.\n\nHurricane-force winds extend outward up to 15 miles (30 km) from the\ncenter, and tropical-storm-force winds extend outward up to 105\nmiles (165 km).\n\nThe minimum central pressure measured by the aircraft is 982 mb\n(29.00 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nWIND:  Hurricane conditions are first expected within portions of\nthe Leeward Islands by Monday night, with tropical storm conditions\nbeginning on Monday.  Hurricane conditions are possible within the\nhurricane watch area by Tuesday, with tropical storm conditions\npossible Monday night.  Tropical storm conditions are possible in\nthe tropical storm watch area Monday or Monday night.\n\nSTORM SURGE:  A dangerous storm surge accompanied by large and\ndestructive waves will raise water levels by as much as 4 to 6 feet\nabove normal tide levels near where the center of Maria moves\nacross the Leeward Islands.\n\nRAINFALL:  Maria is expected to produce total rain accumulations of\n6 to 12 inches with isolated maximum amounts of 20 inches across the\nLeeward Islands, including Puerto Rico and the U.S. and\nBritish Virgin Islands through Wednesday night.  Maria is also\nexpected to produce total rain accumulations of 2 to 4 inches for\nthe northern and central Windward Islands.  In all the above areas,\nthese rainfall amounts could cause life-threatening flash floods and\nmudslides.\n\nSURF:  Swells generated by Maria are affecting the Lesser Antilles.\nThese swells are likely to cause life-threatening surf and rip\ncurrent conditions.  Please consult products from your local\nweather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 800 PM AST.\nNext complete advisory at 1100 PM AST.\n\n$$\nForecaster Berg\n\nNNNN",
    "messageBinNumber": "5",
    "messageDateTimeLocal": "20170917 05:00:00 PM AST",
    "messageDateTimeLocalStr": "0500 PM AST Sun Sep 17",
    "messageDateTimeUTC": "20170917 09:00:00 PM UTC",
    "messageDateTimeUTC24": "201709172100",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "WNW OR 285 DEGREES",
    "systemGeoRefPt1": "ABOUT 140 MI...225 KM ENE OF BARBADOS",
    "systemGeoRefPt2": "ABOUT 275 MI...445 KM ESE OF DOMINICA",
    "systemIntensityKph": "120",
    "systemIntensityKts": "65",
    "systemIntensityMph": "75",
    "systemMslpInHg": "29.00",
    "systemMslpMb": "982",
    "systemName": "MARIA",
    "systemSaffirSimpsonCategory": "CATEGORY 1",
    "systemSpeedKph": "24",
    "systemSpeedKts": "13",
    "systemSpeedMph": "15",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1505682000"
  }
}
