{
  "cycloneMessage": {
    "advisoryNumber": "17",
    "atcfID": "AL152017",
    "centerLocLatitude": "17.9",
    "centerLocLatitudeExpanded": "17.9N",
    "centerLocLongitude": "-65.6",
    "centerLocLongitudeExpanded": "65.6W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT5 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Maria Advisory Number  17\nNWS National Hurricane Center Miami FL       AL152017\n500 AM AST Wed Sep 20 2017\n\n...CORE OF EXTREMELY DANGEROUS HURRICANE MARIA NEARING PUERTO\nRICO...\n\n\nSUMMARY OF 500 AM AST...0900 UTC...INFORMATION\n----------------------------------------------\nLOCATION...17.9N 65.6W\nABOUT 15 MI...25 KM SSW OF VIEQUES\nABOUT 50 MI...75 KM SE OF SAN JUAN PUERTO RICO\nMAXIMUM SUSTAINED WINDS...155 MPH...250 KM/H\nPRESENT MOVEMENT...NW OR 305 DEGREES AT 10 MPH...17 KM/H\nMINIMUM CENTRAL PRESSURE...917 MB...27.08 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe government of France has discontinued the Tropical Storm\nWarning for Guadeloupe.\n\nThe government of the Bahamas has issued a Hurricane Warning for\nthe Turks and Caicos Islands and the Southeastern Bahamas.\n\nThe government of the Netherlands has discontinued the Hurricane\nWatch for Saba and St. Eustatius.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Warning is in effect for...\n* U.S. Virgin Islands\n* British Virgin Islands\n* Puerto Rico, Culebra, and Vieques\n* Dominican Republic from Cabo Engano to Puerto Plata\n* Turks and Caicos Islands and the Southeastern Bahamas\n\nA Tropical Storm Warning is in effect for...\n* Saba\n* St. Maarten\n* Dominican Republic west of Puerto Plata to the northern border of\nthe Dominican Republic and Haiti\n* Dominican Republic west of Cabo Engano to Punta Palenque\n\nA Hurricane Watch is in effect for...\n* St. Maarten\n* St. Martin and St. Barthelemy\n* Dominican Republic from Isla Saona to Cabo Engano\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area.  Preparations to protect life and\nproperty should be rushed to completion.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours before\nthe anticipated first occurrence of tropical-storm-force winds,\nconditions that make outside preparations difficult or dangerous.\n\nInterests elsewhere in Hispaniola and the Bahamas should monitor the\nprogress of Maria.\n\nFor storm information specific to your area in the United\nStates, including possible inland watches and warnings, please\nmonitor products issued by your local National Weather Service\nforecast office. For storm information specific to your area outside\nthe United States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 500 AM AST (0900 UTC), the center of Hurricane Maria was located\nnear latitude 17.9 North, longitude 65.6 West. Maria is moving\ntoward the northwest near 10 mph (17 km/h).  A west-northwest\nto northwest motion is expected to continue through today, followed\nby a northwestward motion on Thursday.  On the forecast track the\neye of Maria will make landfall in Puerto Rico in a couple of hours,\ncross Puerto Rico today, and pass just north of the northeast coast\nof the Dominican Republic tonight and Thursday.\n\nMaximum sustained winds are near 155 mph (250 km/h) with higher\ngusts.  Maria is an extremely dangerous category 4 hurricane on the\nSaffir-Simpson Hurricane Wind Scale, and it should maintain this\nintensity until landfall.\n\nHurricane-force winds extend outward up to 60 miles (95 km) from the\ncenter and tropical-storm-force winds extend outward up to 150 miles\n(240 km).  Fajardo recently reported sustained winds of 79 mph (128\nkm/h) with a gust to 100 mph (161 km/h).\n\nThe minimum central pressure recently reported by an Air Force\nHurricane Hunter aircraft is 917 mb (27.08 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nWIND:  Tropical storm and hurricane conditions are occurring over\nthe Virgin Islands and are spreading over Puerto Rico.  Hurricane\nconditions are expected within the Hurricane Warning area in the\nDominican Republic tonight, with tropical storm conditions expected\nby later today.  Tropical storm conditions are expected in the\nTropical Storm Warning areas in the Dominican Republic later\ntoday.  Hurricane conditions are expected within the Hurricane\nWarning area by late Thursday in the Turks and Caicos Islands and\nthe southeastern Bahamas, with tropical storm conditions in this\narea by early Thursday.\n\nWind speeds atop and on the windward sides of hills and mountains\nand on high-rise buildings could be much stronger than the near-\nsurface winds indicated in this advisory.\n\nSTORM SURGE:  A dangerous storm surge accompanied by large and\ndestructive waves will raise water levels by as much as 4 to 6 feet\nabove normal tide levels in the hurricane warning area in the\nDominican Republic, and 1 to 3 ft elsewhere along the northern\ncoasts of the Dominican Republic and Haiti.\n\nA dangerous storm surge accompanied by large and destructive waves\nwill raise water levels by as much as 10 to 15 feet above normal\ntide levels in the Hurricane Warning area near and to the north of\nthe center of Maria for both the Southeastern Bahamas and the Turks\nand Caicos Islands.\n\nThe combination of a dangerous storm surge and the tide will cause\nnormally dry areas near the coast to be flooded by rising waters\nmoving inland from the shoreline.  The water is expected to reach\nthe following heights above ground if the peak surge occurs at the\ntime of high tide...\n\nPuerto Rico and the U.S. Virgin Islands...6 to 9 ft\n\nThe deepest water will occur along the immediate coast near and to\nthe north and east of the landfall location, where the surge will be\naccompanied by large and destructive waves.  Surge-related\nflooding depends on the relative timing of the surge and the tidal\ncycle, and can vary greatly over short distances.  For information\nspecific to your area, please see products issued by your local\nNational Weather Service forecast office.\n\nRAINFALL: Maria is expected to produce the following rain\naccumulations through Friday:\n\nCentral Leeward Islands...additional 1 to 2 inches.\nNorthern Leeward Islands from Barbuda to Anguilla...additional 2 to\n5 inches.\nU.S. and British Virgin Islands...additional 8 to 12 inches,\nisolated 16 inches.\nPuerto Rico...12 to 18 inches, isolated 25 inches.\nNorthern and eastern Dominican Republic and Turks and Caicos...4 to\n8 inches, isolated 12 inches.\nNorthern Haiti and southeastern Bahamas...2 to 4 inches.\n\nRainfall on these islands will cause life-threatening flash floods\nand mudslides.\n\nTORNADOES: Several tornadoes are possible over Puerto Rico and the\nU.S. Virgin Islands today.\n\nTHE EYE: Do not venture outside when the calm eye of the hurricane\npasses over, as dangerous winds will return very quickly when the\neye moves away.\n\nSURF:  Swells generated by Maria are affecting the Leeward Islands,\nPuerto Rico, and the Virgin Islands.  These swells will begin\naffecting the northern coast of Hispaniola, the Turks and Caicos\nIslands, and the Southeastern Bahamas during the next day or two.\nThese swells are likely to cause life-threatening surf and rip\ncurrent conditions.  Please consult products from your local weather\noffice.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 800 AM AST.\nNext complete advisory at 1100 AM AST.\n\n$$\nForecaster Pasch\n\nNNNN",
    "messageBinNumber": "5",
    "messageDateTimeLocal": "20170920 05:00:00 AM AST",
    "messageDateTimeLocalStr": "0500 AM AST Wed Sep 20",
    "messageDateTimeUTC": "20170920 09:00:00 AM UTC",
    "messageDateTimeUTC24": "201709200900",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "NW OR 305 DEGREES",
    "systemGeoRefPt1": "ABOUT 15 MI...25 KM SSW OF VIEQUES",
    "systemGeoRefPt2": "ABOUT 50 MI...75 KM SE OF SAN JUAN PUERTO RICO",
    "systemIntensityKph": "250",
    "systemIntensityKts": "135",
    "systemIntensityMph": "155",
    "systemMslpInHg": "27.08",
    "systemMslpMb": "917",
    "systemName": "MARIA",
    "systemSaffirSimpsonCategory": "CATEGORY 4",
    "systemSpeedKph": "17",
    "systemSpeedKts": "9",
    "systemSpeedMph": "10",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1505898000"
  }
}
