{
  "cycloneMessage": {
    "advisoryNumber": "8",
    "atcfID": "AL152017",
    "centerLocLatitude": "14.6",
    "centerLocLatitudeExpanded": "14.6N",
    "centerLocLongitude": "-59.5",
    "centerLocLongitudeExpanded": "59.5W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT5 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Maria Advisory Number   8\nNWS National Hurricane Center Miami FL       AL152017\n500 AM AST Mon Sep 18 2017\n\n...MARIA HEADED FOR THE LEEWARD ISLANDS...\n...EXPECTED TO BECOME A MAJOR HURRICANE BY TONIGHT OR EARLY\nTUESDAY...\n\n\nSUMMARY OF 500 AM AST...0900 UTC...INFORMATION\n----------------------------------------------\nLOCATION...14.6N 59.5W\nABOUT 100 MI...160 KM E OF MARTINIQUE\nABOUT 130 MI...215 KM ESE OF DOMINICA\nMAXIMUM SUSTAINED WINDS...90 MPH...150 KM/H\nPRESENT MOVEMENT...WNW OR 290 DEGREES AT 13 MPH...20 KM/H\nMINIMUM CENTRAL PRESSURE...977 MB...28.85 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nA Hurricane Watch has been issued for Puerto Rico, Vieques, and\nCulebra.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Warning is in effect for...\n* Guadeloupe\n* Dominica\n* St. Kitts, Nevis, and Montserrat\n* Martinique\n\nA Tropical Storm Warning is in effect for...\n* Antigua and Barbuda\n* Saba and St. Eustatius\n* St. Lucia\n\nA Hurricane Watch is in effect for...\n* Puerto Rico, Vieques, and Culebra\n* U.S. Virgin Islands\n* British Virgin Islands\n* Saba and St. Eustatius\n* St. Maarten\n* St. Martin and St. Barthelemy\n* Anguilla\n\nA Tropical Storm Watch is in effect for...\n* Barbados\n* St. Vincent and the Grenadines\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area.  Preparations to protect life and\nproperty should be rushed to completion.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours\nbefore the anticipated first occurrence of tropical-storm-force\nwinds, conditions that make outside preparations difficult or\ndangerous.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, generally within 48 hours.\n\nInterests elsewhere in the Lesser Antilles and the Dominican\nRepublic should monitor the progress of this system.\n\nFor storm information specific to your area in the United\nStates, including possible inland watches and warnings, please\nmonitor products issued by your local National Weather Service\nforecast office. For storm information specific to your area outside\nthe United States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 500 AM AST (0900 UTC), the center of Hurricane Maria was located\nnear latitude 14.6 North, longitude 59.5 West. Maria is moving\ntoward the west-northwest near 13 mph (20 km/h), and this motion\nwith a decrease in forward speed is expected through Tuesday night.\nOn the forecast track, the center of Maria will move across the\nLeeward Islands late today and tonight and then over the\nextreme northeastern Caribbean Sea Tuesday and Tuesday night.\n\nMaximum sustained winds are near 90 mph (150 km/h) with higher\ngusts.  Significant strengthening is forecast during the next 48\nhours, and Maria is expected to become a dangerous major hurricane\nbefore it moves through the Leeward Islands.\n\nHurricane-force winds extend outward up to 15 miles (30 km) from the\ncenter and tropical-storm-force winds extend outward up to 105 miles\n(165 km).\n\nThe estimated minimum central pressure is 977 mb (28.85 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nWIND:  Hurricane conditions are first expected within portions of\nthe Leeward Islands by late today, with tropical storm conditions\nbeginning during the day today.  Hurricane conditions are possible\nwithin the hurricane watch area by Tuesday, with tropical storm\nconditions possible tonight.  Tropical storm conditions are possible\nin the tropical storm watch area through tonight.\n\nSTORM SURGE:  A dangerous storm surge accompanied by large and\ndestructive waves will raise water levels by as much as 5 to 7 feet\nabove normal tide levels near where the center of Maria moves\nacross the Leeward Islands.\n\nRAINFALL: Maria is expected to produce total rain accumulations of\n6 to 12 inches with isolated maximum amounts of 20 inches across the\ncentral and southern Leeward Islands, including Puerto Rico and the\nU.S. and British Virgin Islands, through Wednesday night.  Maria is\nalso expected to produce total rain accumulations of 2 to 4 inches\nwith isolated maximum amounts of 8 inches over the remaining\nnorthern Leeward Islands from Barbuda to Anguilla, as well as the\nWindward Islands and Barbados.  Rainfall on all of these islands\ncould cause life-threatening flash floods and mudslides.\n\nSURF:  Swells generated by Maria are affecting the Lesser Antilles.\nThese swells are likely to cause life-threatening surf and rip\ncurrent conditions.  Please consult products from your local\nweather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 800 AM AST.\nNext complete advisory at 1100 AM AST.\n\n$$\nForecaster Pasch\n\nNNNN",
    "messageBinNumber": "5",
    "messageDateTimeLocal": "20170918 05:00:00 AM AST",
    "messageDateTimeLocalStr": "0500 AM AST Mon Sep 18",
    "messageDateTimeUTC": "20170918 09:00:00 AM UTC",
    "messageDateTimeUTC24": "201709180900",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "WNW OR 290 DEGREES",
    "systemGeoRefPt1": "ABOUT 100 MI...160 KM E OF MARTINIQUE",
    "systemGeoRefPt2": "ABOUT 130 MI...215 KM ESE OF DOMINICA",
    "systemIntensityKph": "150",
    "systemIntensityKts": "80",
    "systemIntensityMph": "90",
    "systemMslpInHg": "28.85",
    "systemMslpMb": "977",
    "systemName": "MARIA",
    "systemSaffirSimpsonCategory": "CATEGORY 1",
    "systemSpeedKph": "20",
    "systemSpeedKts": "11",
    "systemSpeedMph": "13",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1505725200"
  }
}
