{
  "cycloneMessage": {
    "advisoryNumber": "3A",
    "atcfID": "AL162017",
    "centerLocLatitude": "13.0",
    "centerLocLatitudeExpanded": "13.0N",
    "centerLocLongitude": "-83",
    "centerLocLongitudeExpanded": "83.0W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT1 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Depression Sixteen Intermediate Advisory Number 3A\nNWS National Hurricane Center Miami FL       AL162017\n200 AM EDT Thu Oct 05 2017\n\n...DEPRESSION FORECAST TO BECOME A TROPICAL STORM LATER TODAY...\n...FLOODING RAINS EXPECTED OVER PORTIONS OF CENTRAL AMERICA...\n\n\nSUMMARY OF 200 AM EDT...0600 UTC...INFORMATION\n----------------------------------------------\nLOCATION...13.0N 83.0W\nABOUT 75 MI...120 KM SSE OF PUERTO CABEZAS NICARAGUA\nABOUT 95 MI...150 KM WNW OF SAN ANDRES ISLAND\nMAXIMUM SUSTAINED WINDS...35 MPH...55 KM/H\nPRESENT MOVEMENT...NW OR 310 DEGREES AT 6 MPH...9 KM/H\nMINIMUM CENTRAL PRESSURE...1004 MB...29.65 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Tropical Storm Warning is in effect for...\n* Sandy Bay Sirpi Nicaragua to Punta Castilla Honduras\n\nA Hurricane Watch is in effect for...\n* Punta Herrero to Cabo Catoche Mexico\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area, in this case within\n12-24 hours.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours\nbefore the anticipated first occurrence of tropical-storm-force\nwinds, conditions that make outside preparations difficult or\ndangerous.\n\nInterests elsewhere in Honduras, the Bay Islands, western Cuba and\nthe Yucatan Peninsula should monitor the progress of the depression.\n\nFor storm information specific to your area, please monitor products\nissued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 200 AM EDT (0600 UTC), the center of Tropical Depression Sixteen\nwas located near latitude 13.0 North, longitude 83.0 West.  The\ndepression is moving toward the northwest near 6 mph (9 km/h), and\nthis motion is expected to continue this morning.  A north-\nnorthwestward motion at a faster forward speed is forecast to begin\nlater today and continue through late Friday.  On the forecast\ntrack, the center of the depression should move across northeastern\nNicaragua and eastern Honduras later today and then over the\nnorthwestern Caribbean Sea Thursday night and Friday.  The center is\nexpected to approach the coast of the Yucatan peninsula late Friday.\n\nMaximum sustained winds are near 35 mph (55 km/h) with higher gusts.\nThe depression is forecast to strengthen to a tropical storm before\nit moves inland over northeastern Nicaragua.  Additional\nstrengthening is likely over the northwestern Caribbean Sea Thursday\nnight and Friday.\n\nThe estimated minimum central pressure is 1004 mb (29.65 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL: The depression is expected to produce the following rain\naccumulations through Friday night:\n\nNicaragua...15 to 20 inches, isolated 30 inches\nCosta Rica and Panama...5 to 10 inches, isolated 20 inches\nHonduras...2 to 5 inches, isolated 8 inches\n\nHeavy rainfall will occur over a wide area, including locations well\naway from the center along the Pacific coast of Central America.\nThis rainfall could cause life-threatening flash floods and\nmudslides.\n\nWIND:  Tropical storm conditions are expected to start in the\nwarning area in Nicaragua later this morning, and spread into\nHonduras late today.  Tropical storm and hurricane conditions are\npossible within the watch area in Mexico beginning late Friday.\n\nSURF:  Swells generated by the cyclone are affecting portions of\nthe coast of Nicaragua, and will begin to affect other land areas\naround the northwestern Caribbean later this week.  These swells are\nlikely to cause life-threatening surf and rip current conditions.\nPlease consult products from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 500 AM EDT.\n\n$$\nForecaster Brown\n\nNNNN",
    "messageBinNumber": "1",
    "messageDateTimeLocal": "20171005 02:00:00 AM EDT",
    "messageDateTimeLocalStr": "0200 AM EDT Thu Oct 05",
    "messageDateTimeUTC": "20171005 06:00:00 AM UTC",
    "messageDateTimeUTC24": "201710050600",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "NW OR 310 DEGREES",
    "systemGeoRefPt1": "ABOUT 75 MI...120 KM SSE OF PUERTO CABEZAS NICARAGUA",
    "systemGeoRefPt2": "ABOUT 95 MI...150 KM WNW OF SAN ANDRES ISLAND",
    "systemIntensityKph": "55",
    "systemIntensityKts": "30",
    "systemIntensityMph": "35",
    "systemMslpInHg": "29.65",
    "systemMslpMb": "1004",
    "systemName": "SIXTEEN",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "9",
    "systemSpeedKts": "5",
    "systemSpeedMph": "6",
    "systemType": "TROPICAL DEPRESSION",
    "timeEpochSeconds": "1507183200"
  }
}
