{
  "cycloneMessage": {
    "advisoryNumber": "14",
    "atcfID": "AL162017",
    "centerLocLatitude": "28.4",
    "centerLocLatitudeExpanded": "28.4N",
    "centerLocLongitude": "-89.1",
    "centerLocLongitudeExpanded": "89.1W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT1 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nHurricane Nate Advisory Number  14\nNWS National Hurricane Center Miami FL       AL162017\n400 PM CDT Sat Oct 07 2017\n\n...CENTER OF NATE APPROACHING THE MOUTH OF THE MISSISSIPPI RIVER...\n...TROPICAL STORM CONDITIONS SPREADING ONSHORE IN SOUTHEASTERN\nLOUISIANA...\n\n\nSUMMARY OF 400 PM CDT...2100 UTC...INFORMATION\n----------------------------------------------\nLOCATION...28.4N 89.1W\nABOUT 50 MI...80 KM S OF THE MOUTH OF THE MISSISSIPPI RIVER\nABOUT 140 MI...225 KM S OF BILOXI MISSISSIPPI\nMAXIMUM SUSTAINED WINDS...90 MPH...150 KM/H\nPRESENT MOVEMENT...NNW OR 345 DEGREES AT 23 MPH...37 KM/H\nMINIMUM CENTRAL PRESSURE...981 MB...28.97 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe Storm Surge Warning has been discontinued west of Grand Isle.\n\nThe Hurricane Watch is discontinued from west of Grand Isle to\nMorgan City.\n\nThe Storm Surge Watch has been discontinued east of the\nOkaloosa/Walton County Line to Indian Pass.\n\nThe Tropical Storm Watch has been discontinued from west of Morgan\nCity to Intracoastal City.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Warning is in effect for...\n* Grand Isle Louisiana to the Alabama/Florida border\n* Metropolitan New Orleans and Lake Pontchartrain\n\nA Storm Surge Warning is in effect for...\n* Grand Isle Louisiana to the Okaloosa/Walton County Line Florida\n* Northern and western shores of Lake Pontchartrain\n\nA Tropical Storm Warning is in effect for...\n* Lake Maurepas\n* West of Grand Isle to Morgan City Louisiana\n* East of the Alabama/Florida border to Indian Pass Florida\n\nA Hurricane Watch is in effect for...\n* Lake Maurepas\n* East of the Alabama/Florida border to the Okaloosa/Walton County\nLine\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area, in this case within the next 24\nhours. Preparations to protect life and property should be rushed to\ncompletion.\n\nA Storm Surge Warning means there is a danger of life-threatening\ninundation, from rising water moving inland from the coastline,\nduring the next 36 hours in the indicated locations. For a\ndepiction of areas at risk, please see the National Weather Service\nStorm Surge Watch/Warning Graphic, available at hurricanes.gov.\nThis is a life-threatening situation.  Persons located within these\nareas should take all necessary actions to protect life and property\nfrom rising water and the potential for other dangerous conditions.\nPromptly follow evacuation and other instructions from local\nofficials.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.\n\nFor storm information specific to your area, including possible\ninland watches and warnings, please monitor products issued by your\nlocal National Weather Service forecast office.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 400 PM CDT (2100 UTC), the center of Hurricane Nate was located\nnear latitude 28.4 North, longitude 89.1 West.  Nate is moving\ntoward the north-northwest near 23 mph (37 km/h).  A turn toward the\nnorth and a slight decrease in forward speed are expected during the\nnext several hours, followed by a turn toward the north-northeast\nlater tonight.  A motion toward the northeast is expected on\nSunday. On the forecast track, the center of Nate will pass near or\nover the mouth of the Mississippi River during the next few hours,\nthen make landfall along the coasts of southeastern Louisiana or\nMississippi tonight.  After landfall, the center of Nate is expected\nto pass over portions of Mississippi, Alabama, and Tennessee late\ntonight through Sunday night.\n\nMaximum sustained winds are near 90 mph (150 km/h) with higher\ngusts.  Some strengthening is possible before landfall, and Nate\ncould still become a category 2 hurricane on the Saffir-Simpson\nHurricane Wind Scale this evening.  Rapid weakening is expected\nafter landfall.\n\nHurricane-force winds extend outward up to 40 miles (65 km) from the\ncenter, and tropical-storm-force winds extend outward up to 125\nmiles (205 km) mainly to the east of the center.  The NOAA automated\nstation at Southwest Pass, Louisiana, recent reported sustained\nwinds of 48 mph (78 km/h) and a wind gust of 60 mph (96 km/h) at an\nelevation of 125 feet.\n\nThe estimated minimum central pressure is 981 mb (28.97 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nWIND:  Along the northern Gulf Coast, hurricane conditions are\nexpected in the hurricane warning area in the next few hours, with\ntropical storm conditions currently spreading onshore.  Tropical\nstorm conditions are expected in the tropical storm warning area\ntonight and Sunday morning.  Hurricane conditions are possible in\nthe hurricane watch area tonight.\n\nSTORM SURGE: The combination of a dangerous storm surge and the tide\nwill cause normally dry areas near the coast to be flooded by rising\nwaters moving inland from the shoreline.  The water is expected to\nreach the following heights above ground if the peak surge occurs at\nthe time of high tide...\n\nMouth of the Mississippi River to the Mississippi/Alabama border...7\nto 11 ft\nMississippi/Alabama border to the Alabama/Florida border, including\nMobile Bay...6 to 9 ft\nAlabama/Florida border to the Okaloosa/Walton County Line...4 to 6\nft\nGrand Isle, Louisiana to the mouth of the Mississippi River...2 to\n4 ft\nOkaloosa/Walton County Line to Indian Pass, Florida...2 to 3 ft\nIndian Pass to Crystal River, Florida...1 to 3 ft\nMorgan City, Louisiana to Grand Isle...1 to 2 ft\n\nThe deepest water will occur along the immediate coast near and to\nthe east of the landfall location, where the surge will be\naccompanied by large and destructive waves.  Surge-related\nflooding depends on the relative timing of the surge and the tidal\ncycle, and can vary greatly over short distances.  For information\nspecific to your area, please see products issued by your local\nNational Weather Service forecast office.\n\nRAINFALL:  Nate is expected to produce the following rain\naccumulations through Monday:\n\nWestern Cuba: 2 to 4 inches, max 6 inches.\n\nEast of the Mississippi River from the central Gulf Coast into the\nDeep South, eastern Tennessee Valley, and southern Appalachians:\n3 to 6 inches, max 10 inches.\n\nAcross the Ohio Valley into the central Appalachians:\n2 to 5 inches, max 7 inches.\n\nTORNADOES: A few tornadoes are possible across parts of Alabama, the\nwestern Florida Panhandle, western Georgia, and southern Mississippi\nthrough Sunday afternoon.\n\nSURF:  Swells generated by Nate will affect land areas around the\nGulf of Mexico during the next day or so.  These swells are likely\nto cause life-threatening surf and rip current conditions. Please\nconsult products from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 700 PM CDT.\nNext complete advisory at 1000 PM CDT.\n\n$$\nForecaster Beven\n\nNNNN",
    "messageBinNumber": "1",
    "messageDateTimeLocal": "20171007 04:00:00 PM CDT",
    "messageDateTimeLocalStr": "0400 PM CDT Sat Oct 07",
    "messageDateTimeUTC": "20171007 09:00:00 PM UTC",
    "messageDateTimeUTC24": "201710072100",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "NNW OR 345 DEGREES",
    "systemGeoRefPt1": "ABOUT 50 MI...80 KM S OF THE MOUTH OF THE MISSISSIPPI RIVER",
    "systemGeoRefPt2": "ABOUT 140 MI...225 KM S OF BILOXI MISSISSIPPI",
    "systemIntensityKph": "150",
    "systemIntensityKts": "80",
    "systemIntensityMph": "90",
    "systemMslpInHg": "28.97",
    "systemMslpMb": "981",
    "systemName": "NATE",
    "systemSaffirSimpsonCategory": "CATEGORY 1",
    "systemSpeedKph": "37",
    "systemSpeedKts": "20",
    "systemSpeedMph": "23",
    "systemType": "HURRICANE",
    "timeEpochSeconds": "1507410000"
  }
}
