{
  "cycloneMessage": {
    "advisoryNumber": "16",
    "atcfID": "AL162017",
    "centerLocLatitude": "31.5",
    "centerLocLatitudeExpanded": "31.5N",
    "centerLocLongitude": "-88.4",
    "centerLocLongitudeExpanded": "88.4W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT1 ALL\nTTAA00 KNHC DDHHMM CCA\n\nBULLETIN\nTropical Storm Nate Advisory Number  16...Corrected\nNWS National Hurricane Center Miami FL       AL162017\n400 AM CDT Sun Oct 08 2017\n\nCorrected Storm Surge breakpoint in Hazards section\n\n...NATE MOVING FARTHER INLAND OVER MISSISSIPPI AND ALABAMA...\n...RAPID WEAKENING ANTICIPATED...\n\n\nSUMMARY OF 400 AM CDT...0900 UTC...INFORMATION\n----------------------------------------------\nLOCATION...31.5N 88.4W\nABOUT 80 MI...130 KM NNE OF BILOXI MISSISSIPPI\nABOUT 135 MI...215 KM WSW OF MONTGOMERY ALABAMA\nMAXIMUM SUSTAINED WINDS...70 MPH...110 KM/H\nPRESENT MOVEMENT...NNE OR 25 DEGREES AT 23 MPH...37 KM/H\nMINIMUM CENTRAL PRESSURE...986 MB...29.12 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe Hurricane Warning for Mouth of the Pearl River to the\nAlabama/Florida border has been discontinued.\n\nThe Tropical Storm Warning west of the Mouth of the Pearl River,\nincluding Metropolitan New Orleans, and Lakes Pontchartrain and\nMaurepas has been discontinued.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Storm Surge Warning is in effect for...\n* North of Pointe a la Hache to the Okaloosa/Walton County Line\nFlorida\n\nA Tropical Storm Warning is in effect for...\n* Mouth of Pearl River eastward to Indian Pass Florida\n\nA Storm Surge Warning means there is a danger of life-threatening\ninundation, from rising water moving inland from the coastline in\nthe indicated locations. For a depiction of areas at risk, please\nsee the National Weather Service Storm Surge Watch/Warning Graphic,\navailable at hurricanes.gov.  This is a life-threatening situation.\nPersons located within these areas should take all necessary actions\nto protect life and property from rising water and the potential for\nother dangerous conditions.\n\nFor storm information specific to your area, including possible\ninland watches and warnings, please monitor products issued by your\nlocal National Weather Service forecast office.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 400 AM CDT (0900 UTC), the center of Tropical Storm Nate was\nlocated near latitude 31.5 North, longitude 88.4 West. Nate is\nmoving toward the north-northeast near 23 mph (37 km/h). A turn\ntoward the northeast with an increase in forward speed is expected\nduring the next couple of days.  On the forecast track, Nate's\ncenter will continue to move inland across the Deep South, Tennessee\nValley, and central Appalachian Mountains through Monday.\n\nMaximum sustained winds are near 70 mph (110 km/h) with higher\ngusts.  Nate is expected to continue to quickly weaken as it moves\nfarther inland. It should degenerate into a remnant low late\nMonday.\n\nTropical-storm-force winds extend outward up to 90 miles (150 km)\nfrom the center. Mobile airport recently reported a wind gust of\n54 mph (87 km/h).\n\nThe estimated minimum central pressure is 986 mb (29.12 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nWIND:  Tropical storm conditions are expected to continue in the\ntropical storm warning area for the next several hours.\n\nSTORM SURGE: The combination of a dangerous storm surge and the tide\nwill cause normally dry areas near the coast to be flooded by rising\nwaters moving inland from the shoreline.  The water is expected to\nreach the following heights above ground if the peak surge occurs at\nthe time of high tide...\n\nMouth of the Pearl River to the Alabama/Florida border, including\nMobile Bay...5 to 8 ft\nNorth of Pointe a la Hache to the mouth of the Pearl River...4 to 6\nft.\nAlabama/Florida border to the Okaloosa/Walton County Line...3 to 5\nft\nMorgan City, Louisiana to Pointe a la Hache...1 to 3 ft\nOkaloosa/Walton County Line to Indian Pass, Florida...2 to 3 ft\nIndian Pass to Crystal River, Florida...1 to 3 ft\n\nThe deepest water will occur along the immediate coast near and to\nthe east of the landfall location, where the surge will be\naccompanied by large and destructive waves.  Surge-related\nflooding depends on the relative timing of the surge and the tidal\ncycle, and can vary greatly over short distances.  For information\nspecific to your area, please see products issued by your local\nNational Weather Service forecast office.\n\nRAINFALL:  Nate is expected to produce the following rain\naccumulations through Monday:\n\nEast of the Mississippi River from the central Gulf Coast into the\nDeep South, eastern Tennessee Valley, and southern Appalachians:\n3 to 6 inches, max 10 inches.\n\nAcross the Ohio Valley into the central Appalachians:\n2 to 5 inches, max 7 inches.\n\nTORNADOES:  Isolated tornadoes are possible today, mainly from the\nFlorida Panhandle and eastern Alabama across western and northern\nGeorgia.\n\nSURF:  Swells generated by Nate will affect land areas around the\nGulf of Mexico through this evening.  These swells are likely\nto cause life-threatening surf and rip current conditions. Please\nconsult products from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 700 AM CDT.\nNext complete advisory at 1000 AM CDT.\n\n$$\nForecaster Avila\n\nNNNN",
    "messageBinNumber": "1",
    "messageDateTimeLocal": "20171008 04:00:00 AM CDT",
    "messageDateTimeLocalStr": "0400 AM CDT Sun Oct 08",
    "messageDateTimeUTC": "20171008 09:00:00 AM UTC",
    "messageDateTimeUTC24": "201710080900",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "NNE OR 25 DEGREES",
    "systemGeoRefPt1": "ABOUT 80 MI...130 KM NNE OF BILOXI MISSISSIPPI",
    "systemGeoRefPt2": "ABOUT 135 MI...215 KM WSW OF MONTGOMERY ALABAMA",
    "systemIntensityKph": "110",
    "systemIntensityKts": "60",
    "systemIntensityMph": "70",
    "systemMslpInHg": "29.12",
    "systemMslpMb": "986",
    "systemName": "NATE",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "37",
    "systemSpeedKts": "20",
    "systemSpeedMph": "23",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1507453200"
  }
}
