{
  "cycloneMessage": {
    "advisoryNumber": "10A",
    "atcfID": "AL162017",
    "centerLocLatitude": "21.4",
    "centerLocLatitudeExpanded": "21.4N",
    "centerLocLongitude": "-85.9",
    "centerLocLongitudeExpanded": "85.9W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT1 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Nate Intermediate Advisory Number 10A\nNWS National Hurricane Center Miami FL       AL162017\n700 PM CDT Fri Oct 06 2017\n\n...HURRICANE HUNTER PLANES FIND NATE A LITTLE STRONGER...\n...CENTER NOW MOVING THROUGH THE YUCATAN CHANNEL...\n\n\nSUMMARY OF 700 PM CDT...0000 UTC...INFORMATION\n----------------------------------------------\nLOCATION...21.4N 85.9W\nABOUT 90 MI...145 KM NE OF COZUMEL MEXICO\nABOUT 570 MI...915 KM SSE OF THE MOUTH OF THE MISSISSIPPI RIVER\nMAXIMUM SUSTAINED WINDS...65 MPH...100 KM/H\nPRESENT MOVEMENT...NNW OR 340 DEGREES AT 22 MPH...35 KM/H\nMINIMUM CENTRAL PRESSURE...990 MB...29.23 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Warning is in effect for...\n* Grand Isle Louisiana to the Alabama/Florida border\n* Metropolitan New Orleans and Lake Pontchartrain\n\nA Storm Surge Warning is in effect for...\n* Morgan City Louisiana to the Okaloosa/Walton County Line Florida\n* Northern and western shores of Lake Pontchartrain\n\nA Tropical Storm Warning is in effect for...\n* Punta Herrero to Rio Lagartos Mexico\n* Pinar del Rio Cuba\n* Lake Maurepas\n* West of Grand Isle to Morgan City Louisiana\n* East of the Alabama/Florida border to the Okaloosa/Walton County\nLine.\n\nA Hurricane Watch is in effect for...\n* Punta Herrero to Rio Lagartos Mexico\n* Lake Maurepas\n* East of the Alabama/Florida border to the Okaloosa/Walton County\nLine\n* West of Grand Isle to Morgan City Louisiana\n\nA Storm Surge Watch is in effect for...\n* East of the the Okaloosa/Walton County Line to Indian Pass Florida\n\nA Tropical Storm Watch is in effect for...\n* East of the Okaloosa/Walton County Line to Indian Pass Florida\n* West of Morgan City to Intracoastal City Louisiana\n* Isle of Youth Cuba\n\nA Hurricane Warning means that hurricane conditions are expected\nsomewhere within the warning area.  A warning is typically issued\n36 hours before the anticipated first occurrence of tropical-storm-\nforce winds, conditions that make outside preparations difficult or\ndangerous.  Preparations to protect life and property should be\nrushed to completion.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area.\n\nA Storm Surge Watch means there is a possibility of life-\nthreatening inundation, from rising water moving inland from the\ncoastline, in the indicated locations during the next 48 hours.\nFor a depiction of areas at risk, please see the National Weather\nService Storm Surge Watch/Warning Graphic, available at\nhurricanes.gov.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, generally within 48 hours.\n\nInterests elsewhere in western Cuba, the Yucatan Peninsula, and the\nnorthern coast of the Gulf of Mexico should monitor the progress of\nNate.\n\nFor storm information specific to your area in the United States,\nincluding possible inland watches and warnings, please monitor\nproducts issued by your local National Weather Service forecast\noffice. For storm information specific to your area outside the\nUnited States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 700 PM CDT (0000 UTC), the center of Tropical Storm Nate was\nlocated by NOAA and Air Force Reserve Hurricane Hunter planes near\nlatitude 21.4 North, longitude 85.9 West.  Nate is moving toward the\nnorth-northwest near 22 mph (35 km/h), and this motion is expected\nto continue through Saturday, with a turn toward the north and\nnortheast expected Saturday night and Sunday.  On the forecast\ntrack, the center of Nate will move near the northeastern coast of\nthe Yucatan peninsula this evening.  Nate will then move into the\nsouthern Gulf of Mexico tonight, approach the northern Gulf coast\nSaturday, and then make landfall over the northern Gulf coast\nSaturday night or Sunday.\n\nReports from the reconnaissance planes indicate that maximum\nsustained winds have increased to near 65 mph (100 km/h) with higher\ngusts.  Additional strengthening is forecast during the next 36\nhours, and Nate is expected to become a hurricane by the time it\nreaches the northern Gulf of Mexico.\n\nTropical-storm-force winds extend outward up to 125 miles (205 km)\nmainly to the east of the center.\n\nThe minimum central pressure based on data from the aircraft is 990\nmb (29.23 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Nate is expected to produce the following rain\naccumulations through Monday:\n\nWestern Nicaragua, Honduras, and El Salvador: Lingering inflow bands\nwill bring additional 2-4 inches, max 6 inches.\nEastern Yucatan and western Cuba: 2 to 4 inches, max 6 inches.\nEastern Belize and the Cayman Islands: 1 to 3 inches.\n\nEast of the Mississippi River from the central Gulf Coast into the\nDeep South, eastern Tennessee Valley, and southern Appalachians:\n3 to 6 inches, max 10 inches.\n\nAcross the lower Ohio Valley into the central Appalachians:\n2 to 4 inches, max 6 inches.\n\nHeavy rainfall will occur over a wide area, including locations well\naway from the center along the Pacific coast of Central America.\nRainfall across all of these areas may produce life-threatening\nflash floods and mudslides.\n\nWIND:  Hurricane conditions are possible within the hurricane watch\narea in Mexico tonight, with tropical storm conditions expected\nduring the next few hours.  Tropical storm conditions are expected\nin the warning area in Cuba tonight, and are possible in the\nwatch area in Cuba tonight.\n\nAlong the northern Gulf Coast, hurricane conditions are expected in\nthe hurricane warning area Saturday night, with tropical storm\nconditions expected by late Saturday. Tropical storm conditions are\nexpected in the tropical storm warning area by Saturday night.\nHurricane conditions are possible in the hurricane watch area\nSaturday night, and tropical storm conditions are possible in the\ntropical storm watch area Saturday night and Sunday.\n\nSTORM SURGE: In the United States, the combination of a dangerous\nstorm surge and the tide will cause normally dry areas near the\ncoast to be flooded by rising waters moving inland from the\nshoreline.  The water is expected to reach the following heights\nabove ground if the peak surge occurs at the time of high tide...\n\nMorgan City, Louisiana to the mouth of the Mississippi River...4 to\n6 ft\nMouth of the Mississippi River to the Alabama/Florida border...5 to\n8 ft\nAlabama/Florida border to the Okaloosa/Walton County Line...4 to 6\nft\nOkaloosa/Walton County Line to Indian Pass, Florida...2 to 4 ft\nIndian Pass to Crystal River, Florida...1 to 3 ft\n\nThe deepest water will occur along the immediate coast near and to\nthe east of the landfall location, where the surge will be\naccompanied by large and destructive waves.  Surge-related\nflooding depends on the relative timing of the surge and the tidal\ncycle, and can vary greatly over short distances.  For information\nspecific to your area, please see products issued by your local\nNational Weather Service forecast office.\n\nIn Mexico, a storm surge will raise water levels by as much as 1\nto 3 feet above normal tide levels along the immediate coast in\nareas of onshore winds on the Yucatan Peninsula and the adjacent\nislands.  Near the coast, the surge will be accompanied by large and\ndestructive waves.\n\nSURF:  Swells generated by Nate will affect land areas around the\nnorthwestern Caribbean during the next day or so.  These swells are\nlikely to cause life-threatening surf and rip current conditions.\nPlease consult products from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 1000 PM CDT.\n\n$$\nForecaster Berg\n\nNNNN",
    "messageBinNumber": "1",
    "messageDateTimeLocal": "20171006 07:00:00 PM CDT",
    "messageDateTimeLocalStr": "0700 PM CDT Fri Oct 06",
    "messageDateTimeUTC": "20171007 12:00:00 AM UTC",
    "messageDateTimeUTC24": "201710070000",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "NNW OR 340 DEGREES",
    "systemGeoRefPt1": "ABOUT 90 MI...145 KM NE OF COZUMEL MEXICO",
    "systemGeoRefPt2": "ABOUT 570 MI...915 KM SSE OF THE MOUTH OF THE MISSISSIPPI RIVER",
    "systemIntensityKph": "100",
    "systemIntensityKts": "55",
    "systemIntensityMph": "65",
    "systemMslpInHg": "29.23",
    "systemMslpMb": "990",
    "systemName": "NATE",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "35",
    "systemSpeedKts": "19",
    "systemSpeedMph": "22",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1507334400"
  }
}
