{
  "cycloneMessage": {
    "advisoryNumber": "4",
    "atcfID": "AL162017",
    "centerLocLatitude": "13.3",
    "centerLocLatitudeExpanded": "13.3N",
    "centerLocLongitude": "-83.3",
    "centerLocLongitudeExpanded": "83.3W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT1 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Depression Sixteen Advisory Number   4\nNWS National Hurricane Center Miami FL       AL162017\n500 AM EDT Thu Oct 05 2017\n\n...TROPICAL DEPRESSION APPROACHING THE COAST OF NICARAGUA...\n...FLOODING RAINS EXPECTED OVER PORTIONS OF CENTRAL AMERICA...\n\n\nSUMMARY OF 500 AM EDT...0900 UTC...INFORMATION\n----------------------------------------------\nLOCATION...13.3N 83.3W\nABOUT 50 MI...80 KM S OF PUERTO CABEZAS NICARAGUA\nMAXIMUM SUSTAINED WINDS...35 MPH...55 KM/H\nPRESENT MOVEMENT...NW OR 315 DEGREES AT 7 MPH...11 KM/H\nMINIMUM CENTRAL PRESSURE...1004 MB...29.65 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe government of Mexico has extended the Hurricane Watch westward\nalong the northern coast of the Yucatan peninsula to Rio Lagartos.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Tropical Storm Warning is in effect for...\n* Sandy Bay Sirpi Nicaragua to Punta Castilla Honduras\n\nA Hurricane Watch is in effect for...\n* Punta Herrero to Rio Lagartos Mexico\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area.\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.  A watch is typically issued 48 hours\nbefore the anticipated first occurrence of tropical-storm-force\nwinds, conditions that make outside preparations difficult or\ndangerous.\n\nInterests elsewhere in Honduras, the Bay Islands, western Cuba and\nthe Yucatan Peninsula should monitor the progress of the depression.\n\nFor storm information specific to your area, please monitor products\nissued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 500 AM EDT (0900 UTC), the center of Tropical Depression Sixteen\nwas located near latitude 13.3 North, longitude 83.3 West. The\ndepression is moving toward the northwest near 7 mph (11 km/h), and\nthis motion is expected to continue this morning.  A north-\nnorthwestward motion at a faster forward speed is forecast to begin\nlater today and continue through Friday night.  On the forecast\ntrack, the center of the depression should move across northeastern\nNicaragua and eastern Honduras later today and then over the\nnorthwestern Caribbean Sea Thursday night and Friday.  The center is\nexpected to approach the coast of the Yucatan peninsula late\nFriday.\n\nMaximum sustained winds are near 35 mph (55 km/h) with higher gusts.\nThe depression could strengthen to a tropical storm before\nit moves inland over northeastern Nicaragua today.  Strengthening\nis likely over the northwestern Caribbean Sea Thursday night and\nFriday.\n\nThe estimated minimum central pressure is 1004 mb (29.65 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL: The depression is expected to produce the following rain\naccumulations through Friday night:\n\nNicaragua...15 to 20 inches, isolated 30 inches\nCosta Rica and Panama...5 to 10 inches, isolated 20 inches\nHonduras and Belize...2 to 5 inches, isolated 8 inches\nEastern portions of the Yucatan peninsula...4 to 8 inches, isolated\n12 inches\n\nHeavy rainfall will occur over a wide area, including locations well\naway from the center along the Pacific coast of Central America.\nThis rainfall could cause life-threatening flash floods and\nmudslides.\n\nWIND:  Tropical storm conditions are expected within portions of the\nwarning area in Nicaragua and Honduras late today and tonight.\nTropical storm and hurricane conditions are possible within the\nwatch area in Mexico beginning late Friday.\n\nSURF:  Swells generated by the cyclone are affecting portions of\nthe coast of Nicaragua, and will begin to affect other land areas\naround the northwestern Caribbean later this week.  These swells are\nlikely to cause life-threatening surf and rip current conditions.\nPlease consult products from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 800 AM EDT.\nNext complete advisory at 1100 AM EDT.\n\n$$\nForecaster Brown\n\nNNNN",
    "messageBinNumber": "1",
    "messageDateTimeLocal": "20171005 05:00:00 AM EDT",
    "messageDateTimeLocalStr": "0500 AM EDT Thu Oct 05",
    "messageDateTimeUTC": "20171005 09:00:00 AM UTC",
    "messageDateTimeUTC24": "201710050900",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "NW OR 315 DEGREES",
    "systemGeoRefPt1": "ABOUT 50 MI...80 KM S OF PUERTO CABEZAS NICARAGUA",
    "systemIntensityKph": "55",
    "systemIntensityKts": "30",
    "systemIntensityMph": "35",
    "systemMslpInHg": "29.65",
    "systemMslpMb": "1004",
    "systemName": "SIXTEEN",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "11",
    "systemSpeedKts": "6",
    "systemSpeedMph": "7",
    "systemType": "TROPICAL DEPRESSION",
    "timeEpochSeconds": "1507194000"
  }
}
