{
  "cycloneMessage": {
    "advisoryNumber": "5",
    "atcfID": "AL182017",
    "centerLocLatitude": "23.0",
    "centerLocLatitudeExpanded": "23.0N",
    "centerLocLongitude": "-82.6",
    "centerLocLongitudeExpanded": "82.6W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPAT3 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Philippe Advisory Number   5\nNWS National Hurricane Center Miami FL       AL182017\n500 PM EDT Sat Oct 28 2017\n\n...DEPRESSION STRENGTHENS INTO TROPICAL STORM PHILIPPE...\n...HEAVY RAINS OCCURRING OVER CENTRAL AND WESTERN CUBA AND SPREADING\nNORTHWARD ACROSS THE FLORIDA KEYS AND SOUTH FLORIDA...\n\n\nSUMMARY OF 500 PM EDT...2100 UTC...INFORMATION\n----------------------------------------------\nLOCATION...23.0N 82.6W\nABOUT 20 MI...30 KM SW OF HAVANA CUBA\nABOUT 120 MI...195 KM SSW OF KEY WEST FLORIDA\nMAXIMUM SUSTAINED WINDS...40 MPH...65 KM/H\nPRESENT MOVEMENT...N OR 355 DEGREES AT 29 MPH...46 KM/H\nMINIMUM CENTRAL PRESSURE...1002 MB...29.59 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Tropical Storm Warning is in effect for...\n* Cuban provinces of Isla de la Juventud, La Habana, Ciudad de la\nHabana, Matanzas, Cienfuegos, and Villa Clara\n* Northwestern Bahamas\n\nA Tropical Storm Watch is in effect for...\n* Craig Key to Golden Beach\n* Central Bahamas\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area, in this case within the\nnext 12-18 hours.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, in this case within 24 hours.\n\nInterests in the Cayman Islands should monitor the progress of this\nsystem.\n\nFor storm information specific to your area in the United States,\nincluding possible inland watches and warnings, please monitor\nproducts issued by your local National Weather Service forecast\noffice. For storm information specific to your area outside the\nUnited States, please monitor products issued by your national\nmeteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 500 PM EDT (2100 UTC), the center of Tropical Storm Philippe was\nlocated by surface observations, radar data, and satellite images\nnear latitude 23.0 North, longitude 82.6 West. Philippe is moving\ntoward the north near 29 mph (46 km/h) and this motion is expected\nto continue this evening, followed by a turn toward the northeast\nby early Sunday morning. A faster motion toward the northeast is\nexpected on Sunday and continuing into Monday.  On the forecast\ntrack, the center of Philippe will move off of the northern coast\nof Cuba and into the Straits of Florida this evening, and move\nacross the Florida Keys or the southern tip of the Florida peninsula\novernight, and across the northwestern Bahamas Sunday morning.\n\nMaximum sustained winds have increased to near 40 mph (65 km/h) with\nhigher gusts. Additional strengthening is forecast during the next\n48 hours.\n\nTropical-storm-force winds extend outward up to 105 miles (165 km)\nmainly to the east and southeast of the center. A wind gust of 37\nmph (59 km/h) was recently reported at Key West International\nAirport.\n\nThe estimated minimum central pressure based on surface observations\nis 1002 mb (29.59 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL: Philippe is expected to produce the following rainfall\ntotals:\n\nThe Cayman Islands, western and central Cuba, northern Bahamas:\n4 to 8 inches with isolated maximum totals of 10 inches through\nSunday. These rainfall amounts may produce life threatening flash\nfloods and mudslides.\n\nSouth Florida, including the Keys: 2 to 4 inches with isolated\nmaximum totals of 6 inches through Sunday. These rainfall totals\nmay produce flash flooding, especially in urbanized areas.\n\nWIND:  Tropical storm conditions are likely occurring in the\nwarning area across Cuba. Tropical storm conditions are expected to\noccur in the warning area later tonight across the northwestern\nBahamas.  Tropical storm conditions are possible across the upper\nFlorida Keys and southeast Florida overnight, and in the central\nBahamas by Sunday morning.\n\nTORNADOES:  A couple of brief tornadoes are possible across portions\nof South Florida and the Florida Keys this afternoon and evening.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 800 PM EDT.\nNext complete advisory at 1100 PM EDT.\n\n$$\nForecaster Stewart\n\nNNNN",
    "messageBinNumber": "3",
    "messageDateTimeLocal": "20171028 05:00:00 PM EDT",
    "messageDateTimeLocalStr": "0500 PM EDT Sat Oct 28",
    "messageDateTimeUTC": "20171028 09:00:00 PM UTC",
    "messageDateTimeUTC24": "201710282100",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "N OR 355 DEGREES",
    "systemGeoRefPt1": "ABOUT 20 MI...30 KM SW OF HAVANA CUBA",
    "systemGeoRefPt2": "ABOUT 120 MI...195 KM SSW OF KEY WEST FLORIDA",
    "systemIntensityKph": "65",
    "systemIntensityKts": "35",
    "systemIntensityMph": "40",
    "systemMslpInHg": "29.59",
    "systemMslpMb": "1002",
    "systemName": "PHILIPPE",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "46",
    "systemSpeedKts": "25",
    "systemSpeedMph": "29",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1509224400"
  }
}
