{
  "cycloneMessage": {
    "advisoryNumber": "15",
    "atcfID": "EP142017",
    "centerLocLatitude": "27.2",
    "centerLocLatitudeExpanded": "27.2N",
    "centerLocLongitude": "-113.6",
    "centerLocLongitudeExpanded": "113.6W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPEP4 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Lidia Advisory Number  15\nNWS National Hurricane Center Miami FL       EP142017\n300 AM MDT Sat Sep 02 2017\n\n...LIDIA'S CENTER MOVES INLAND AGAIN OVER NORTHERN BAJA CALIFORNIA\nSUR...\n\n\nSUMMARY OF 300 AM MDT...0900 UTC...INFORMATION\n----------------------------------------------\nLOCATION...27.2N 113.6W\nABOUT 80 MI...130 KM W OF SANTA ROSALIA MEXICO\nABOUT 100 MI...160 KM ESE OF PUNTA EUGENIA MEXICO\nMAXIMUM SUSTAINED WINDS...45 MPH...75 KM/H\nPRESENT MOVEMENT...NW OR 320 DEGREES AT 12 MPH...19 KM/H\nMINIMUM CENTRAL PRESSURE...996 MB...29.42 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe government of Mexico has discontinued the Tropical Storm Warning\nsouth of Puerto San Andresito, south of Loreto, and south of\nGuaymas.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Tropical Storm Warning is in effect for...\n* The west coast of the Baja California peninsula from Puerto San\nAndresito to San Jose de Las Palomas\n* The east coast of the Baja California peninsula from Loreto to\nIsla San Luis\n* Mainland Mexico from Guaymas to Puerto Libertad\n\nInterests elsewhere in the Mexican states of Baja California and\nSonora should monitor the progress of Lidia.\n\nFor storm information specific to your area, please monitor\nproducts issued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 300 AM MDT (0900 UTC), the center of Tropical Storm Lidia was\nlocated over Baja California Sur near latitude 27.2 North, longitude\n113.6 West.  Lidia is moving toward the northwest near 12 mph (19\nkm/h), and this motion is expected to continue through Sunday.  A\nturn toward the west-northwest is forecast by Sunday night.  On the\nforecast track, Lidia's center will move near or along the west\ncoast of the Baja California peninsula through tonight and then\ngradually move away from land on Sunday.\n\nMaximum sustained winds are near 45 mph (75 km/h) with higher gusts.\nWeakening is forecast, and Lidia is expected to become a tropical\ndepression tonight and then a remnant low on Sunday.\n\nTropical-storm-force winds extend outward up to 175 miles (280 km)\nmainly to the northeast and southeast of the center.\n\nThe estimated minimum central pressure is 996 mb (29.42 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Lidia is expected to produce total rain accumulations of\n4 to 8 inches across the Mexican states of Baja California Sur into\nBaja California and the coastal section of Sonora and northern\nSinaloa, with isolated maximum amounts of 12 inches. These rains may\ncause life-threatening flash floods and mudslides. Some of the\ntropical moisture from Lidia will spread across parts of the desert\nSouthwest this holiday weekend for an increase in scattered showers\nand thunderstorms, from southern Nevada and western Arizona into\nsouthern California.\n\nWIND:  Tropical storm conditions are occurring over portions of the\nwarning area in the Mexican states of Baja California Sur, Baja\nCalifornia, and Sonora.  These conditions should spread northward\nacross the remainder of the warning areas through the day.  Wind\nspeeds atop and on the windward sides of hills and mountains are\noften up to 30 percent stronger than the near-surface winds\nindicated in this advisory, and in some elevated locations could be\neven greater.\n\nSTORM SURGE:  Some coastal flooding is possible in areas of onshore\nwinds along the Baja California peninsula.  Near the coast, the\nsurge will be accompanied by large waves.\n\nSURF:  Swells generated by Lidia are affecting portions of the coast\nof western mainland Mexico and the west coast of Baja California\nSur.  These swells could cause life-threatening surf and rip current\nconditions.  Please consult products from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 600 AM MDT.\nNext complete advisory at 900 AM MDT.\n\n$$\nForecaster Berg\n\nNNNN",
    "messageBinNumber": "4",
    "messageDateTimeLocal": "20170902 03:00:00 AM MDT",
    "messageDateTimeLocalStr": "0300 AM MDT Sat Sep 02",
    "messageDateTimeUTC": "20170902 09:00:00 AM UTC",
    "messageDateTimeUTC24": "201709020900",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "NW OR 320 DEGREES",
    "systemGeoRefPt1": "ABOUT 80 MI...130 KM W OF SANTA ROSALIA MEXICO",
    "systemGeoRefPt2": "ABOUT 100 MI...160 KM ESE OF PUNTA EUGENIA MEXICO",
    "systemIntensityKph": "75",
    "systemIntensityKts": "40",
    "systemIntensityMph": "45",
    "systemMslpInHg": "29.42",
    "systemMslpMb": "996",
    "systemName": "LIDIA",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "19",
    "systemSpeedKts": "10",
    "systemSpeedMph": "12",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1504342800"
  }
}
