{
  "cycloneMessage": {
    "advisoryNumber": "11A",
    "atcfID": "EP142017",
    "centerLocLatitude": "24.1",
    "centerLocLatitudeExpanded": "24.1N",
    "centerLocLongitude": "-111.1",
    "centerLocLongitudeExpanded": "111.1W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPEP4 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Lidia Intermediate Advisory Number 11A\nNWS National Hurricane Center Miami FL       EP142017\n600 AM MDT Fri Sep 01 2017\n\n...CENTER OF LIDIA MOVING ONSHORE INTO BAJA CALIFORNIA SUR...\n...HEAVY RAINS CONTINUE OVER SOUTHERN BAJA CALIFORNIA SUR...\n\n\nSUMMARY OF 600 AM MDT...1200 UTC...INFORMATION\n----------------------------------------------\nLOCATION...24.1N 111.1W\nABOUT 45 MI...70 KM W OF LA PAZ MEXICO\nABOUT 90 MI...145 KM ESE OF CABO SAN LAZARO MEXICO\nMAXIMUM SUSTAINED WINDS...65 MPH...100 KM/H\nPRESENT MOVEMENT...NW OR 325 DEGREES AT 8 MPH...13 KM/H\nMINIMUM CENTRAL PRESSURE...988 MB...29.18 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Tropical Storm Warning is in effect for...\n* Baja California peninsula from San Jose de Las Palomas to Isla\nSan Luis\n* Mainland Mexico from Altata to Puerto Libertad\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area within 36 hours.\n\nInterests elsewhere in western Mexico and the Baja California\npeninsula should monitor the progress of Lidia.\n\nFor storm information specific to your area, please monitor\nproducts issued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 600 AM MDT (1200 UTC), the center of Tropical Storm Lidia was\nlocated near latitude 24.1 North, longitude 111.1 West.  Lidia is\nmoving toward the northwest near 8 mph (13 km/h), and this motion\nwith an increase in forward speed is expected through Saturday\nnight.  On the forecast track, the center of Lidia will move near or\nalong the west coast of the Baja California peninsula through\nSaturday and then move west of the peninsula over the Pacific waters\nSaturday night.\n\nMaximum sustained winds are near 65 mph (100 km/h) with higher\ngusts.  Weakening is forecast during the next couple of days while\nLidia interacts with the mountainous terrain of the Baja California\npeninsula.  Lidia is expected to become a remnant low by Saturday\nnight.\n\nTropical-storm-force winds extend outward up to 195 miles (315 km),\nespecially to the northeast and southeast of the center.\n\nThe estimated minimum central pressure is 988 mb (29.18 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Lidia is expected to produce total rain accumulations of\n6 to 12 inches across the Mexican states of Baja California Sur into\nBaja California, Sinaloa, and the coastal section of Sonora, with\nisolated maximum amounts of 20 inches.  These rains may cause\nlife-threatening flash floods and mudslides.  Some of the tropical\nmoisture from Lidia may reach parts of the Desert Southwest this\nholiday weekend, including southern California, southern Nevada, and\nsouthwestern Arizona.\n\nWIND:  Tropical storm conditions are occurring over the southern\nportion of Baja California Sur at this time.  These conditions\nshould spread northward across the warning areas of the Baja\nCalifornia peninsula and mainland Mexico through Saturday.  Wind\nspeeds atop and on the windward sides of hills and mountains are\noften up to 30 percent stronger than the near-surface winds\nindicated in this advisory, and in some elevated locations could be\neven greater.\n\nSTORM SURGE:  A dangerous storm surge is expected to produce coastal\nflooding in areas of onshore winds on the southern portion of Baja\nCalifornia Sur.  Near the coast, the surge will be accompanied by\nlarge and destructive waves.\n\nSURF:  Swells generated by Lidia are affecting portions of the coast\nof southwestern and western Mexico and southern portions of Baja\nCalifornia Sur, and could cause life-threatening surf and rip\ncurrent conditions.  Please consult products from your local weather\noffice.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 900 AM MDT.\n\n$$\nForecaster Beven\n\nNNNN",
    "messageBinNumber": "4",
    "messageDateTimeLocal": "20170901 06:00:00 AM MDT",
    "messageDateTimeLocalStr": "0600 AM MDT Fri Sep 01",
    "messageDateTimeUTC": "20170901 12:00:00 PM UTC",
    "messageDateTimeUTC24": "201709011200",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "NW OR 325 DEGREES",
    "systemGeoRefPt1": "ABOUT 45 MI...70 KM W OF LA PAZ MEXICO",
    "systemGeoRefPt2": "ABOUT 90 MI...145 KM ESE OF CABO SAN LAZARO MEXICO",
    "systemIntensityKph": "100",
    "systemIntensityKts": "55",
    "systemIntensityMph": "65",
    "systemMslpInHg": "29.18",
    "systemMslpMb": "988",
    "systemName": "LIDIA",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "13",
    "systemSpeedKts": "7",
    "systemSpeedMph": "8",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1504267200"
  }
}
