{
  "cycloneMessage": {
    "advisoryNumber": "8",
    "atcfID": "EP142017",
    "centerLocLatitude": "22.3",
    "centerLocLatitudeExpanded": "22.3N",
    "centerLocLongitude": "-109.7",
    "centerLocLongitudeExpanded": "109.7W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPEP4 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Lidia Advisory Number   8\nNWS National Hurricane Center Miami FL       EP142017\n900 AM MDT Thu Aug 31 2017\n\n...CENTER OF LIDIA APPROACHING THE CABO SAN LUCAS AREA...\n...CONDITIONS DETERIORATING ACROSS SOUTHERN BAJA CALIFORNIA SUR...\n\n\nSUMMARY OF 900 AM MDT...1500 UTC...INFORMATION\n----------------------------------------------\nLOCATION...22.3N 109.7W\nABOUT 45 MI...70 KM SSE OF CABO SAN LUCAS MEXICO\nMAXIMUM SUSTAINED WINDS...50 MPH...85 KM/H\nPRESENT MOVEMENT...NNW OR 340 DEGREES AT 9 MPH...15 KM/H\nMINIMUM CENTRAL PRESSURE...994 MB...29.36 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe Government of Mexico has extended the Tropical Storm Warning\nfor the Baja California peninsula to cover the area from Punta\nAbreojos to Mulege.  The Government of Mexico has also issued a\nTropical Storm Watch for the Pacific coast of the Baja California\npeninsula north of Punta Abreojos to Punta Eugenia, for the east\ncoast of the Baja California peninsula north of Mulege to Bahia De\nLos Angeles, and for the Mexican mainland north of Bahia Kino to\nPuerto Libertad.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Watch is in effect for...\n* Baja California Sur from Puerto Cortes to east of La Paz\n\nA Tropical Storm Warning is in effect for...\n* Baja California peninsula from Puerto Abreojos to Mulege\n* Mainland Mexico from Bahia Tempehuaya to Bahia Kino\n\nA Tropical Storm Watch is in effect for...\n* Baja California peninsula north of Punta Abreojos to Punta Eugenia\n* Baja California peninsula north of Mulege to Bahia De Los Angeles\n* Mainland Mexico north of Bahia Kino to Puerto Libertad\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area within 36 hours.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, generally within 48 hours.\n\nInterests elsewhere in western Mexico and the Baja California\npeninsula should monitor the progress of this system.\n\nFor storm information specific to your area, please monitor\nproducts issued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 900 AM MDT (1500 UTC), the center of Tropical Storm Lidia was\nlocated near latitude 22.3 North, longitude 109.7 West. Lidia is\nmoving toward the north-northwest near 9 mph (15 km/h) and this\ngeneral motion is expected to continue through Friday, with a turn\ntoward the northwest expected Friday night.  On the forecast track,\nthe center of Lidia will be near the southern tip of the Baja\nCalifornia peninsula during the next several hours, and will move\nover the peninsula through Friday night.\n\nMaximum sustained winds have increased to near 50 mph (85 km/h) with\nhigher gusts.  Some additional strengthening is possible today.\nWeakening is expected tonight through Friday night as the center\nmoves over the Baja California peninsula.\n\nTropical-storm-force winds extend outward up to 160 miles (260 km)\nfrom the center.  A Mexican automated station near Cabo San Lucas\nrecently reported a sustained wind of 59 mph (95 km/h) and a wind\ngust of 78 mph (126 km/h) at an elevation of 735 ft (224 m).\n\nThe estimated minimum central pressure is 994 mb (29.36 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Lidia is expected to produce total rain accumulations of\n8 to 12 inches across the Mexican states of Baja California Sur into\nBaja California and western Jalisco, with isolated maximum totals of\n20 inches. In the Mexican states of Sinaloa, Nayarit, Colima,\nsouthern Michoacan, southern Sonora and central Jalisco, rainfall\namounts of 3 to 6 inches are expected. These rains are expected to\ncause life-threatening flash floods and mudslides.\n\nWIND:  Tropical storm conditions are spreading over the southern\nportion of Baja California Sur at this time.  These conditions\nshould spread northward across the warning area today through\nFriday.  Hurricane conditions are possible within the hurricane\nwatch area late today.  Tropical storm conditions are expected in\nthe warning area in mainland Mexico starting later today or\ntonight. Tropical storm conditions are possible in the watch areas\nlate Friday or Friday night.  Wind speeds atop and on the windward\nsides of hills and mountains are often up to 30 percent stronger\nthan the near-surface winds indicated in this advisory, and in some\nelevated locations could be even greater.\n\nSTORM SURGE:  A dangerous storm surge is expected to produce coastal\nflooding in areas of onshore winds on the southern portion of Baja\nCalifornia Sur.  Near the coast, the surge will be accompanied by\nlarge and destructive waves.\n\nSURF:  Swells generated by Lidia are affecting portions of the coast\nof southwestern and western Mexico and southern portions of Baja\nCalifornia Sur, and could cause life-threatening surf and rip\ncurrent conditions. Please consult products from your local weather\noffice.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 1200 PM MDT.\nNext complete advisory at 300 PM MDT.\n\n$$\nForecaster Beven\n\nNNNN",
    "messageBinNumber": "4",
    "messageDateTimeLocal": "20170831 09:00:00 AM MDT",
    "messageDateTimeLocalStr": "0900 AM MDT Thu Aug 31",
    "messageDateTimeUTC": "20170831 03:00:00 PM UTC",
    "messageDateTimeUTC24": "201708311500",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "NNW OR 340 DEGREES",
    "systemGeoRefPt1": "ABOUT 45 MI...70 KM SSE OF CABO SAN LUCAS MEXICO",
    "systemIntensityKph": "85",
    "systemIntensityKts": "45",
    "systemIntensityMph": "50",
    "systemMslpInHg": "29.36",
    "systemMslpMb": "994",
    "systemName": "LIDIA",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "15",
    "systemSpeedKts": "8",
    "systemSpeedMph": "9",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1504191600"
  }
}
