{
  "cycloneMessage": {
    "advisoryNumber": "5A",
    "atcfID": "EP142017",
    "centerLocLatitude": "20.4",
    "centerLocLatitudeExpanded": "20.4N",
    "centerLocLongitude": "-109",
    "centerLocLongitudeExpanded": "109.0W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPEP4 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Lidia Intermediate Advisory Number 5A\nNWS National Hurricane Center Miami FL       EP142017\n600 PM MDT Wed Aug 30 2017\n\n...LARGE DISTURBANCE SOUTH OF MEXICO IS NOW TROPICAL STORM LIDIA...\n...VERY HEAVY RAIN CONTINUING OVER SOUTHWESTERN MEXICO...\n\n\nSUMMARY OF 600 PM MDT...0000 UTC...INFORMATION\n----------------------------------------------\nLOCATION...20.4N 109.0W\nABOUT 180 MI...290 KM SSE OF THE SOUTHERN TIP OF BAJA CALIFORNIA\nMAXIMUM SUSTAINED WINDS...40 MPH...65 KM/H\nPRESENT MOVEMENT...NNW OR 345 DEGREES AT 7 MPH...11 KM/H\nMINIMUM CENTRAL PRESSURE...1001 MB...29.56 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Watch is in effect for...\n* Baja California Sur from Puerto Cortes to east of La Paz\n\nA Tropical Storm Warning is in effect for...\n* Baja California Sur from Puerto Cortes to San Evaristo\n* mainland Mexico from Bahia Tempehuaya to Huatabampito\n\nA Tropical Storm Watch is in effect for...\n* Baja California Sur from north of San Evaristo to Loreto\n* north of Puerto Cortes to Puerto San Andresito\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area within 36 hours.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, generally within 48 hours.\n\nInterests elsewhere in western Mexico and Baja California Sur should\nmonitor the progress of this system.\n\nFor storm information specific to your area, please monitor\nproducts issued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nThe large area of disturbed weather south of the Baja California\nPeninsula has consolidated and is now Tropical Storm Lidia. At 600\nPM MDT (0000 UTC), Lidia was centered near latitude 20.4 North,\nlongitude 109.0 West. The system is moving toward the north-\nnorthwest near 7 mph (11 km/h), and this general motion is expected\nto continue for the next couple of days. On the forecast track, the\ncenter of Lidia will be near the southern tip of the Baja California\npeninsula by late Thursday, and near Baja California Sur on Friday.\n\nMaximum sustained winds remain near 40 mph (65 km/h) with higher\ngusts. Some strengthening is forecast during the next 48 hours, and\nLidia still has the opportunity to become a hurricane before\nlandfall.\n\nTropical-storm-force winds extend outward up to 115 miles (185 km)\nfrom the center.\n\nThe estimated minimum central pressure is 1001 mb (29.56 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Lidia is expected to produce total rain accumulations of\n8 to 12 inches across the Mexican states of Baja California Sur and\nwestern Jalisco, with isolated maximum totals of 20 inches.  In the\nMexican states of Sinaloa, Nayarit, Colima, southern Michoacan,\nsouthern Sonora and central Jalisco, rainfall amounts of 3 to 6\ninches are expected. These rains are expected to cause\nlife-threatening flash floods and mudslides. There are already\nreports of road closures due to mud-slides in southwestern Mexico.\n\nWIND:  Tropical storm conditions are expected to first reach the\ncoast within the warning area by early Thursday, making outside\npreparations difficult or dangerous.  Hurricane conditions are\npossible within the hurricane watch area late Thursday.  Tropical\nstorm conditions are possible in the warning area in mainland Mexico\nstarting late on Thursday, and in the watch areas in Baja California\nSur on Friday.\n\nSTORM SURGE:  A dangerous storm surge is expected to produce\nsignificant coastal flooding near and east of the center over\nthe southern portion of Baja California Sur. Near the coast, the\nsurge will be accompanied by large and destructive waves.\n\nSURF:  Swells generated by Lidia are affecting portions of the coast\nof southwestern and western Mexico.  These swells will reach the\nsouthern portions of Baja California Sur tonight, and could cause\nlife-threatening surf and rip current conditions. Please consult\nproducts from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 900 PM MDT.\n\n$$\nForecaster Avila\n\nNNNN",
    "messageBinNumber": "4",
    "messageDateTimeLocal": "20170830 06:00:00 PM MDT",
    "messageDateTimeLocalStr": "0600 PM MDT Wed Aug 30",
    "messageDateTimeUTC": "20170831 12:00:00 AM UTC",
    "messageDateTimeUTC24": "201708310000",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "NNW OR 345 DEGREES",
    "systemGeoRefPt1": "ABOUT 180 MI...290 KM SSE OF THE SOUTHERN TIP OF BAJA CALIFORNIA",
    "systemIntensityKph": "65",
    "systemIntensityKts": "35",
    "systemIntensityMph": "40",
    "systemMslpInHg": "29.56",
    "systemMslpMb": "1001",
    "systemName": "LIDIA",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "11",
    "systemSpeedKts": "6",
    "systemSpeedMph": "7",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1504137600"
  }
}
