{
  "cycloneMessage": {
    "advisoryNumber": "17",
    "atcfID": "EP142017",
    "centerLocLatitude": "28.8",
    "centerLocLatitudeExpanded": "28.8N",
    "centerLocLongitude": "-115",
    "centerLocLongitudeExpanded": "115.0W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPEP4 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Lidia Advisory Number  17\nNWS National Hurricane Center Miami FL       EP142017\n200 PM PDT Sat Sep 02 2017\n\n...LIDIA CAUSING LIFE-THREATENING RAIN OVER PORTIONS OF BAJA\nCALIFORNIA AND MAINLAND MEXICO...\n\n\nSUMMARY OF 200 PM PDT...2100 UTC...INFORMATION\n----------------------------------------------\nLOCATION...28.8N 115.0W\nABOUT 70 MI...110 KM N OF PUNTA EUGENIA MEXICO\nMAXIMUM SUSTAINED WINDS...40 MPH...65 KM/H\nPRESENT MOVEMENT...NW OR 320 DEGREES AT 12 MPH...19 KM/H\nMINIMUM CENTRAL PRESSURE...999 MB...29.50 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe Government of Mexico has discontinued the Tropical Storm\nWarning for mainland Mexico, the west coast of the Baja California\npeninsula, and the east coast of the Baja California peninsula\nsouth of Bahia San Juan Bautista.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Tropical Storm Warning is in effect for...\n* The east coast of the Baja California peninsula from Bahia San\nJuan Bautista to Isla San Luis\n\nFor storm information specific to your area, please monitor\nproducts issued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 200 PM PDT (2100 UTC), the center of Tropical Storm Lidia was\nlocated near latitude 28.8 North, longitude 115.0 West. Lidia is\nmoving toward the northwest near 12 mph (19 km/h) and the system is\nexpected to turn toward the west-northwest at about the same rate\nof forward speed during the next two days.\n\nMaximum sustained winds are near 40 mph (65 km/h) with higher gusts.\nSome weakening is forecast during the next 48 hours. Lidia is\nexpected to weaken to a tropical depression tonight and become a\nremnant low on Sunday.\n\nTropical-storm-force winds extend outward up to 175 miles (280 km)\nfrom the center. A Mexican Navy observation site at Isla Cedros\nrecently recorded a wind gust of 39 mph (63 km/h).\n\nThe estimated minimum central pressure is 999 mb (29.50 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Lidia is expected to produce total rain accumulations of\n4 to 8 inches across the Mexican states of Baja California Sur into\nBaja California and the coastal section of Sonora and northern\nSinaloa, with isolated maximum amounts of 12 inches. These rains may\ncause life-threatening flash floods and mudslides. Some of the\ntropical moisture from Lidia will spread across parts of the desert\nSouthwest through this holiday weekend for an increase in scattered\nshowers and thunderstorms, from southern Nevada and western Arizona\ninto southern California.\n\nWIND:  Tropical storm conditions are occurring over portions of the\nwarning area in the Mexican state of Baja California, along the\ncoast of the Gulf of California.  These conditions should persist\nfor the next few hours.  Wind speeds atop and on the windward sides\nof hills and mountains are often up to 30 percent stronger than the\nnear-surface winds indicated in this advisory, and in some elevated\nlocations could be even greater.\n\nSTORM SURGE:  Some coastal flooding is possible in areas of onshore\nwinds along the Baja California peninsula.  Near the coast, the\nsurge will be accompanied by large waves.\n\nSURF:  Swells generated by Lidia are affecting portions of the coast\nof western mainland Mexico and the west coast of Baja California\nSur.  These swells could cause life-threatening surf and rip current\nconditions.  Please consult products from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 500 PM PDT.\nNext complete advisory at 800 PM PDT.\n\n$$\nForecaster Landsea\n\nNNNN",
    "messageBinNumber": "4",
    "messageDateTimeLocal": "20170902 02:00:00 PM PDT",
    "messageDateTimeLocalStr": "0200 PM PDT Sat Sep 02",
    "messageDateTimeUTC": "20170902 09:00:00 PM UTC",
    "messageDateTimeUTC24": "201709022100",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "NW OR 320 DEGREES",
    "systemGeoRefPt1": "ABOUT 70 MI...110 KM N OF PUNTA EUGENIA MEXICO",
    "systemIntensityKph": "65",
    "systemIntensityKts": "35",
    "systemIntensityMph": "40",
    "systemMslpInHg": "29.50",
    "systemMslpMb": "999",
    "systemName": "LIDIA",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "19",
    "systemSpeedKts": "10",
    "systemSpeedMph": "12",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1504386000"
  }
}
