{
  "cycloneMessage": {
    "advisoryNumber": "9A",
    "atcfID": "EP142017",
    "centerLocLatitude": "22.7",
    "centerLocLatitudeExpanded": "22.7N",
    "centerLocLongitude": "-110.2",
    "centerLocLongitudeExpanded": "110.2W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPEP4 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Lidia Intermediate Advisory Number 9A\nNWS National Hurricane Center Miami FL       EP142017\n600 PM MDT Thu Aug 31 2017\n\n...LIDIA HESITATES JUST SOUTHWEST OF CABO SAN LUCAS...\n...TROPICAL STORM CONDITIONS CONTINUE ACROSS SOUTHERN BAJA\nCALIFORNIA SUR...\n\n\nSUMMARY OF 600 PM MDT...0000 UTC...INFORMATION\n----------------------------------------------\nLOCATION...22.7N 110.2W\nABOUT 25 MI...40 KM SW OF CABO SAN LUCAS MEXICO\nMAXIMUM SUSTAINED WINDS...65 MPH...100 KM/H\nPRESENT MOVEMENT...NNW OR 335 DEGREES AT 8 MPH...13 KM/H\nMINIMUM CENTRAL PRESSURE...991 MB...29.27 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Watch is in effect for...\n* Baja California Sur from Puerto Cortes to east of La Paz\n\nA Tropical Storm Warning is in effect for...\n* Baja California peninsula from Punta Eugenia to Bahia San Juan\nBautista\n* Mainland Mexico from Bahia Tempehuaya to Bahia Kino\n\nA Tropical Storm Watch is in effect for...\n* Baja California peninsula north of Punta Eugenia to San Juan De\nLas Palomas\n* Baja California peninsula north of Bahia San Juan Bautista to\nIsla San Luis\n* Mainland Mexico north of Bahia Kino to Puerto Libertad\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area within 36 hours.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, generally within 48 hours.\n\nInterests elsewhere in western Mexico and the Baja California\npeninsula should monitor the progress of Lidia.\n\nFor storm information specific to your area, please monitor products\nissued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 600 PM MDT (0000 UTC), the center of Tropical Storm Lidia was\nlocated near latitude 22.7 North, longitude 110.2 West. Lidia has\nmoved very little during the past couple of hours, but is expected\nto resume a north-northwest track near 8 mph (13 km/h) tonight and\ncontinue through Friday. A turn toward the northwest is expected\nFriday night.  On the forecast track, the center of Lidia will move\nnear or over the Baja California peninsula through Friday night.\n\nMaximum sustained winds remain near 65 mph (100 km/h) with higher\ngusts.  No significant change in strength is expected this evening.\nThereafter, weakening is forecast as the circulation interacts\nwith the high terrain of the Baja California peninsula.\n\nTropical-storm-force winds extend outward up to 185 miles (295 km)\nmainly to the east of the center.  Surface observations indicate\nthat tropical-storm conditions are occurring over the southern end\nof the Baja California peninsula. Cabo San Lucas Marina recently\nreported a sustained wind of 44 mph (71 km/h) and a gust of 66 mph\n(106 km/h).\n\nThe estimated minimum central pressure is 991 mb (29.27 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Lidia is expected to produce total rain accumulations of\n8 to 12 inches across the Mexican states of Baja California Sur into\nBaja California and western Jalisco, with isolated maximum totals of\n20 inches. In the Mexican states of Sinaloa, Nayarit, Colima,\nsouthern Michoacan, southern Sonora and central Jalisco, rainfall\namounts of 3 to 6 inches are expected.  These rains are expected to\ncause life-threatening flash floods and mudslides.\n\nWIND:  Tropical storm conditions are occurring over the southern\nportion of Baja California Sur at this time.  These conditions\nshould spread northward across the warning area tonight through\nFriday night.  Hurricane conditions are possible within the\nhurricane watch area during the next several hours.  Tropical storm\nconditions are expected in the warning area in mainland Mexico\nthrough Friday.  Tropical storm conditions are possible in the watch\nareas Friday night or Saturday.  Wind speeds atop and on the\nwindward sides of hills and mountains are often up to 30 percent\nstronger than the near-surface winds indicated in this advisory, and\nin some elevated locations could be even greater.\n\nSTORM SURGE:  A dangerous storm surge is expected to produce coastal\nflooding in areas of onshore winds on the southern portion of Baja\nCalifornia Sur.  Near the coast, the surge will be accompanied by\nlarge and destructive waves.\n\nSURF:  Swells generated by Lidia are affecting portions of the coast\nof southwestern and western Mexico and southern portions of Baja\nCalifornia Sur, and could cause life-threatening surf and rip\ncurrent conditions. Please consult products from your local weather\noffice.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 900 PM MDT.\n\n$$\nForecaster Avila\n\nNNNN",
    "messageBinNumber": "4",
    "messageDateTimeLocal": "20170831 06:00:00 PM MDT",
    "messageDateTimeLocalStr": "0600 PM MDT Thu Aug 31",
    "messageDateTimeUTC": "20170901 12:00:00 AM UTC",
    "messageDateTimeUTC24": "201709010000",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "NNW OR 335 DEGREES",
    "systemGeoRefPt1": "ABOUT 25 MI...40 KM SW OF CABO SAN LUCAS MEXICO",
    "systemIntensityKph": "100",
    "systemIntensityKts": "55",
    "systemIntensityMph": "65",
    "systemMslpInHg": "29.27",
    "systemMslpMb": "991",
    "systemName": "LIDIA",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "13",
    "systemSpeedKts": "7",
    "systemSpeedMph": "8",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1504224000"
  }
}
