{
  "cycloneMessage": {
    "advisoryNumber": "14",
    "atcfID": "EP142017",
    "centerLocLatitude": "26.4",
    "centerLocLatitudeExpanded": "26.4N",
    "centerLocLongitude": "-112.9",
    "centerLocLongitudeExpanded": "112.9W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPEP4 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Lidia Advisory Number  14\nNWS National Hurricane Center Miami FL       EP142017\n900 PM MDT Fri Sep 01 2017\n\n...LIDIA FORECAST TO WEAKEN BUT EXPECTED TO DUMP ADDITIONAL RAIN...\n\n\nSUMMARY OF 900 PM MDT...0300 UTC...INFORMATION\n----------------------------------------------\nLOCATION...26.4N 112.9W\nABOUT 165 MI...265 KM SE OF PUNTA EUGENIA MEXICO\nABOUT 70 MI...115 KM SSW OF SANTA ROSALIA MEXICO\nMAXIMUM SUSTAINED WINDS...50 MPH...85 KM/H\nPRESENT MOVEMENT...NW OR 320 DEGREES AT 12 MPH...19 KM/H\nMINIMUM CENTRAL PRESSURE...994 MB...29.36 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe Government of Mexico has discontinued the Tropical Storm\nWarning for the west coast of the Baja California peninsula\nsouth of Puerto Cortes, and for the east coast of the peninsula\nsouth of San Evaristo. The Tropical Storm Warning for mainland\nMexico south of Huatabampito has also been discontinued.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Tropical Storm Warning is in effect for...\n* The west coast of the Baja California peninsula from San Jose de\nLas Palomas to Puerto Cortes\n* The east coast of the Baja California peninsula from Isla San\nLuis to San Evaristo\n* Mainland Mexico from Huatabampito to Puerto Libertad\n\nInterests elsewhere in northwestern Mexico and the Baja California\npeninsula should monitor the progress of Lidia.\n\nFor storm information specific to your area, please monitor\nproducts issued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 900 PM MDT (0300 UTC), the center of Tropical Storm Lidia was\nlocated near latitude 26.4 North, longitude 112.9 West. Lidia is\nmoving toward the northwest near 12 mph (19 km/h), and this general\nmotion is expected to continue for the next 48 hours.  On the\nforecast track, the center of Lidia will move near or along the west\ncoast of the Baja California peninsula for the next day or two.\n\nMaximum sustained winds are near 50 mph (85 km/h) with higher gusts.\nWeakening is forecast, and Lidia is expected to become a remnant low\nSaturday night or on Sunday.\n\nTropical-storm-force winds extend outward up to 175 miles (280 km)\nmainly to the east of the center.\n\nThe estimated minimum central pressure is 994 mb (29.36 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Lidia is expected to produce total rain accumulations of\n4 to 8 inches across the Mexican states of Baja California Sur into\nBaja California and the coastal section of Sonora and northern\nSinaloa, with isolated maximum amounts of 12 inches. These rains may\ncause life-threatening flash floods and mudslides. Some of the\ntropical moisture from Lidia will spread across parts of the desert\nSouthwest this holiday weekend for an increase in scattered showers\nand thunderstorms, from southern Nevada and western Arizona into\nsouthern California.\n\nWIND:  Tropical storm conditions are occurring in the warning area\nover portions of Baja California Sur and over portions of the\nMexican mainland at this time.  These conditions should spread\nnorthward across the warning areas of the Baja California peninsula\nand mainland Mexico through Saturday. Wind speeds atop and on the\nwindward sides of hills and mountains are often up to 30 percent\nstronger than the near-surface winds indicated in this advisory, and\nin some elevated locations could be even greater.\n\nSTORM SURGE:  A storm surge is expected to produce coastal flooding\nin areas of onshore winds in Baja California Sur.  Near the coast,\nthe surge will be accompanied by large waves.\n\nSURF:  Swells generated by Lidia are affecting portions of the coast\nof southwestern and western Mexico and southern portions of Baja\nCalifornia Sur, and could cause life-threatening surf and rip\ncurrent conditions.  Please consult products from your local weather\noffice.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 1200 AM MDT.\nNext complete advisory at 300 AM MDT.\n\n$$\nForecaster Avila\n\nNNNN",
    "messageBinNumber": "4",
    "messageDateTimeLocal": "20170901 09:00:00 PM MDT",
    "messageDateTimeLocalStr": "0900 PM MDT Fri Sep 01",
    "messageDateTimeUTC": "20170902 03:00:00 AM UTC",
    "messageDateTimeUTC24": "201709020300",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "NW OR 320 DEGREES",
    "systemGeoRefPt1": "ABOUT 165 MI...265 KM SE OF PUNTA EUGENIA MEXICO",
    "systemGeoRefPt2": "ABOUT 70 MI...115 KM SSW OF SANTA ROSALIA MEXICO",
    "systemIntensityKph": "85",
    "systemIntensityKts": "45",
    "systemIntensityMph": "50",
    "systemMslpInHg": "29.36",
    "systemMslpMb": "994",
    "systemName": "LIDIA",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "19",
    "systemSpeedKts": "10",
    "systemSpeedMph": "12",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1504321200"
  }
}
