{
  "cycloneMessage": {
    "advisoryNumber": "5",
    "atcfID": "EP142017",
    "centerLocLatitude": "20.1",
    "centerLocLatitudeExpanded": "20.1N",
    "centerLocLongitude": "-108.8",
    "centerLocLongitudeExpanded": "108.8W",
    "formationChancePct48h": "100",
    "formationChancePct5d": "100",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPEP4 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nPotential Tropical Cyclone Fourteen-E Advisory Number   5\nNWS National Hurricane Center Miami FL       EP142017\n300 PM MDT Wed Aug 30 2017\n\n...VERY HEAVY RAIN CONTINUING OVER SOUTHWESTERN MEXICO...\n...SYSTEM FORECAST TO BECOME A TROPICAL CYCLONE TONIGHT...\n\n\nSUMMARY OF 300 PM MDT...2100 UTC...INFORMATION\n----------------------------------------------\nLOCATION...20.1N 108.8W\nABOUT 205 MI...330 KM SSE OF THE SOUTHERN TIP OF BAJA CALIFORNIA\nMAXIMUM SUSTAINED WINDS...40 MPH...65 KM/H\nPRESENT MOVEMENT...NNW OR 345 DEGREES AT 7 MPH...11 KM/H\nMINIMUM CENTRAL PRESSURE...1002 MB...29.59 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nThe government of Mexico has issued a Tropical Storm Warning for\nmainland Mexico from Bahia Tempehuaya to Huatabampito, for\nthe east coast of Baja California Sur from west of La Paz to San\nEvaristo, and for the west coast of Baja California Sur from north\nof Santa Fe to Puerto Cortes.\n\nThe government of Mexico has issued a Tropical Storm Watch for the\nwest coast of Baja California Sur from north of Puerto Cortes to\nPuerto San Andresito.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Hurricane Watch is in effect for...\n* Baja California Sur from Puerto Cortes to east of La Paz\n\nA Tropical Storm Warning is in effect for...\n* Baja California Sur from Puerto Cortes to San Evaristo\n* mainland Mexico from Bahia Tempehuaya to Huatabampito\n\nA Tropical Storm Watch is in effect for...\n* Baja California Sur from north of San Evaristo to Loreto\n* north of Puerto Cortes to Puerto San Andresito\n\nA Hurricane Watch means that hurricane conditions are possible\nwithin the watch area.\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area within 36 hours.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, generally within 48 hours.\n\nInterests elsewhere in western Mexico and Baja California Sur should\nmonitor the progress of this system.\n\nFor storm information specific to your area, please monitor\nproducts issued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 300 PM MDT (2100 UTC), the disturbance was centered near latitude\n20.1 North, longitude 108.8 West. The system is moving toward the\nnorth-northwest near 7 mph (11 km/h), and this general motion is\nexpected to continue for the next couple of days.  On the forecast\ntrack, the center of the disturbance or the tropical cyclone will be\nnear the southern tip of the Baja California peninsula by late\nThursday, and near Baja California Sur on Friday.\n\nMaximum sustained winds are near 40 mph (65 km/h) with higher gusts.\nSome strengthening is forecast during the next 48 hours and the\nsystem could still become a hurricane before landfall.\n\nThe disturbance appears to be developing a better defined center,\nand only a small increase in organization would lead to the\nformation of a tropical depression or storm.\n* Formation chance through 48 hours...high...near 100 percent\n* Formation chance through 5 days... high...near 100 percent\n\nTropical-storm-force winds extend outward up to 115 miles (185 km)\nfrom the center.\n\nThe estimated minimum central pressure is 1002 mb (29.59 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  The system is expected to produce total rain\naccumulations of 8 to 12 inches across the Mexican states of Baja\nCalifornia Sur and western Jalisco, with isolated maximum totals of\n20 inches.  In the Mexican states of Sinaloa, Nayarit, Colima,\nsouthern Michoacan, southern Sonora and central Jalisco, rainfall\namounts of 3 to 6 inches are expected. These rains are expected to\ncause life-threatening flash floods and mudslides.\n\nWIND:  Tropical storm conditions are expected to first reach the\ncoast within the warning area by early Thursday, making outside\npreparations difficult or dangerous.  Hurricane conditions are\npossible within the hurricane watch area late Thursday.  Tropical\nstorm conditions are possible in the warning area in mainland Mexico\nstarting late on Thursday, and in the watch areas in Baja California\nSur on Friday.\n\nSTORM SURGE:  A dangerous storm surge is expected to produce\nsignificant coastal flooding near and east of the center over\nthe southern portion of Baja California Sur. Near the coast, the\nsurge will be accompanied by large and destructive waves.\n\nSURF:  Swells generated by the disturbance are affecting portions of\nthe coast of southwestern and western Mexico.  These swells will\nreach the southern portions of Baja California Sur later today, and\ncould cause life-threatening surf and rip current conditions.\nPlease consult products from your local weather office.\n\n\nNEXT ADVISORY\n-------------\nNext intermediate advisory at 600 PM MDT.\nNext complete advisory at 900 PM MDT.\n\n$$\nForecaster Blake\n\nNNNN",
    "messageBinNumber": "4",
    "messageDateTimeLocal": "20170830 03:00:00 PM MDT",
    "messageDateTimeLocalStr": "0300 PM MDT Wed Aug 30",
    "messageDateTimeUTC": "20170830 09:00:00 PM UTC",
    "messageDateTimeUTC24": "201708302100",
    "messageType": "ROUTINE ADVISORY",
    "systemDirectionOfMotion": "NNW OR 345 DEGREES",
    "systemGeoRefPt1": "ABOUT 205 MI...330 KM SSE OF THE SOUTHERN TIP OF BAJA CALIFORNIA",
    "systemIntensityKph": "65",
    "systemIntensityKts": "35",
    "systemIntensityMph": "40",
    "systemMslpInHg": "29.59",
    "systemMslpMb": "1002",
    "systemName": "FOURTEEN",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "11",
    "systemSpeedKts": "6",
    "systemSpeedMph": "7",
    "systemType": "POTENTIAL TROPICAL CYCLONE",
    "timeEpochSeconds": "1504126800"
  }
}
