{
  "cycloneMessage": {
    "advisoryNumber": "3A",
    "atcfID": "EP202017",
    "centerLocLatitude": "12.0",
    "centerLocLatitudeExpanded": "12.0N",
    "centerLocLongitude": "-89.3",
    "centerLocLongitudeExpanded": "89.3W",
    "formationChancePct48h": "N/A",
    "formationChancePct5d": "N/A",
    "issuingUnit": "NWS NATIONAL HURRICANE CENTER MIAMI FL",
    "message": "ZCZC MIATCPEP5 ALL\nTTAA00 KNHC DDHHMM\n\nBULLETIN\nTropical Storm Selma Intermediate Advisory Number 3A\nNWS National Hurricane Center Miami FL       EP202017\n700 PM CDT Fri Oct 27 2017\n\n...SELMA HOLDING STEADY IN STRENGTH WHILE MOVING CLOSER TO THE\nCOAST OF EL SALVADOR...\n\n\nSUMMARY OF 700 PM CDT...0000 UTC...INFORMATION\n----------------------------------------------\nLOCATION...12.0N 89.3W\nABOUT 120 MI...190 KM S OF SAN SALVADOR EL SALVADOR\nMAXIMUM SUSTAINED WINDS...40 MPH...65 KM/H\nPRESENT MOVEMENT...N OR 350 DEGREES AT 7 MPH...11 KM/H\nMINIMUM CENTRAL PRESSURE...1005 MB...29.68 INCHES\n\n\nWATCHES AND WARNINGS\n--------------------\nCHANGES WITH THIS ADVISORY:\n\nNone.\n\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:\n\nA Tropical Storm Warning is in effect for...\n* Entire coast of El Salvador\n\nA Tropical Storm Watch is in effect for...\n* Pacific coast of Guatemala\n\nA Tropical Storm Warning means that tropical storm conditions are\nexpected somewhere within the warning area, in this case within the\nnext 24 hours.\n\nA Tropical Storm Watch means that tropical storm conditions are\npossible within the watch area, in this case within the next 24\nhours.\n\nInterests in western Honduras should monitor the progress of Selma.\n\nFor storm information specific to your area, please monitor\nproducts issued by your national meteorological service.\n\n\nDISCUSSION AND 48-HOUR OUTLOOK\n------------------------------\nAt 700 PM CDT (0000 UTC), the center of Tropical Storm Selma was\nlocated near latitude 12.0 North, longitude 89.3 West. Selma is\nmoving toward the north near 7 mph (11 km/h), and that general\nmotion is expected during the next day or so.  On the forecast\ntrack, the center of Selma is forecast to make landfall along the\ncoast of El Salvador or Guatemala on Saturday.\n\nMaximum sustained winds remain near 40 mph (65 km/h) with higher\ngusts.  Little change in strength is forecast before Selma reaches\nthe coast of Central America.  Rapid weakening is forecast after\nlandfall, and Selma is expected to dissipate over the mountains of\nCentral America Saturday night or early Sunday.\n\nTropical-storm-force winds extend outward up to 45 miles (75 km)\nfrom the center.\n\nThe estimated minimum central pressure is 1005 mb (29.68 inches).\n\n\nHAZARDS AFFECTING LAND\n----------------------\nRAINFALL:  Selma is expected to produce total rain accumulations of\n3 to 6 inches over El Salvador, southern Guatemala, southern\nHonduras and far western Nicaragua over the next couple of days.\nIsolated maximum amounts of 10 inches are possible in El Salvador\nand southern Guatemala.  This rainfall could cause life-threatening\nflash floods and mudslides.\n\nWIND:  Tropical storm conditions are expected to first reach the\ncoast within the warning area by early Saturday, making outside\npreparations difficult or dangerous.  Tropical storm conditions\nare possible within the watch area by early Saturday.\n\nSURF:  Swells generated by Selma are beginning to affect portions\nof the coasts of Nicaragua, Honduras, El Salvador and Guatemala.\nThese swells are likely to cause life-threatening surf and rip\ncurrent conditions.  Please consult products from your local\nweather office.\n\n\nNEXT ADVISORY\n-------------\nNext complete advisory at 1000 PM CDT.\n\n$$\nForecaster Cangialosi\n\nNNNN",
    "messageBinNumber": "5",
    "messageDateTimeLocal": "20171027 07:00:00 PM CDT",
    "messageDateTimeLocalStr": "0700 PM CDT Fri Oct 27",
    "messageDateTimeUTC": "20171028 12:00:00 AM UTC",
    "messageDateTimeUTC24": "201710280000",
    "messageType": "INTERMEDIATE ADVISORY",
    "systemDirectionOfMotion": "N OR 350 DEGREES",
    "systemGeoRefPt1": "ABOUT 120 MI...190 KM S OF SAN SALVADOR EL SALVADOR",
    "systemIntensityKph": "65",
    "systemIntensityKts": "35",
    "systemIntensityMph": "40",
    "systemMslpInHg": "29.68",
    "systemMslpMb": "1005",
    "systemName": "SELMA",
    "systemSaffirSimpsonCategory": "N/A",
    "systemSpeedKph": "11",
    "systemSpeedKts": "6",
    "systemSpeedMph": "7",
    "systemType": "TROPICAL STORM",
    "timeEpochSeconds": "1509148800"
  }
}
